{
  "id": "twin_mrdeeds23",
  "username": "mrdeeds23",
  "activity_count": 1,
  "interests": [
    "with",
    "race",
    "this",
    "that",
    "some"
  ],
  "post_times": [
    1751319228.0
  ],
  "history_sample": [
    {
      "id": "1lojy8v",
      "title": "Race Report - Tromso Midnight Sun Marathon 2025",
      "selftext": "# Race Information\n\n* **Name:** Tromso Midnight Sun Marathon\n* **Date:** 6/21/25\n* **Distance:** 26.2 miles\n* **Location:** Tromso, Norway\n* **Time:** 3:54:34\n\n# Goals\n\n|Goal|Description|Completed?|\n|:-|:-|:-|\n||\n||||\n|A|Sub 4:00|*Yes*|\n|B|Sub 4:45|*No*|\n\n# Splits\n\n|Distance|Time|\n|:-|:-|\n||\n|||\n|5k|25:39 (PR)|\n|10K|51:56 (PR)|\n|10 Mile|1:24:10 (PR)|\n|Half Marathon Split|1:50:50 (PR)|\n|30k|2:40:00 (PR)|\n|26.2|3:54:34 (PR)|\n\n# Training\n\nBit of background for me - I'm in my mid 30s and very active with a lot of running, cycling, hiking, trail running, ice hockey and golfing (walking when I play 99% of the time). The last 6 years I've been a lot more consistent with running as my primary exercise and keeping a decent baseline of fitness. I typically will do at least 1 half marathon race per year and a few other 10k, 10 miler and various trail races to keep things interesting. This would be my second marathon with my first being Jan 2023 which I finished 4hours23minutes.\n\nSince the first full, my running got more consistent and my goal for this was to go sub 4 hours. Through my increased training and other half marathon races I've done, I felt it was achievable but would be tough. My stretch goal was to go sub 3:45, but this was something I didn't really think possible until the race itself.\n\nMy friend found this event last year and we planned a vacation to Norway for it. I live in Colorado so the altitude for training would give me an advantage here as well as this is at sea level. For those not in the know, the race takes place in the arctic circle in a small town called Tromso way up north in Norway (highly recommend visiting if you can!). They do it on June 21st on the summer solstice when the sun never sets and the race starts at 9pm. It was quite bizarre to a) have a race that takes place at night like this but b) be running in complete sunlight at what should be night time. There are huge parties that go on all over Norway during the summer solstice but Tromso especially was wild with the race going on too.\n\nAfter deciding to sign up, my goal was officially to go sub 4 hours. I built a 4ish month plan running 5x per week starting in March based on something I found on the runnersworld site. I got some advice on my plan from some people in my run club who are more seasoned which was awesome and helped a lot.\n\nThe weather in Colorado can be unpredictable in the spring, but thankfully it was mostly good for training and only had a few days where I was forced to use a treadmill. My baseline mileage before starting was about 15-20 miles per week so I did not have any issues with the training. My rest days I would try to do some dedicated stretching and light weight lifting to give my legs a rest. Generally speaking, each week was broken down into this:\n\nMonday: Rest\n\nTuesday: Tempo or Interval Run\n\nWednesday: Easy Run at varying distance or time\n\nThursday: Tempo or Hills\n\nFriday: Rest or cross training with yoga/weights\n\nSaturday: 30minutes easy run\n\nSunday: Long run - 8 miles all the way up to 20 miles then tapering back down a few weeks out\n\nI was able to stick to this format for the most part and only had some slight knee pain towards the end on really big weeks which I would then adjust distances on the other runs as to not over train.\n\nNear the end of the block in May, I ran a half marathon race which I substituted a long run for to get a baseline of where I was fitness wise and double check nutrition/gear. The race could not have gone better and I finished in 1hour53minutes and had plenty of gas in the tank left afterwards. This gave me serious confidence I was on the right track and wouldn't have any issues on the full.\n\nNutrition wise I've been using the same gels, gummies and recovery drinks the past few years so none of that was new for my body thankfully. I also was somehow able to stay healthy and not get sick at all during the training block which was a huge blessing.\n\n# Pre-race\n\nWe flew into Europe the Wednesday before the Saturday race to give us plenty of time to get on schedule there and get some rest. Sleep was interesting with the sun not setting basically at all, but the 2 days before the race I was able to get 2 nights of 8 hours proper and feel good. We spend 1.5 days in Oslo where I did a 2 mile shakeout run, then after arriving in Tromso Friday AM I did a quick 1.5 mile run there as well with a local run club.\n\nAs this again was a night time race (yet in the sunlight) starting at 830PM, I was a little lost at first of how to handle logistics. I wanted to make sure I was properly fueled, but not too full so I came up with this idea: Day of the race, have a big breakfast, moderate size pasta lunch, then a snack later in the day. I didn't want to have a big dinner right before and be too full or risk GI issues during the race. I also tried to hydrate throughout the day with a few nuun tablets, stay off my feet as much as possible and try to have a quick nap. Thankfully I got good night sleep the day before and slept in a bit, followed by an epic breakfast buffet at hour hotel (European breakfast buffets FTW!)\n\nWe met up with our friends for some pastries and coffee an hour after that and then rested for a few hours. I had a nice pasta dish for lunch around 2pm with some bread and my 2nd nuun tablet/water there. Following lunch we went back to the hotel and I tried to take a quick nap and get some rest in. The pre-race nerves started kicking in and I couldn't nap so I started getting my race clothes ready and gels/bib in order. About 6pm I ate a banana and some leftover pastries which were nice and stretched for about 30 minutes.\n\nThis is where I can really appreciate morning races because from here, I still had an hour and a half until start time with not much to do. My stomach was starting to act up due to nerves so had to deal with that as well and try to rehydrate a bit. For gels I had 6 Gu Roctane's with me for the race. 3 with caffeine (strawberry kiwi) and 3 without (lemonade). These are the same ones and amount I used on my first marathon and it worked out super well for me. I use the same on half races (2 instead of 6) and also trained with these on my long runs too so my body was well ready for them.\n\nLuckily, the start line was about 500ft from our hotel so I didn't have to stress about getting there at all. About 30 minutes prior to start time I got dressed, put some vaseline on the bits and armpits, had a bit more water and went down to stretch and get lined up.\n\nThe weather was a bit of a toss up too for me as it was forecast to be between 44F and 51F during the race and humid. Typically, i'll wear just lined shorts and a tank top but I was between that and a heavier t-shirt due to the wind/temps. I ended up going with the tank which I later regretted, but for the most part worked out. I did a quick jog around the block to get the legs warmed up and some final stretches then got situated for the start. There were no starting groups, just markers for finish times so I got near the 345-4h marker.\n\n# Race\n\nLined up for the start I was feeling good, temperatures were nice in the high 40s, felt ready to attack the course at sea level. The start line was next to the local cruise port so as the countdown hit 1, the cruise ship docked blasted its horn which was a nice little touch. The first mile goes through downtown Tromso with loads of people lined on the streets, then immediately turns to go up and over the famous [Tromso bridge](https://en.wikipedia.org/wiki/Troms%C3%B8_Bridge). It's not a ton of incline but still right at the start I was aiming to go intentionally slower then blast down it to continue on course at my planned pace.\n\nMy planned pace for the race was around 8min50s miles and trying to start out a little slower than that due to the incline. My first few splits ended up being 8:49 (+127ft gain), 7:56 (-133ft), followed by \\~8m30s miles until mile 17. My heart rate was in a really good place too so I decided not to modify things and push on at this pace despite being a bit faster than I wanted. The elevation outside of the bridge was pretty steady and the temperatures remained great from what I could feel. My watch pace alerts were yelling at me, but I pushed through and surprised myself with how easy the miles were coming and going.\n\nThe first slight issue I had was that after maybe mile 3 or so I was getting hungry and realizing I should have possibly eaten a little more. From past experiences I know its better to get ahead of hunger on course so I took my first gel around 25 minutes into the race vs the 40 minute mark which I planned. This kind of threw me off schedule with the gel and I got in my head about this. My hunger eventually went away, but the aid stations with water were at odd intervals (or so it felt) so it became difficult to manage the timing with those. I eventually was able to turn off my pace alerts that were interrupting my music which was good.\n\nThe 2nd issue faced was my big toe on my right foot catching the front of my shoe in a weird way. These were my Altra Vanish Carbon race shoes which I've wore for a half marathon and about 15 miles or so otherwise of training so they were well broken in. The socks I was wearing I had worn before too so this was something totally new and unexpected. Managed to push through but it was pretty painful the last 10 miles or so and here I am 9 days later with a black toenail which will surely come off.\n\nThe course was absolutely gorgeous. I probably lost a few minutes fiddling with my phone to take photos and videos but i'm glad I did. It was so surreal running through the nordic countryside with stunning views of mountains and the water everywhere. There were also tons of locals outside their houses and flats with Norway flags, bonfires going, and people passing out beers and shots.\n\nThankfully once I was on course my body didn't really register what time it was at all and I was locked in on the race. After hitting the half marathon marker and seeing I was at 1hour 50 and getting a PR there, I knew that sub 4 or better was definitely possible. I tried to let off the gas a little bit as I knew it would be tougher towards the end as it was during my first marathon. With some elevation in favor, I continued around the 8m30s pace until mile 17 or so then as I returned to cross the bridge again I pulled back to 9m+ miles for the remaining.\n\nMile 20, like in my first marathon, was again a big struggle moment knowing I still had another 6 to go. I passed some of our friends watching which gave me some temporary energy but it was quickly gone as fatigue set in, the toe pain got worse, and the gels started to not settle well. It's hard to remember exactly, but I took my last caffeine gel around mile 20 and it seemed to sit in my upper chest and not really go down. This is something I've not really had happen ever during a race or training so I was lost on what to do. I walked the 2nd to last aid station to try and get it down but it still wasn't quite right. Feeling weak and knowing I was slowing, I tried the last gel at mile 23 and the last aid station and that one too didn't go down well. I ended up not finishing the gel and throwing some sports mix on top to push it down which didn't work either.\n\nMy last 3 miles were \\~10min10seconds and very painful. I was genuinely trying to just keep my feet moving and not puke on the side of the course. I slowly got into downtown where the finish was and felt worse and worse. I saw my wife and friends near the finish cheering me on as I passed through the finish line and stopped my watch. I was briefly so stoked about my time but I immediately felt terrible as the endorphins died off.\n\n# Post-race\n\nI slowly collected my medal, extra ripe banana and cold bottle of water and tried to find a place to sit down. I drank the cold water trying to catch my breath and decide if I was going to puke or not while my friends and wife came to congratulate me. At this point, my body started to drop in temperature as it was close to 40f now and I was in wet shorts and a tank from the sweat. I sat there for 5 minutes as my buddy got me a cup of warm water from a nearby store which helped a lot. I was dizzy, nauseous, freezing and wet. I questioned if I pushed too hard or was just dressed poorly and didn't eat enough, but at that point I just wanted to get out of there.\n\nWe took a few photos, hobbled back to the hotel where I ultimately puked up the last 2 gels and a lot of water. I've never puked after any running event or physical event for that matter so that was new to me. Immediately my stomach felt better thankfully and I was able to get down my tailwind recovery drink with some bread and take a hot shower. At that point, the stoke came back and I couldn't stop smiling that I smashed my goal of finishing sub 4 and all the hard work paid off.\n\nAll in all, I would HIGHLY recommend this event to anyone who can make it up to Tromso. It's by far one of the most beautiful places I've ever been to and the event was great from start to finish. The training block I did was a huge success and I am super thrilled with the result and hitting personal bests in almost all categories for me. I told myself after the first marathon I wasn't sure if i'd do another, but after this one I'm almost certain I've got more in me.",
      "author": "mrdeeds23",
      "created_utc": 1751319228.0,
      "score": 44,
      "num_comments": 18,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "instagram",
    "youtube"
  ]
}