{
  "id": "twin_liasadako",
  "username": "liasadako",
  "activity_count": 1,
  "interests": [
    "mile",
    "marathon",
    "with",
    "from",
    "training"
  ],
  "post_times": [
    1745957207.0
  ],
  "history_sample": [
    {
      "id": "1kaxjgb",
      "title": "Race Report: Big Sur International Marathon, my first marathon",
      "selftext": "**Race Info**\n\n**Name**: Big Sur International Marathon\n\n**Date**: April 27th, 2025\n\n**How far?** 26.2mi\n\n**Finish Time:** 05:52:09 (chip time)\n\n**Race Splits (from official results)**\n\n5 mile: 01:00:21 (12:04min/mi)\n\n8.2mi: 01:46:09 (12:56)\n\n13.1mi: 02:53:17 (13:13)\n\n15.2mi: 03:20:33 (13:11)\n\n21.2mi: 04:45:16 (13:27)\n\n24mi: 05:22:27 (13:26)\n\nOverall pace: 13:26min/mi\n\n**Goal**:\n\nA: Finish by 6hr cutoff - yes\n\nB: Finish in 5:45 - no\n\nC: Finish in 5:30 - no\n\n**Background**\n\nI'm 28F and picked up running originally in 2019 training for the Seawheeze half marathon with friends. I finished that race in 2:42:40 with a lot of foot pain and stopped running, had a severe hockey injury (tib fib) later that year and with the injury and subsequent pandemic was very sedentary for a couple years. After picking up other sports and getting active again I came back around to it and ran the Beat the Blerch 10k in 2023 (1:17), then the UW Cherry Blossom Half in 2024 (2:26), then decided to sign up for the 2024 Victoria Marathon and the 2025 Big Sur Marathon. I DNF'd the Victoria marathon at 22.5 miles as my leg was acting up, I had only run up to a half marathon in training for that marathon and hadn't followed a training plan.\n\n**Plan**\n\nI originally talked to family who had run marathons and picked out the Hal Higdon Marathon 3 training plan so that I could balance running + winter sports + the rest I needed. The plan called for 3 runs a week with some cross training, gradually increasing from a 6 mile long run to multiple 20 mile long runs. Once I was at 12 weeks from the marathon I also turned on the Strava marathon training plan for reminders.\n\n**Training**\n\nI neglected the training plan in December and January and when I picked it back up I fell behind in mileage as I was struggling to complete long runs. I kept loosely to the 3 run structure with easy run, medium/pacing run, long run. However my long run made up most of my distance and I ranged from 25-50km a week. I did one 15 (3/2), one 18 (3/23), and one 20 mile run (4/5) with 10-12 mile long runs in between the increased weeks. One of the shorter long runs in between (11mi 3/14) was a failed attempt at 16/17 miles. Most long runs included up to 1000ft of elevation--needed for big sur training in particular, but also an inevitable result of trying to fit in more than 10 miles of running around Seattle.\n\nAs I tapered from the 20 mile run I did a 13.1 mile run 4/12 and an 8 mile run 4/20. Week of the marathon I ran 5k Monday and jogged/walked 2.5 miles the day before the marathon after arriving in Monterey.\n\nHonestly obvious takeaways here are I should have stuck better to the training plan--if I had worked my way up through the early weeks, it wouldn't have been so hard to run and recover from the longer runs later in the process. That being said, getting up to 20 miles made a huge difference from the Victoria marathon attempt. With the 15, 18, and 20 mile runs I also fueled as I would for the marathon (eggs for breakfast, Xact nutrition bars and motts fruit snacks during run plus optional kit kat treats) and figured out what I would wear (Salomon adv skin 12 women's hydration vest, GC leggings, cherry blossom half shirt, brooks ghost max 2).\n\n**Pre-Race**\n\nI flew to California on Friday afternoon and drove to Seaside. Had a pasta lunch and sushi dinner. On Saturday morning I did a shakeout jog/walk (2.5 miles), picked up my bib and shirt at the race expo, and then made the unwise decision to explore the Monterey Bay aquarium. Afterward my friends picked up groceries for breakfast while I got my stuff ready and we had a pizza dinner around 6. Was in bed by 8:30 with an alarm set for 3:10am. Woke up several times worried about having my bus pickup ticket and bag ready.\n\nDay of, woke up at 3:10 and had 2 pre-boiled eggs and packed a bagel and cream cheese and another egg for the bus ride. Filled up water and walked to the bus stop with my friend--we also met another runner staying in the Airbnb next to ours. Got on the bus at 4am on the dot and absolutely zoned out for the 1hr15 bus ride in the dark, ate my bagel and egg as we got close. I knew it was going to be raining so I brought a rain jacket that I could either check or donate, but I noticed almost all the runners brought garbage bags and foil to sit on as we were waiting for an hour and a half in the rain to start after getting off the bus. Turns out that was the way to go. Split up from my friend as I was in B corral and he was in C (we definitely put the wrong times in our signups). I grabbed a tea and went through the port a potty lines, wandered around until I handed in my jacket and gear check bag at around 6:15 and started stretching. My rough plan for starting the race was to start at the very back of the corral, start off at a comfortable pace and let people pass me, and see whether I fell in better with the 5:30 or 5:50 pace groups.\n\n**Race**\n\nMile 1: lightly downhill through the woods, faster than expected, but getting thoroughly passed as the plan called for.\n\nMile 2/3: rolling hills through the woods, my friend from the C corral caught and passed me, feeling pretty good. First xact bar at mile 2 (just the one caffeinated one for the start).\n\nMile 4: breaking out of the woods and into the rain, getting back to a more sustainable pace but still feeling good. At this point I was no longer getting passed as much and had plenty of space to myself.\n\nMile 5-10: second xact bar at mile 5. the hills begin, I kind of forgot where hurricane hill was so I kept thinking it was right around the corner. Views insane. Around the 10k point I realized I am going too fast again (should not be hitting 1:15 10k). Third xact bar at mile 8.\n\nI met up with and was passed by the 5:30 pace group somewhere around mile 10-11.\n\nMile 11-12: fighting up hurricane hill. I did my best to measure my heart rate and walk whenever I went over 165, until I was back down below 150. Jogged/ran more than I expected to but still slowed down significantly. By mile 12 I was starting to feel miserable as I was soaked through and my clothes were sticking to me, tried rolling my sleeves up and down and fussing with it mostly made it worse. Ate fourth xact bar and a couple of fruit snacks on the hill.\n\nMile 12-14: was starting to lose it, also had forgotten where the pianist was meant to be so felt discouraged after there were no aid/entertainment stations on top of hurricane hill. But I started to hear piano around the corner! Reaching Bixby bridge I felt ecstatic and started to feel much better. Fifth bar at mile 14.\n\nMile 15-18: more great views but I did start to lose steam, took more brief walk breaks on hills to maintain heart rate. Some fruit snacks, plus sixth bar at mile 17.\n\nMile 19-20: struggling!! Started to get more spectators and started snacking more as I realized I had a lot left. Turned on my headphones, seventh bar at mile 20.\n\nMile 20-23: joined the 5:50 pace group and became one with the 5:50 hive mind. When the pacer walked I walked, when he jogged I jogged, matched his steps as much as I could. Eighth bar at mile 23.\n\nMile 23-24: powered by strawberry station, took back off, sang along a bit to my music when I was away from the pack. Let my heart rate get higher as I was pretty sure I was on track to finish comfortably, ran more walked less.\n\nMile 25-26: really powered through, walked a bit on the hills but tried to keep my momentum, snacked, took every single electrolyte drink offered. Aid stations were packing up at this point. Kept going!! Saw my friends at the finish line and finished strong and posed for the photos. I took the finisher cookies and my friends met me around the corner with hot chocolate and a croissant. Picked up a finisher jacket!\n\nThe hardest miles were probably coming down off of Hurricane Hill in the rain at mile 12 and hitting mile 19-20, but at both points I was able to recover and keep running. Before the race I did set up a Garmin pacepro strategy for 5:45 and the extra views for elevation and time remaining were useful but the splits were confusing, and I made the overly optimistic decision to set it to negative splits which made the splits much further off than they needed to be.\n\n**Post-race**\n\nAte cookies, croissant, hot chocolate, gatorade, cheeseburger, yam fries, and zucchini sticks in the subsequent hour or so. Had dessert for dinner. Wore my medal everywhere. Watched a lot of Ted Lasso. The next day I got in the ocean to \"ice\" my legs, walked around town a little bit, and then flew home.\n\nI'm really happy with this! If I try to run another marathon I will stick to my training better and start the race slower, but I honestly am just thrilled to have finished. I am signed up for a half marathon in the fall, I think that's my preferred distance and what I'm capable of really training for for now, but I'm proud to have pushed to the marathon distance this year. And actually enjoyed it! Big Sur was beautiful. The rain was mainly an upside coming from Seattle--I was worried about the heat and sun running in California.",
      "author": "liasadako",
      "created_utc": 1745957207.0,
      "score": 77,
      "num_comments": 18,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "youtube"
  ]
}