{
  "id": "twin_Imaginary-Royal-4735",
  "username": "Imaginary-Royal-4735",
  "activity_count": 1,
  "interests": [
    "race",
    "that",
    "this",
    "mile",
    "with"
  ],
  "post_times": [
    1742822234.0
  ],
  "history_sample": [
    {
      "id": "1jiqfg3",
      "title": "Eastern States 20 miler Race Report",
      "selftext": "### Race of my life (so far)\n* **Name:** Eastern States 20 miler\n* **Date:** March 16, 2025\n* **Distance:** 20 miles\n* **Location:** Kittery, ME\n* **Video recap:** https://youtu.be/yU5nmDeyGps\n* **Strava:** https://www.strava.com/activities/13901171788\n* **Time:** 2:23:33\n\n### Goals\n| Goal | Description | Completed? |\n|------|-------------|------------|\n| A | sub 2:20 (7:00/mi pace) | *No* |\n| B | sub 2:30 (7:30/mi pace) | *Yes* |\n| C | don't bonk (and have to walk) | *Yes* |\n| D | finish | *Yes* |\n\n### Splits\n| Mile | Time |\n|------|------|\n| 1 | 7:05\n| 2 | 6:55\n| 3 | 7:04\n| 4 | 7:07\n| 5 | 7:09\n| 6 | 6:55\n| 7 | 7:07\n| 8 | 7:08\n| 9 | 7:09\n| 10 | 7:11\n| 11 | 7:03\n| 12 | 7:10\n| 13 | 7:08\n| 14 | 7:07\n| 15 | 7:09\n| 16 | 7:11\n| 17 | 7:19\n| 18 | 7:31\n| 19 | 7:20\n| 20 | 7:12\n\n### Training\nI've been loosely training for the REVEL white mountain marathon in may, but as a somewhat new \"serious\" runner -- and by \"serious\" I mean entirely \"someone who signs up for a lot of races\" (don't get the wrong idea, I do NOT think of myself as fast), this was a great race to get under my belt. It's a race that many Boston marathoners do as one of the last longer training runs in their block, given the convenient timing and 20 mile distance. A friend convinced me and two others from our run club to run it together a month ago, so I've had good time to prepare. Since the beginning of 2025, I've decided to really ramp up mileage, mostly on a whim and partially because I have this goal of building up to 100 MPW. Suffice it to say this goal is HARD, and I've been lucky to average 60ish MPW. But because I had the month notice, I came into this race with a little bit of a taper, doing two lower volume weeks leading up to the race.\n\nOne wrench thrown into the mix of the taper: a 5K that I was already committed to, unfortunately set for the day before my 20 mile race. Because I had a bit of a local rivalry against another runner (only in my head – he’s actually much faster than me) I intended to show up for, I had decided to run both races full out. In short, my 5k did not go well. My rival crushed me, I ran 35 seconds above my intended goal of sub-20, and my minute positive split of 6:05, 6:30, 6:59 pretty much summed up the race. Which is to say: PAIN. I'm pretty new to races, so my apparently nonexistent sense of pacing, especially for shorter distances, really shone here.\n\nGiven this 5k performance I'll admit I had quite a lot of doubts coming into the race. I really thought at this point I was a sub-20 5k kind of a runner, but having given it my absolute all, dying at the end, only for a sloppy-ass 20:33 (rightfully) knocked my inflated ego down a peg.\n\nOn the day one of my three friends was shooting for even splits of 7:30 throughout the race, and another was shooting for negative splits to hit an average of 7:00. My plan was to stay right behind 7:30 friend for most of the race before ideally starting a slow kick around mile 15.\n\n### Pre-Race\nThe buses were slated to leave at 8:45am from the parking lot for a 11am gun, which meant generously, at least 1.5 hrs of waiting at the start -- not super appreciated by our crew given it was another 1.5 hours to drive to the parking lot in the first place. Of course when we get there its a two lane road with hundreds of drivers on it, so there was inevitable traffic meaning inevitable bus delays meaning nowhere near a 8:45 last bus departure time. In the end, I didn't mind it too much, since at the starting line there was a school we could go inside of to stay warm and sit. Apparently they didn't give access to the school last year, which I could definitely anticipate being frustrating.\n\nI guess the other huge benefit of being at the start line for so long is that I could go to the bathroom multiple times. 4, to be exact. As they say, third time’s the charm, and it was for me -- after that trip I knew immediately I had shaved at least 10 minutes off my time :).\n\nProbably should have gotten a little longer of a warm up in, but I settled for a 10minute jog and called it a day. Didn't have any breakfast, but did have a stick of Clif energy Bloks, along with some zero cal gatorade. Nutrition was actually on point the entire race. In previous marathons, I've done gels which are annoying to open and always get my hands all sticky/gross, but for the day I had a small bag of skratch sour gummies that I would periodically pop one of into my mouth. This worked like a charm, and I'll be definitely trying this again in future races.\n\n### Race\nHead-Windy. Foggy. Long stretches of Coastal gloom. But also the perfect temperature --low 50s-- and along with the fog, a whole race blessed with uninterrupted cloud cover. I'd take the last two over the first three any day, so for me, race conditions were pretty great. A cool thing about the fog was that every now and then you'd run into a section where the fog lifted, and for that section I felt a huge mental boost, as if my mind was suddenly shaken awake. Those periodic moments of mental clarity were greatly appreciated and quite motivating. \n\nAnyways, right as the race started plans of tailing my 7:30 friend were thrown out the window. He started fast, with a 7:15 first mile, and I felt good and followed for all of maybe a kilometer before passing him near the end of a 7:05 mile 1. From then on I had my sights set on my other buddy, who was planning on negative splitting to average 7:00s. I locked in behind him for the first few miles, before he started to widen the gap mid-race. \n\nAt this point, I am acutely aware of two things: \n1. At low 7:00s I’m kind of a speedy mofo right now, especially given yesterday’s 5k \nending with a third mile split of 6:59. (blehh …)\n2. I feel good. Or rather … ok. Like I might just have the ability to stick this out for the rest \nof the race\nStarting from mile 7 or 8, around when the course moves out of the town of Kittery and into the actual (high-winds) seacoast, I become aware of another thing. Someone is drafting behind me! I speed up a little, and the footsteps get faster along with mine. I slow down, they slow down too. You know what? Fair fucking play. I’ll admit later on in the race it took me a bit longer than it should’ve for me to pass others too. It’s windy out there, and players got to play. \n\nThis stretch of seacoast, around miles 7 to 16, moves fast but starts feeling a bit tougher as we run along. It’s basically flat, but there are a few stretches of just the slightest uphill whisper, and those gradients begin to feel a bit more noticeable. \n\nSometimes in training, and generally, in running, I like to think about the squeeze. I come from a background of competitive chess, and there are positions which require you to slowly squeeze the opponent, to apply pressure ever so slightly and surely, and slowly, before they finally cave and crumble from the weight of all the impending pressure. The positional bind just becomes too strong. In this section of miles 7-16, I like to think Eastern States was starting the squeeze on me. \n\nAnd if we continue the analogy, Mile 17 is when I start to feel the bind. Mile 17 is TOUGH. Legs are getting heavy, the person in front of me is getting a little farther away, and every little anthill begins to feel like the end of a brutal hill workout. And then if mile 17 is tough, mile 18 is PAIN. We’ve arrived into Portsmouth now, which means that the two-lane highway besides us has become a sprawling 4 lanes. What’s worse is the imperceptible grade, coupled with emboldened headwinds. My cadence decreases, not for lack of trying, and with every turn my legs feel like they’re being dragged out of mud. It’s at this point that I seriously contemplate stopping and walking the rest. It’s been a good race after all. Didn’t think I’d get this far anyways. A sandbagging group of runners pass me, doubling down on my feeling of despair. \n\nWhat keeps me going is the runner in front of me that also gets passed – someone I haven’t seen before. A beacon of light in an otherwise gloomy world. I realize that I must be going faster than her, since it seems like I am barely inching closer. She’s just within the perfect realm of doubt on whether I can catch up to her in the last mile and a half, and I commit myself to at least matching her cadence. \n\nMiles 18.5-19.5 are passed in this way, but it still feels BAD. Like my body is ready to STOP. Like actually, it’s been ready to stop 30 minutes ago. But nevertheless, I have gained some ground on the runner ahead of me.  With .25 to go, I prepare for the all out kick. I think I pass her at 19.85, but by then passing her is already a foregone conclusion. I lock in to the runner after, next in line in striking distance, and sprint as fast as I can, which to be honest, is not that fast right now. Still, I edge him out right at the finish line. A picture perfect finish. 😊 \n\n### Post-race\n\n2:23:33. Holy moly. I am SPEED (or, rather, speed’s underdeveloped toenail). I am also, GASSED. I stumble up to my friend who has finished more than two minutes ahead of me, mumble something incoherent, and make a beeline for the snack table where I proceed to down three vitamin waters, two bags of Pirate’s Booty, and 2 yogurt sticks. For the next 10 minutes I walk around in a daze, resisting the immediate urge to drop to the floor and have my legs completely give out under me. The post-race cold settles in, \nAfter everyone’s finished, we head to a brewery nearby and get some well-deserved (and tasty) grub. An excellent finish to an excellenter day. \n\n### Final thoughts\n\nMan, racing is awesome. Especially when you pass people. \n\nIt’s funny, not too long ago I actively avoided racing. It just felt like a big fuss over nothing, and something that I had to pay for on top of. Running for me was something I did purely for the love of the activity itself, a tool for maintaining my health, for keeping me sane in an otherwise monotonous world. \n\nI still love running, and I will never stop appreciating running for, at the least, nothing more than the pure love of the run. But now I’ve come to appreciate the specific joy of getting faster too. There is just something about racing that can bring out the best of you – something which I just cannot simulate while running on my own. It’s crazy to think that three years ago I could barely string together 10 minutes of continuous running at 8:30 pace, and that now I can freaking finish 20 miles at 7:09. What a strange, but wonderful world we live in. \n\nI recently started a youtube channel, and made a video recap of my race!    \nhttps://youtu.be/yU5nmDeyGps\n\nMade with a new [race report generator](http://sfdavis.com/racereports/) created by /u/herumph.\n",
      "author": "Imaginary-Royal-4735",
      "created_utc": 1742822234.0,
      "score": 5,
      "num_comments": 2,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "youtube"
  ]
}