{
  "id": "twin_AmbitiousLobster7459",
  "username": "AmbitiousLobster7459",
  "activity_count": 1,
  "interests": [
    "that",
    "battery",
    "more",
    "features",
    "metrics"
  ],
  "post_times": [
    1744381896.0
  ],
  "history_sample": [
    {
      "id": "1jwraxg",
      "title": "My old Garmin workhorse still does more right than most new sports watches",
      "selftext": "I've used the 955, 255, 945, and even recently tried Coros — but I keep coming back to my old 735XT. Why? Because it's the only watch that truly nailed what matters.\n\nThe 945 came close on weight, battery, and features. Coros has a slick UI but wildly inflated battery claims. Yet the 735XT’s no-nonsense simplicity and reliability still stand out:\n\n* Slim, lightweight, genuinely comfortable\n* Reliable GPS and multisport tracking\n* Native power and sensor support\n* No bulky wrist HR bump or AMOLED gimmicks\n* Just enough features — no bloat\n* Solid battery (but ready for a modern upgrade)\n* No music, no pay, no AMOLED, no faux recovery metrics\n* No overhyped multiband GPS that wrecks battery life  \n\nWhat we really need is a **735XT+**:\n\n* More accurate GPS and long multi-day battery (\\~30–40+ hrs)\n* Native power, sensor, and zone graph support\n* Accurate training effect/load via external HRM\n* Simple real-world metrics like endurance/hill score — *done well*\n* Breadcrumb nav & route elevation profile — *minimum is enough*\n* No titanium bezel pretending we’re Navy SEALs  \n\nLet’s be real — most of us don’t smash our wrists on rocks. Few need a £600+ metal-encased smart-brick with flashlight mode and pulse ox in five colours.\n\nGarmin’s great at adding — and restricting — features across more confusingly overlapping models than anyone needs. Feature bloat, wrist irritation, and increasingly unreliable wrist HR come up again and again online. What we need is a return to focused, reliable endurance tools.\n\nThe 735XT was everything a performance watch needed (for its time): slim, light, durable. No fluff, no skin burn, no wellness metrics that cause more stress than they solve. Just the right tools, the right data, and the freedom to train hard and go long.\n\nGive us that again — with a modern twist, better battery, and tighter GPS — and it might just be the most perfect endurance watch on the market.\n\nHRV and stress metrics might help sell watches, but they don’t work for everyone. Some of us want less noise, not more. We want to be empowered by data not ruled by it. Garmin should offer a stripped-back but *powerful* training tool — not every athlete needs a wellness dashboard. \n\nWe want full access to core performance features like structured workouts, power support, navigation, and real world metrics — without the distraction of recovery voodoo or daily readiness scores.\n\nThe Forerunner 55 is too limited. The 955 is overloaded. Even the 255 — probably the closest — still falls short. It’s bulkier, less intuitive, and saddled with a flaky HR sensor that opens up sleep stages and HRV tracking most of us don’t genuinely need — and certainly can’t trust. Let’s not lose the tools that work, in pursuit of features we’ve been convinced we need.\n\nSome of us want to train hard and recover smart — but guided by feel, not fear. We want a watch that *supports* intuition, not replaces it. A durable, trusted workhorse that strips back the fluff but keeps the power. **This is why the 735XT+ will sell.**\n\nI would buy it in a heartbeat.\n\nAnyone else feel the same?\n\n",
      "author": "AmbitiousLobster7459",
      "created_utc": 1744381896.0,
      "score": 14,
      "num_comments": 30,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "youtube"
  ]
}