{
  "id": "twin_No-Dress4626",
  "username": "No-Dress4626",
  "activity_count": 1,
  "interests": [
    "about",
    "it's",
    "minute",
    "like",
    "sure"
  ],
  "post_times": [
    1747686558.0
  ],
  "history_sample": [
    {
      "id": "1kqmain",
      "title": "Ran a PB on Prednisone: not sure how I feel about it?",
      "selftext": "*(First time post - apologies if this should be on the achievements thread, but it's a wider question rather than my particularly wanting to mark what might be a fake achievement.)*\n\nI started running only in my late 40s, and initially I struggled to hit a 30 minute 5k. Once I could, trying to work towards a 25 minute 5k seemed like a realistic goal. It's taken me 3 years but, today (I'm just coming up to 51 now) I finally managed the distance in 24:57, which is \\~40 seconds off my previous PB.\n\nIt wasn't fun: really felt like I'd squeezed out the last of my energy and left me briefly nauseous. But I'm slightly bugged out by the fact I'm managed this while I'm on medication for rhinitis, a 10-day, 40mg/day course of Prednisone which I believe is a banned substance, known to improve performance.\n\nThat's not anything to worry about of course but knowing it did diminish my sense of achievement in having made the barrier. I don't know how much difference it might make, and I keep telling myself that it's no different to my going out and buying a pair of supershoes (I run in cheapy Floatride 4s) but a bit of me kind of feels a little sour about it.\n\nNot really sure where I go from here? Can I legitimately claim I ran a 25 minute 5k without riders? Is it something I should chalk up do the drugs and maybe build on, keep trying to beat, or even better once the medication is done - in honestly it felt like a lot of effort and I'm not getting any younger?  Or do I just say I'm happy having done it at all, ever, and go back to slightly less frantic runs?",
      "author": "No-Dress4626",
      "created_utc": 1747686558.0,
      "score": 50,
      "num_comments": 59,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "twitter",
    "reddit"
  ]
}