{
  "id": "twin_jessimckenzi",
  "username": "jessimckenzi",
  "activity_count": 1,
  "interests": [
    "race",
    "time",
    "mile",
    "with",
    "training"
  ],
  "post_times": [
    1747505609.0
  ],
  "history_sample": [
    {
      "id": "1kozeyh",
      "title": "Race Report: Big Sur Marathon (second marathon)",
      "selftext": "### Race Information\n* **Name:** Big Sur International Marathon\n* **Date:** April 27th, 2025\n* **Distance:** 26.2 miles\n* **Location:** Big Sur, CA (Carmel-by-the-Sea)\n* **Website:** https://www.bigsurmarathon.org/\n* **Time:** 4:51:31\n\n### Goals\n| Goal | Description | Completed? |\n|------|-------------|------------|\n| A | Finish in time limit | *Yes* |\n| B | Finish in less than 5 hours | *Yes* |\n| C | PR? | *Yes* |\n\n### Official results\n\n| 5 MILE \t| 00:54:12 |  10:50 min/mi\n| 8.2 MILE | 01:33:01 | 11:20 min/mi\n| 13.1 MILE | 02:29:02 | 11:22 min/mi\n| 15.2 MILE | 02:50:15 | 11:12 min/mi\n| 21.2 MILE |  03:58:30 |  11:15 min/mi\n| 24 Mile | 04:28:24 | 11:11 min/mi \n\n### Splits (from Garmin watch, so take with grain of salt?)\n| Mile | Time |\n|------|------|\n| 1 | 11:06\n| 2 | 10:58\n| 3 | 10:42\n| 4 | 10:39\n| 5 | 11:32\n| 6 | 10:52\n| 7 | 11:02\n| 8 | 11:43\n| 9 | 11:35\n| 10 | 10:57\n| 11 | 13:29 (big hill + portapotty stop)\n| 12 | 11:54\n| 13 | 8:40\n| 14 | 11:08\n| 15 | 10:34\n| 16 | 11:01\n| 17 | 11:11\n| 18 | 11:43\n| 19 | 11:22\n| 20 | 11:17\n| 21 | 11:04\n| 22 | 11:16\n| 23 | 10:13\n| 24 | 10:50\n| 25 | 10:20\n| 26 | 10:47\n| 27 | 9:26\n\n### Background\nThis was my (35F) second marathon. My first was Mount Desert Island in Maine in 2022, which I ran in 4:55:05. I did that without a time goal, just wanted to finish without walking except at aid stations. I was hesitant to say out loud I wanted to beat that time at Big Sur (even though I sorta did) because I knew it was a harder course, and before I started training again, my running habit was sporadic at best, so I was still functionally a beginner.\n\n### Training\nThe first time I ran I used the program in the book by the Iowa professors who taught the marathon class, The Non-Runner's Marathon Trainer. Highly recommend for the combination of physical and mental prep! Very, very good training program for new runners who just want to finish.\n\nThis time I used the \"To Finish\" program in the Galloway book MARATHON: YOU CAN DO IT. The Galloway plan was different in several key ways: It was longer, 26 weeks instead of 16; it called for just three runs a week instead of four; it ramped up to higher mileage (the longest run was 26 miles, instead of 18); and it required slowing down and taking regular walk breaks on long runs.\n\nI thought about following the time-goal plan for 4:40 but honestly it was too intimidating in terms of time commitment (4 runs/week + cross training) and running experience in general (I have never done mile repeats before). The \"To Finish\" program was ideal for me in terms of commitment level, and also it was nice to only have to run outside 3x a week while training through the winter. The \"To Finish\" ALSO called for cross training 3x a week but I really struggled to get that done and skipped most of them.\n\nIt is what it is, I did the most important part of the training, but I might have seen more improvement from my first marathon if I had done more XT, whether walking/cycling for cardiovascular health or more yoga to work on overall strength. (I did do a few yoga classes after some weekend long runs gave me knee pain, but couldn't keep up the habit and when the knee pain went away, I stopped going.)\n\nLongest training run was 26+ miles, which I finished in just under six hours even running slow/easy with very frequent walk breaks. Made me confident I could *most likely* finish Big Sur in the time limit.\n\n### Pre-race\nFlew into SFO from NYC on Thursday, spend night in Watsonville near family. Checked into hotel on Friday, easy 30 minute jog/walk on pedestrian/bike path in Monterey, Chinese take-out for dinner. Day of the race went to expo, went to beach, soaked in the hot tub (Is pre-race hot tubbing recommended or not? My boyfriend kept warning me to not get dehydrated but I thought relaxation would do me some good, keep me calm.) Pizza for dinner (restaurant was packed with other runners in the race shirt and I was sad to not be wearing mine). In bed relaxing by ~8 but realistically didn't fall asleep until 10 or 11. Had coffee on the bus, and a bar, and a banana someone left at the start line, and a stroopwafel right before race time.\n\n### Race\nIt was misty/rainy/chilly at the start line and I agonized over whether to wear a short or long sleeve t-shirt. I dreaded getting too hot if the rain let up later, so went with the short sleeves and I was cold for a good part of the early race, especially on walk breaks. Still, better too cold than too hot.\n\nMy strategy was to run for 4 minutes and walk for one, taking shorter walk breaks and running faster on downhills and longer walk breaks, if necessary, on uphills. It was really hard to stop and walk so early into the race, but I forced myself to stick with the plan, and honestly it worked out so well. I think I was able to conserve energy overall and sped up some at the end, relative to the middle of the race (first five miles were still the fastest but they're net downhill I think and I didn't run them significantly faster than the rest of the race). Also the mile downhill after Hurricane Point was the fastest ever recorded on my watch so that was fun!\n\nEverything went really well, even considering the rain. I did wish I ate more in advance, because even taking gels ~45 minutes or so my stomach started growling. My legs were twinge-y from the start but it never escalated to full blown pain.\n\nI was trading places with the Corral C 5:00 pacer for a while but eventually caught up to the Corral B 5:00 pacer and started to wonder if I should have been my ambitious when I gave my expected finish time so I was in Corral B. I wondered if I could have run a 4:50 if I had had a faster pacer to chase? Fastest in Corral C was 5:00... I had been afraid to set a specific time goal for myself because I didn't want to miss it but maybe I played it too safe?\n\n### Post-race\nOne thing that Galloway's method promises is that the walk breaks help you feel better after the race and I largely found that to be true. Vacationed in Big Sur and Yosemite the week after and went on lots of hikes, so leaned into active recovery. Biggest injury was a giant blister under one of my toenails, I think because of wet shoes/steep downhills.\n\nWas in general just so very pleased and proud with how this race went. I've run two marathons so far and both I chose because of the natural beauty of the setting more than anything else, so speed isn't my number one priority; feeling strong and enjoying myself is. But still, felt nice to knock ~3:30 off my previous time! It's not a dramatic improvement but still felt so good.\n\nMade with a new [race report generator](http://sfdavis.com/racereports/) created by /u/herumph.",
      "author": "jessimckenzi",
      "created_utc": 1747505609.0,
      "score": 49,
      "num_comments": 4,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "instagram",
    "youtube"
  ]
}