{
  "id": "twin_LBro32",
  "username": "LBro32",
  "activity_count": 1,
  "interests": [
    "miles",
    "with",
    "race",
    "training",
    "running"
  ],
  "post_times": [
    1745819221.0
  ],
  "history_sample": [
    {
      "id": "1k9od4a",
      "title": "Big Sur International 11 miler Race Report: A Triumphant Return to Running",
      "selftext": "\n\\### Race Information\n\n\\* \\*\\*Name:\\*\\* Big Sur International Marathon\n\n\\* \\*\\*Date:\\*\\* April 27, 2025\n\n\\* \\*\\*Distance:\\*\\* 11 miles\n\n\\* \\*\\*Location:\\*\\* Big Sur, CA\n\n\\* \\*\\*Time:\\*\\* 1:48:07\n\n\n\n\\### Goals\n\n| Goal | Description | Completed? |\n\n|------|-------------|------------|\n\n| A | 10:30/mile splits | \\*Yes\\* |\n\n| B | 10:00/mile splits | \\*Yes\\* |\n\n\n\n\\### Splits\n\n| Mile | Time |\n\n|------|------|\n\n| 1 | 10:07\n\n| 2 | 10:27\n\n| 3 | 9:55\n\n| 4 | 10:17\n\n| 5 | 10:00\n\n| 6 | 9:51\n\n| 7 | 10:21\n\n| 8 | 9:05\n\n| 9 | 9:23\n\n| 10 | 9:22\n\n| 11 | 9:03\n\n\n\n\\### Training\n\nI (30F) was an avid runner in my early 20s, running 5 half marathons at about 8:30/mile paces (1:47 PR). After absolutely no running in grad school and during COVID, I picked up running again about a year and a half ago. I ran the SF City Half Marathon this past summer with the goal of just finishing but really struggled - I could tell my legs were dead after the first 4.5 miles (all uphill) and blew up the last three miles. I decided for my next training cycle for the Big Sur 11 miler to add in more mileage and more strength training.\n\nMy plan (based on Hal Higdon's Intermediate 2 program) featured 4 days of running, one day of cross training, 2 days of strength training heavily focused on lower body and core, and 1 rest day per week. My 4 running days were split into a speed work day, a tempo run, an easy run, and my long run. My plan was 16 weeks, mileage peaked at 35 MPW, longest run was 10 miles, and had a two week taper.\n\nOverall, I stuck to my training plan pretty religiously. In the past, I was never one to deviate my paces in my training runs (all runs at medium-to-hard effort) and I went all in on Zone 2 training for my easy run and cross training (about 12-14 minute miles) and made my hard efforts, well, hard. I ran into trouble twice: once relatively early on related to health challenges and once when I finally broke 30MPW (even though I follow the 10% rule for weekly mileage add). As a runner with some chronic health problems, I expect them to flare up at some point and they flared hard around weeks 4-6. I made changes to my diet to increase overall calorie and carb intake, increased hydration SIGNIFICANTLY, and added electrolytes to my runs and was able to adjust. When I hit 30 MPW, I just started really feeling it in my body and had some runs where I just felt like I had no legs. As a result, I missed one long run (planned 9 miler) but was able to still hit my weekly mileage that week. The week after, I got a nasty sinus infection and missed another long run (planned 10 miler) as a result. I had originally planned on running an 11 mile long run but knowing this wasn't necessary, picked up with a 9 mile long run and then peaked at 10 miles. The 9 miler was ROUGH after skipping two long runs in a row, but I got through it and the 10 miler went really well.\n\nFor my last two long runs, I practiced my pacing for the 11-miler, starting conservatively for the first 3 miles, going to goal race pace for the middle 5 miles, and then doing what I can to add speed the last 3 miles. One of the biggest killers of my SF half was not having the legs for the hills and given that the Big Sur course is similarly hilly to the City half, I prioritized hills in my training, always starting the first hill uphill and doing at least half my miles uphill. \n\nI tapered the last two weeks, which worked out well, considering it coincided with traveling. I got less runs in than I wanted during my taper (just two 5 milers and three 3 milers), but reminded myself that I already put in the work and the goal of the taper is recovery.\n\nGoing into the race, my practice long runs indicated that a 10:10-10:20/mile pace would be realistic. I decided to start with a conservative B goal of 10:30s and an optimistic A goal of 10:00s.\n\n\\### Pre-race\n\nI arrived in Monterey on Saturday and went to the expo to get my bib and bus ticket. I also started getting seriously concerned about the weather forecast, which was very different than what I anticipated. They were having something of a cold front for this time of year and the projected starting temp was in the low to mid 40s, peaking in the low 50s during the race. There was also a significant chance of rain, which hadn't been anticipated. I picked up a rain hat and gloves at the expo (and was VERY glad I did).\n\nSince the Big Sur Marathon is run on Highway 1 and shuts it down, for the 11 miler, you are pretty much required to stay in Monterey and take one of the race shuttles in order to successfully get to the start line. I stayed at the Hyatt, which is a 5 minute drive from the Expo and bus pick up zone, but if I had to do it again, I would stay at the Marriott, which is walkable to both (literally across the street). \n\nThe shuttle check in was at 5:30AM, so on race morning, I woke up at 4:15AM with all of my gear already laid out. I ate a peanut butter and jelly sandwich and left at 5:05AM. I got to the shuttle at 5:25AM and we immediately departed. It was about a 45 minute drive on the shuttle and started pouring on our way over. We got dropped off at 6:10AM, 50 minutes before race start at 7AM. I was glad I decided to overprepare and wear a long sleeve, Sweatshirt, and rain shell with rain hat and gloves since the starting area was literally a pasture with no cover. I ate a bagel I had brought with me because I need to eat about 30 minutes before running (they did provide coffee which was nice). I waited until the last possible second to shed my rain gear for gear check at 6:45AM. I then used the bathroom and tried to warm up a little (don't expect to do a warm up run, it's a small pasture - I just did some dynamic stretching trying not to slip in the mud).\n\nThere are no corrals, so I just lined up with everyone else and they had us go in packs. We started on time and off we went!\n\n\\### Race\n\nThe race starts uphill immediately, which felt very familiar due to my training and was no problem, but I immediately saw other folks struggle out the start. I felt really fresh and the rain had temporarily stopped, so I got out to a quicker start than I anticipated, but knew it wasn't too fast that I would be cooked later. I went by RPE (4 out of 10) and made sure my first 3 miles felt easy - even though it poured the entire 2nd mile, which I actually tried to have fun with. It was still clear enough to see all the views though! The hills were rolling throughout the whole course and I slowed down about 20-30 seconds/mile on the hills, keeping to same perceived effort. \n\nAfter 3 miles, I decided to pick up to race pace effort, which is about a 6 out of 10 for me. It didn't end up resulting in much a pace increase, but I was able to comfortably maintain the fast pace I set out with. I take one Clif Blok every 20-30 minutes and found I needed them every 20 minutes. At about mile 5, I started feeling hungry, but fortunately, all of the aid stations (every 2 miles) had oranges, bananas, electrolytes, etc., so I downed a half a banana while maintaining pace at mile 6. \n\nI felt really strong going into my last 4 miles (and you hit a pretty significant downhill right at the end of mile 7), so I decided to go all out and just push as hard as I could until the end, knowing there was only one more hill. All of the Big Sur Marathon races end in the same place (12K, 11 miler, 21 miler, and marathon) and I ended up seeing my friend running the 12K at my mile 9, which gave me a good boost. The hardest hill of the race is a steep climb from 9.5-10 miles and I just held on for dear life, until finally hitting flat road for the last mile.\n\n\\### Post-race\n\nI exceeded all of my goals and finished with an average mile time of 9:48/mile and running below 10:30 for every mile. The course was absolutely beautiful and a really fun yet challenging run. It was also one of the best organized races I've ever been to, regarding gear check, aid stations, transportation, etc. I felt super proud of how my training paid off this go around. My goal is still to get back to my previous paces of 8:30-9 minute miles, but I felt this was a triumphant return to running.\n\n\n\n\n\nMade with a new \\[race report generator\\](http://sfdavis.com/racereports/) created by u/herumph.",
      "author": "LBro32",
      "created_utc": 1745819221.0,
      "score": 24,
      "num_comments": 1,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "youtube"
  ]
}