{
  "id": "twin_Sour_Flowers7235",
  "username": "Sour_Flowers7235",
  "activity_count": 1,
  "interests": [
    "that",
    "race",
    "time",
    "with",
    "because"
  ],
  "post_times": [
    1746194791.0
  ],
  "history_sample": [
    {
      "id": "1kd1tkn",
      "title": "Would you care if someone else ran under your bib (that you gave up) and their time \"messed up\" your run history/data?",
      "selftext": "Here's the story. Before I tell it, I've moved on and don't judge the guy for his choices. I'm more curious about other runners thoughts on the matter.\n\nMy hometown race is this weekend and it's always a fun time for me, like one big party weekend. It's not a world major marathon or race that sells out early. I have planned on doing the half with a friend for fun at party pace. Last weekend I ran a marathon with a goal time. I generally have a solid mix of goal races and fun races throughout the year.\n\nI held off on registration for the half because the charity I wanted to run for was having technical issues with the race organization, and I also had plans that could have changed, so I waited to see.\n\nIn my run club, there was a man who got injured and posted that he wanted to give his bib away, and I offered to pay but he said I should just pay for the transfer. He also mentioned in the post that it might be too late to transfer, and I expressed that I didn't mind either way and we agreed. I was also up front about running for fun. He deleted the post, emailed the organization, and I went about my week assuming I had a bib. After several days of not hearing anything, I messaged him. No response for two days. Then, yesterday he tells me that the organization wouldn't let him transfer because he already switched events. He also said that he was just going to let the bib go to waste because he didn't want to mess up his running history with the time I would run and I needed to get another one.\n\nI did find another bib, was able to get it transferred to my name, and I respect that he can do what he wants with a wasted $200 race registration. This led to my friend and I debating how much one's \"run history\" matters from race to race. The first time I ran a half marathon 10+ years ago I did so because a friend of a friend sold me his bib cheap when he got injured. He was elite seeded. So I thought I would bring this to a larger group. What do you think?\n\nTLDR: Man agrees to give up a bib due to injury, then changes his mind a week later because he doesn't want his race times \"messed up\" by someone else using his bib. I was just curious to know how the run community as a whole felt about it.",
      "author": "Sour_Flowers7235",
      "created_utc": 1746194791.0,
      "score": 0,
      "num_comments": 30,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "instagram",
    "youtube"
  ]
}