{
  "id": "twin_have_an_ok_day",
  "username": "have_an_ok_day",
  "activity_count": 1,
  "interests": [
    "scared",
    "marathon",
    "just",
    "want",
    "since"
  ],
  "post_times": [
    1753358941.0
  ],
  "history_sample": [
    {
      "id": "1m82ndh",
      "title": "I’m scared for my first marathon",
      "selftext": "EDIT: I DID IT!!! Ran the Chicago marathon yesterday. For anyone who happens across this again, I did it and I cried and I am so proud of myself. \n\nI’m athletic and love sports but man I hate running. So like any sane person I signed up for the Chicago marathon and got it. I’ve been training for a while now since I can’t run a mile without walking. I’ve gotten my mileage up to ten miles so far and am on track with a marathon plan. It’s just I’m super slow (13 min miles since I’m walking parts) and I feel like everything’s going wrong. Turns out I have mild compartment syndrome in my calf and my doctor wants an mri for my other knee since he thinks there could be complications there too. I just feel so injury prone but I’m doing everything right (PT, stretching, doctor). I want to do this. I want to run the marathon and I think I can I’m just scared. What if I do it and don’t finish? I know it happens to people and that’s their story but I would be embarrassed and sad and just I’m scared. Thanks for reading my rant and I guess I want to see if anyone else was scared before their first marathon and how do you get over it/what was making you scared or not scared\n\nPositive vibes only please\n\nEdit: addressing some comments - I do have the okay from PT and doctor to run it. I’m not worried about what my final time would be, I just want to be able to cross that finish line!",
      "author": "have_an_ok_day",
      "created_utc": 1753358941.0,
      "score": 105,
      "num_comments": 100,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "instagram",
    "youtube"
  ]
}