{
  "id": "twin_OCRrunner1000",
  "username": "OCRrunner1000",
  "activity_count": 1,
  "interests": [
    "that",
    "itch",
    "running",
    "just",
    "have"
  ],
  "post_times": [
    1744549021.0
  ],
  "history_sample": [
    {
      "id": "1jy713t",
      "title": "Scratching the itch of needing to be challenged",
      "selftext": "Hiya everybody!\n\nI'm 16 years old and have been running for quite a few years now. I run XC in HS which is going great. I love running and it definitely makes me proud of myself whenever I beat a PR on a certain distance. \n\nHowever, lately I've been feeling increasingly more like I truly want to do something that will challenge me to go beyond where I think I can go. Just \"plain old running\" wasn't scratching that itch for me anymore. \n\nI started incorporating other exercises/elements into my runs. Bear crawls, push-ups, burpees, mental challenges like memorizing strings of digits. Those definitely challenge me, but honestly at times it felt kinda lonely doing them, especially in shitty weather. Most friends and family just thinking you're crazy for going out to run in the rain. I want to find some kind of community of like-minded people.\n\nAbout a year ago I started running obstacle races. At first just 5k ones. I liked the atmosphere at most of those events. People helping it eachother out, having fun even when it got tough. For me it was awesome to find a way to scratch that itch of being challenged.  \n\nA few months back I managed to find a crazy enough friend to do a 13-mile spartan race with me this May. Our training has definitely brought us closer together. There's something very bonding about spending miles and miles running together, through the cold and the rain at times. Regardless of how that race goes, it's been a wonderful journey.\n\nI hope we manage to finish all the obstacles, maybe set a good time even. I'm sure we'll have a great time regardless. \n\nI'm already looking into what to do next after we do the spartan. Looking for a new way to scratch that seemingly unscratchable itch.\n(PS: All ideas are welcome🤣, feel free to DM)\n\nI wrote this because I know me and my friend aren't the only ones who have this need to be pushed. I know I'm not the only one who thinks  that they had a great day when you feel every muscle in your body cry for help when you go to bed in the evening. I'm just trying to spark off a fun discussion and getting to speak to some like-minded people.",
      "author": "OCRrunner1000",
      "created_utc": 1744549021.0,
      "score": 10,
      "num_comments": 31,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "youtube"
  ]
}