{
  "id": "twin_anon_72938",
  "username": "anon_72938",
  "activity_count": 1,
  "interests": [
    "race",
    "training",
    "around",
    "this",
    "miles"
  ],
  "post_times": [
    1743357534.0
  ],
  "history_sample": [
    {
      "id": "1jniaqo",
      "title": "First Race - Philly Love Run Half Marathon",
      "selftext": "Race Information  \nName: Philly LOVE Run Half Marathon  \nDate: March 30, 2025  \nDistance: 13.1 Miles  \nLocation: Philadelphia, PA  \nTime: 1:43:46  \n\nGoals  \n\nGoal Description\n\nCompleted?  \nA Sub 1:55 - Yes!  \nB Sub 1:50 - Yes!  \nC Sub 1:45 - Yes!   \n\nSplits - Mile\tTime  \n1\t8:08  \n2\t7:51  \n3\t8:10  \n4\t7:50  \n5\t7:59  \n6\t7:41  \n7\t7:43  \n8\t7:58  \n9\t7:39  \n10\t7:46  \n11\t7:58  \n12\t7:32  \n13\t7:34  \n14\t6:57  \n\nTime: 1:43:46   \n\nTraining   \nBeen training for about 10 weeks total. Up until training for this race I never really ran with any sort of commitment or goal. Never played sports growing up. I started running as a means to improve my cardio for Muay Thai. I was really struggling during heavy drills and sparring to keep my shit together.\nOnce I got into it something clicked and I was like \"I kind of like how this feels\" so I dove in and signed up for a race. My intention was to do the Broad Street Run as my first. I didn't get in to the lottery which was a bummer at first so I decided to sign up for the HM (which is about 5 weeks sooner than Broad Street).  \n\nI started around 10mpw my first week and jumped right to around 20mpw in my second. I added around 3-5mpw finally peaking at 56mpw at the end of my training block. It's worth noting that even though I haven't run much, I am active so I came in with a fitness base. I backed off mileage two weeks out to 46mpw and the did 20mpw for my final taper. I did  not follow a program but I've done enough reading to know the principles of running and my training consisted of the typical long, tempo, threshold, interval & easy runs.  \n\nInjuries   \nIt shouldn't be a surprise when I say that I definitely increased volume too fast and I've been nursing some injuries. For most of my training I've been dealing with Posterior Tibial Tendonitis in my left foot. I have been doing a combination of strengthening PT exercises, compression, KT tape, mobility and stretching work to manage it. It sucks but it's something I've been able to tolerate and I'm hoping it improves after I back milage off. Additionally I had a runners knee flare up but that only lasted a few weeks and it's not been bothering me. I'm a larger runner at around 6'0 195 so dropping some lbs should help w injuries. I carb loaded for about 4 days leading up to the race so was definitely heavy from that as well.   \n\nPre-Race    \nAlarm went off at 4:45. Ate my usual breakfast of oatmeal w/ protein powder & had some coffee to clear myself out. I also ate a gel to see how my body responded. I know you shouldn't do anything new on race day but I suck at listening. No problems to report. Got ready and then was out the door around 6:15. I live in South Philly so I decided to take the subway up to City Hall and walk to the start. My train was supposed to arrive at 6:29, but SEPTA decided to SEPTA (iykyk) and the train arrived 10 minutes late. I was contemplating a few options if it didn't show up and neither were great. Either pay for a $55 Uber or run 3 miles to the race. Thankfully everything worked out, train showed up at 6:39, and it was all good.  \n\nRace   \nNerves were feeling pretty good before the race. The most stressful part to me was just the volume of people and commuting there. It was around 13k, which I know is small compared to some, but it was my first race so it was a lot. My bib put me in a slower corral than I was supposed to so I snuck up from Green to Blue. I was trying to find the 1:45 pacer but no luck (found him way later in the race).  \n\nMiles 1-5  \nThe first 4.5 miles do a small route through Center City Philadelphia. Felt surreal running through the streets without traffic. There were crowds cheering through certain sections there, not too many onlookers though. Legs were feeling fresh and fast from the taper and I was being mindful of not starting too fast. First mile or so was lots of weaving and passing folks.   \n\nMiles 5-10  \nHere's where I started to feel settled in and could really start to push a little harder. Legs, heart and lungs still felt pretty great throughout this section. Miles 5-10 take you up along the Schuylkill River on Kelly & MLK drive. Around mile 7 or 8 my left ankle (PTT) really was starting to flare up. I pushed through as usual but it definitely was not pleasant. I hit my first aide station in this section and also ate a gel right beforehand around mile 8.  \n\nMiles 10-13.1  \nThis is where the race really started. Those who've done this HM know right around mile 10 there's a pretty steep and long hill. I was able to keep pace going uphill but my heart rate made it up to around 180. This was definitely challenging and it took a lot of runners down to a slow jog or walking. I was a bit worried because the bulk of my training has been on a treadmill so I haven't worked much with grade. What pushed me through was the fact that I have extremely strong legs from decades of strength training. Knowing this was a hilly course I tried my best to pick up my pace in the downhills and flats to bank some time. I was definitely feeling spent after the hill and had to start digging deep to maintain my pace. Somewhere around mile 11 or 12 I finally saw the 1:45 pacer. I felt such a relief to know I was on track for my stretch goal of 1:45. I passed him and kept pushing to the end. I gave everything I had in the last .1.  \n\nPost-Race  \nAfter catching my breath I grabbed my medal and hobbled over to the big food tent to get my bag of snacks. Hobbled two miles to my buddy's house and we went out for brunch. Really great experience overall.  \n\nLessons learned & what's next \nOverall I think I did a fantastic job training for this race. I'm really proud of myself for the effort I put into training & the race itself. I gave this everything I had and took it very seriously. In hindsight I would have pushedy milage up a bit slower & trained with an insole to help mitigate the PTT. I'm flat footed so I gotta be more careful. I also didn't need to peak at 56 miles, that was overkill. I am looking forward to dialing the milage back to 25-30mpw and doing a heavier focus on speed. I'm also looking forward to doing more running outside now that it's warming, and more trail runs. I have a few 10ks lined up which will be a nice change from HM training. I have the Philadelphia Marathon in the fall so I'll be back to the grind late summer. I will probably follow a real program for that one. No idea what time to shoot for yet as there's a lot of training to be had before then. Also, for anyone curious, my Garmin race predictor had me around 1:42:30 for this. So all things considered that was pretty damn close. Also my watch put my total distance at 13.3 miles and that's what my splits are based on. It was a super cloudy day so I think it struggled a bit w gps.  \n\nI'm sure I forgot some stuff. Happy to answer questions if anyone has any. Thanks for reading!",
      "author": null,
      "created_utc": 1743357534.0,
      "score": 24,
      "num_comments": 13,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "tiktok",
    "instagram"
  ]
}