{
  "id": "twin_Affectionate-Fee8136",
  "username": "Affectionate-Fee8136",
  "activity_count": 1,
  "interests": [
    "that",
    "just",
    "like",
    "training",
    "pick"
  ],
  "post_times": [
    1757529205.0
  ],
  "history_sample": [
    {
      "id": "1ndmeks",
      "title": "HR training models for couch potato with low RHR",
      "selftext": "I'm getting into running and I thought HR training might be a good way to start without overdoing it. There are so many HR equations/models out there that I'm getting a bit overwhelmed and since Google sucks these days, I figure my best bet would be to ask for input here.\n\nThe sticking point for me is that my resting heart rate (RHR) is kinda low (\\~48-55bpm) despite being a couch potato for years. Cardiologist said its prolly just high vagal tone and nothing to worry about impacting exercise. But since my RHR is so low, I feel like I need to pick an HR calculation that accounts for it because low RHR may violate the assumptions of the more simplistic HR training calculations.\n\nI'd like to ask for some suggestions on how to pick a training strategy from there. I'm the type of person that just needs to pick a prescription/schedule and once it's set, I'll run with it (heh heh). I just want something that isn't wildly off the general range i need to find myself in. Even just linking some resources would be helpful cause again, Google sucks these days. Or telling me that I'm over thinking this and that I should just shoot from the hip and pick one would also be helpful.\n\nSorry if this is a redundant question. I tried poking around your sub but didn't find anything addressing HR training for someone who is both a couch potato and has low RHR (although I def could have missed something). Any links to previous relevant posts also very much welcome.\n\nUpdate for anyone bothering to check:\n\nI decided to table HR for now like many here have suggested. Maybe a couple months from now I'll revisit the specific HR recommendations I've seen here. I've been sticking to a 30 min run 3x this week which is 10 min up from the 20 min runs i was doing in prior weeks. They haven't been that bad actually so next week I'll set 3x 40 min runs and then maybe after that I'll do the 2x 30min and 1 x 1hr depending on how i feel. I'm gonna have to plan around activities if they get any longer lol.\n\nEven though i wasn't going to try to run faster, i've been playing around with posture and step length and i found that if i tighten my core and take longer steps, i can go way faster without really expending any more energy (y'all probably already know that). Also, I really like finishing a run at a cruising pace so i've been running incrementally faster each minute to a full sprint in the final 6 min just cause i like the feeling of finishing a run out-of-breath. I feel like that scratches the speed itch I'm still feeling without overdoing it and still making sure i get enough time/distance in.",
      "author": "Affectionate-Fee8136",
      "created_utc": 1757529205.0,
      "score": 12,
      "num_comments": 19,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "tiktok",
    "instagram"
  ]
}