{
  "id": "twin_timrsland",
  "username": "timrsland",
  "activity_count": 1,
  "interests": [
    "race",
    "with",
    "marathon",
    "mile",
    "time"
  ],
  "post_times": [
    1743054791.0
  ],
  "history_sample": [
    {
      "id": "1jkx5ww",
      "title": "Race Report: LA Marathon",
      "selftext": "### Race Information\n\n* **Name:** Los Angeles Marathon\n\n* **Date:** March 16, 2025\n\n* **Distance:** 26.2 miles\n\n* **Location:** Los Angeles, CA\n\n* **Website:** https://www.mccourtfoundation.org/event/los-angeles-marathon/\n\n* **Time:** 3:45\n\n\n\n### Goals\n\n| Goal | Description | Completed? |\n\n|------|-------------|------------|\n\n| A | Beat 20-Year-Old Self (4:01) | *Yes* |\n\n| B | 3:45 | *Yes* |\n\n| C | 3:30  | *No* |\n\n| D | 3:20 (Garmin Watch Prediction) | *No* |\n\n| E | Don’t hit the wall | *No* |\n\n| F | Have fun 🤩  | *Yes* |\n\n\n\n### Splits\n\n| Mile | Time |\n\n|------|------|\n\n| 1 | 7:42\n\n| 2 | 6:55\n\n| 3 | 7:40\n\n| 4 | 7:43\n\n| 5 | 8:02\n\n| 6 | 8:05\n\n| 7 | 7:39\n\n| 8 | 7:41\n\n| 9 | 7:51\n\n| 10 | 7:41\n\n| 11 | 7:42\n\n| 12 | 7:43\n\n| 13 | 8:09\n\n| 14 | 8:14\n\n| 15 | 7:40\n\n| 16 | 8:06\n\n| 17 | 8:38\n\n| 18 | 8:15\n\n| 19 | 8:43\n\n| 20 | 9:09\n\n| 21 | 10:12\n\n| 22 | 10:50\n\n| 23 | 10:51\n\n| 24 | 9:51\n\n| 25 | 9:25\n\n| 26 | 10:38\n\n| 27 | 4:33\n\n\n\n### Background\n\nI’ve been a runner for most of my life—nothing too competitive but I go out 3-6 times a week for a jog (probably about 15-25 miles a week). I’ll run 5Ks and other fun runs a couple times a year. I coach XC at a middle school as well. In 2005, when I was 20, I ran the San Diego Rock’n’Roll Marathon. I didn’t really know what I was doing for training then, so my main goal was to finish. Last year, my wife and I decided to run a 5K race (or more) once a month to usher in our 40th year so we did 12+ races last year. Because of this race challenge, I started to get back into racing, and wanted to finish my 40th birthday with a marathon. I had been eying the LA Marathon because I thought it would be an energetic race and a good way to get to So Cal for a vacation. \n\n\n\n### Training\n\nI already had a decent base, so my main goal for training was to ramp up miles over time and increase my speed over those miles. I set up a plan from random internet research and my own knowledge.(I think next marathon I might look into a specific training regiment.) I also needed a lot of flexibility in my plan since I was balancing work, 2 small kids, winter weather, cold/flu season and a few trips planned during training. Weekends would be set for my main, big run for the week. I’d get speed workouts in with fartleks and tempo runs during my weekly runs after work. I tried out the Yasso 800 method to help get in a consistent speed/pace workout. (Basically, I converted my original marathon goal time of 3 hours 45 mins into 3 mins 45 seconds. I ran that time in intervals around an 800 meter course in a nearby park. The idea is to run each 800 at that pace building up to 10 laps towards the end of the training. It was a decent workout. The theory is that consistently running this workout will help you reach your goal time for the marathon. I guess it worked for me…) The biggest challenge during my training was dealing with a cold in January and trying to run a 19 miler the day I started to feel remotely better. I struggled all 19 miles and I should’ve rested up instead. But overall during training, I was doing better than expected with my pacing and speed. My Garmin predicted that I’d run a 3:20 so I think that inflated my ego. \n\n\n\n### Pre-race\n\nMy family and I got an AirBnB near Dodger Stadium in Echo Park. Cute neighborhood and super convenient for the race Expo and start. The day we arrived to LA it was cold and rainy but we managed to get to the Expo at the stadium and pick up my bib, etc. The next 2 days I carbo loaded with every meal. Some good spots included In n Out, La Pergoletta in Los Feliz, Bay City Deli in Santa Monica and Pitfire Pizza in Echo Park. \n\nThe morning of the race I woke up at 4 am, had toast with peanut butter and banana and had my coffee to get things rolling. I applied body glide and packed up my GUs, water bottle with  Tailwind electrolytes, and running belt, and headed to the stadium on a Lime scooter at 5 am. \n\nThe stadium traffic looked very busy so I was glad I took a scooter over and stayed near the start. I was starting in the open coral since I didn’t have a qualifying marathon time for the seeded corals. I made my way to the front of the corral around 6ish. The crowd wasn’t too bad but by the time the race started it was jammed packed. Lots of antsy but fun energy waiting for the race!\n\n\n\n### Race\n\nMile 1-5: At the start, the open coral was released about 7 or 8 mins after the 7 am start, after all the seeded corrals were racing. Instantly, I had to pee badly so I peeled off to some bushes in Dodger Stadium. Another runner joined me. 30 seconds later I was off again. Leaving the stadium area is a long sloping hill down Sunset Blvd. I knew I was going to take this faster than my average goal pace (7:45-8 mins) to bank some time as long as my heart rate stayed in zone 2 (140s). After hitting Chinatown at the bottom of the hill, the course flattens out for a mile or so but my heart rate jumped to the high 150s (approaching my LTHR) which I knew was going to be a problem for my 40-year-old self. I think it spiked from the adrenaline because I tried to slow down my pace as I ran through DTLA to get my HR under control but I think I was just too excited. It stayed in the high 150s, spiking into the 160s for most of the race. The hill at mile 4 (Disney Concert Hall) was not as bad as I had read about online. The hill after, near mile 5, was tougher. \n\nMile 6-15: Coming into Echo Park and getting onto Sunset Blvd, the crowds start building up and I really enjoyed the rolling hills with views of the Hollywood sign. Also I ran by my cheer squad (my wife, kids and parents). The people brunching at the cafes on the sideline watching the race were a pleasant surprise (great way to spend a Sunday morning). I found my pace at 7:41 as I ran through Hollywood, but as I tried to speed up coming to the halfway mark, there’s a slight grade approaching the Chateau Marmont and the Sunset Strip. That’s when I felt like I was starting to lose some momentum and my HR was staying in the low 160s. The Sunset Strip is a rolling downhill area so I was betting on it helping mellow out my HR and getting back on track with my pace, especially with the big downhill at San Vicente Blvd. At this point I saw my family a 2nd time (They said they barely made it from the last watch spot because the traffic and parking was so crazy.)\n\nMile 16-18: Coming into Beverly Hills, I started to fade again. I really felt the false flat on Burton Way. On Rodeo Drive, the 3:30 pace group from the open coral caught up with me. I tried to stick with them but it just felt like we were bumping elbows, and I slowly fell behind by the time I turned onto Santa Monica Blvd. \n\nMile 19-22: The crowds were great coming into Century City—definitely the most energized and biggest crowds of the race. I think I even saw the winner of the LA Marathon finishing up his race on the opposite side of Santa Monica at mile 26 as I passed mile 19. Running past the finish line and knowing I still had 8ish miles left, especially as I was bonking, was tough psychologically and the rolling hills on Santa Monica and the hill on Sepulvida really did me in. My pace slowed way down! At least my HR did too! It was tough to slow down and have people that I’d passed earlier pass me. Also the area on Wilshire Blvd, around the 405 underpass, is a bleak, sparse area compared to the rest of the race. At the corner of Wilshire and San Vicente, I was tempted to take a beer shot from the group passing them out for St. Patty’s Day—maybe it would’ve helped numb the pain—but I pressed forward. When I finally made it to the turn around at Bundy Drive, I had a sigh of relief. \n\nMile 23-End: I was able to use the downhill at Sepulvida to help me “speed up” during the final 5K, but it felt like the slowest 5K of my life. I kept telling myself that I was not going to walk, as I passed many runners walking by this point. My family saw me one last time at mile 25. My wife could tell from my face that I was in pain. The rolling hills on this part on Santa Monica really hurt, but I tried to push my pace up oh so much. Despite the energy of the crowds and knowing I was almost done, that final hill into the finish line was brutal. Nevertheless, I finished the marathon with a smile, got my metal and collected every snack, water and “re-energizer” I was handed. \n\n\n### Post-race\n\nThe finish line area is pretty long but it gave me time to take  a seat,  have a snack and milk carton. Apparently my phone had butt dialed a few people and eventually locked so that I couldn’t unlock it for 1 hour 45 mins after I finished the race. I asked someone if I could text my wife to meet me at the beer garden in the mall atrium (most convenient and least crowded spot for a meet up in Century City). Getting the gear from gear check and squeezing my way through the crowded exit, where everyone had decided to meet their runner, took a long while. I was side tracked by the massage tables—so worth it—before I eventually found my wife at the beer garden.\n\nPost race, I was sore but not horrible after walking off the post race legs, and I wasn’t all that hungry until later in the evening. The traffic was pretty bad getting out of Century City, even though my family parked in the neighborhoods west of Beverly Glen.\n\nI’m already eyeing my next marathon. Originally thought I wouldn’t do one until 2026, but I might sign up for one in October…",
      "author": "timrsland",
      "created_utc": 1743054791.0,
      "score": 66,
      "num_comments": 5,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "tiktok",
    "instagram"
  ]
}