{
  "id": "twin_Randomcluelessperson",
  "username": "Randomcluelessperson",
  "activity_count": 1,
  "interests": [
    "race",
    "entering",
    "races",
    "trans",
    "this"
  ],
  "post_times": [
    1749767682.0
  ],
  "history_sample": [
    {
      "id": "1la00lu",
      "title": "Entering races as a trans woman",
      "selftext": "I’m hoping for a mature, positive discussion on this, although I know it will be controversial for some. I looked through old threads about the topic, but most discussions were based on outdated rules/policies as well as a completely different political environment.\n\nAge: 50-55\nGender: F (born male)\nPace, etc.: see below\n\nI’m transgender (male to female), and although I’ve been running for almost 4 decades I’ve only recently run in my first 5k. It was a Pride race, so being trans was a non factor.\n\nBut now I want to enter more races, and I don’t want to stir the pot or cause any controversy. Most runners I know are very inclusive and welcoming, but I know there are exceptions. Entering a race as a “man” when I’m absolutely not would be traumatic enough that I would likely not run at all. So, do I enter as my correct gender and hope it doesn’t become a big deal? Do I contact the race organizers each time? (a very uncomfortable conversation when I just want to run) Some considerations:\n\n-I do not “pass” very well at this point. If someone looks at me closely they can generally tell I’m trans.\n\n-I have been transitioning for 2.5 years. My hormones have been in the correct range for a significant time, and my testosterone levels are actually lower than cisgender women.\n\n-I am not an elite runner by any stretch. My 10k PR is ~58 minutes and my 5k just under 27. The one half marathon I ran (by myself, not in a race) was over 3 hours.\n\n-I won’t be entering any races where I might win any monetary or other tangible awards, so I wouldn’t be “taking” anything from cisgender runners.\n\nI’m open to hearing conflicting opinions, but hopefully this can be civil.",
      "author": "Randomcluelessperson",
      "created_utc": 1749767682.0,
      "score": 354,
      "num_comments": 582,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "twitter",
    "reddit"
  ]
}