{
  "id": "twin_soart_",
  "username": "soart_",
  "activity_count": 1,
  "interests": [
    "running",
    "mins",
    "when",
    "just",
    "week"
  ],
  "post_times": [
    1754086993.0
  ],
  "history_sample": [
    {
      "id": "1mfa4ab",
      "title": "How did/do you combat days you felt/feel heavy, mentally done mid-run or cant be asked to go on a run? Especially when you just started out!",
      "selftext": "Hi! So kinda long:\n\nI began running last year using couch to 5k and got to running 30 mins consecutive (I was a whole 10kg heavier when I started). Took a 7 month break from November for health reasons and returned and trained up again around June. Got to running 30 mins by the 5th week, skipping bits of couch to 5k and l've been doing that three times a week for two weeks now (6 weeks now into this).\n\nOnly problem; these last three runs have been crazy difficult - mentally and also my legs feel heavy? Like I know I can run 30 mins but I keep telling myself I'll stop in 5 mins to get through it, and my legs are like dead weights. My speed's dropped a bit and my heart rate readings seem like they've gone up a bit (I segment every 5 mins on the workout Apple Watch so I can look back on it). I'm kind of confused because before 15 minutes would pass by quickly and I could keep a faster pace throughout with a sprinter finish.\n\nToday's Friday so l've done my third run of the week, I have two days before my next run, my week usually looks like this: \nrun + strength, \nPilates, \nrun, \nstrength, \nrun, \nSteps and some light core \nrest\n\nand outside of running I get 10k steps in every day even on my rest days. I don't do heavy lifting just body weight and a little extra.\n\nI do my workouts at home and it's nothing crazy - usually push ups, weighted table rows, wall sits, leg raises and glute bridges, dead bugs, Russian twists etc. Depending on the day.\n\nI'm a bit perplexed. Not sure if it's just me still adjusting to 30 min intervals considering so far it's been progressive overloads? I wanted to increase the run length to get to the stage where I can run marathons but I don't know if now's the time for that when I'm ready to just stop after 15-20 minutes.\n\nBefore this happened, I was genuinely enjoying running, l'd be smiling through it (until the last stretch where l'm tired but still able to get a sprint finish in and go really fast - for me) and it felt freeing. I did think it was maybe down to my cycle, but then it also doesn't make sense because when I was meant to feel lighter I felt dead.",
      "author": "soart_",
      "created_utc": 1754086993.0,
      "score": 57,
      "num_comments": 64,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "twitter",
    "reddit"
  ]
}