{
  "id": "twin_runawayMS",
  "username": "runawayMS",
  "activity_count": 1,
  "interests": [
    "pretty",
    "that",
    "with",
    "this",
    "boston"
  ],
  "post_times": [
    1745462067.0
  ],
  "history_sample": [
    {
      "id": "1k6hgnt",
      "title": "Fighting MS pt. 3: a sub-3 dream in Boston",
      "selftext": "## Race Information\n\n* **Name:** Boston Marathon\n* **Date:** April 23, 2025\n* **Distance:** 26.2 miles\n* **Age**: 36M\n* **Time:** 2:59:20\n\n## Goals\n\n|Goal|Description|Completed?|\n|:-|:-|:-|\n|A|2:59:59|*Yes*|\n|B|3:08:09|*Yes*|\n|C|Have fun|*No?*|\n\n## Splits\n\n|13.1 splits|Time|\n|:-|:-|\n|1|1:27:58|\n|2|1:31:22|\n\n\nMile splits: 6:45, 6:33, 6:33, 6:33, 6:50, 6:39, 6:38, 6:42, 6:47, 6:44, 6:42, 6:52, 6:42, 6:53, 6:56, 6:47, 6:53, 7:02, 6:51, 7:17, 7:04, 7:08, 7:00, 6:24 (0.2)\n\n\n## History\n\nThis is my third installment (and marathon) of endurance running after being diagnoses with Multiple Sclerosis. In 2017 I was diagnosed with MS - almost 8 years ago to the day of the Boston Marathon, when I woke up one morning unable to feel temperature in my right leg and significant weakness throughout my left side. As part of facing my new reality, I new I needed to focus on fitness getting healthier, two things proven to help slow the progression of the disease. It was a slow process of ramping up mileage and starting to adapt to running again, and about two years ago I ran my first Half Marathon as a training run, aiming to be near 1:45. I remember at that time thinking how incredibly difficult that run was, and wondering if I could ever run a marathon. Nevertheless, I started training and eventually ran my first marathon last May, the Vermont City Marathon in a time of 3:26. I had a great time, and was fortunate to get a charity bib for the Berlin Marathon in September, completing that in a time of 3:08. Earlier in the year, I had decided that I wanted to try and run Boston, knowing I was pretty far away from a BQ but recognizing that I was in decent shape and with an uncertain future - I signed up as an Adaptive Athlete as part of the Para Athlete program. This involved submitting documentation of my MS diagnosis and some info on my \"qualifier\", a different criterium than the standard BQ process. I figured that I should try and run Boston now, while I still can run, as I could have another MS flare at any time and lose the ability to run.\n\n## Training\n\nAfter Berlin I was feeling in pretty good shape, despite a bout of Post-tibial Tendonitis that sidelined me for about 3 weeks (I hobbled across the finish line and could barely walk for the next 4-5 days). As I eased back into running, I raced my first ever HM on a hilly course with a time of 1:29:22. This was my first sub-90 HM, which I was pretty pleased with despite coming off of injury. I continued to base build, running about 40-50mpw for the rest of 2024, thinking that maybe...just maybe...I could shoot for sub-3 at Boston. Going into 2025, I decided to try and do Pfitz 18/70; I really enjoy the discipline required for the Pfitz plan, previous doing the 12/55 then 18/55 plans for my first two marathons. I found that the increased mileage was a lot to deal with and in hindsight I wasn't quite ready for it. I hit a few weeks of 65+ miles before developing some tendonitis issues in my right hamstring and right ankle that massively sidetracked my training for the rest of the block.\n\nAround the time of my injury I also came down with the flu, when I recovered I stupidly did a big week and blew up. My ankle was shot. I tried to take a few weeks easy, decreasing my mileage, while starting PT. I found that if I dropped the speedwork I was able to ease into my runs and at least keep some of the volume up. For me, this was a big frustration because I really need to push speedwork and strength training to keep my MS symptoms at bay. I am very prone to neuromuscular fatigue, and if I don't keep at the speedwork then I have a lot of neurological issues with my left leg in particular. Still, I was able to run a bit, and that was enough to keep some of the training in motion. Over the course of the block my weekly mileage was 47, 56, 56, 60, 64, 63, 50 (flu), 40, 67, 44, 14 (injury), 55, 54, 52, 58, 46, 40, 26, 18. By this point I had mostly given up on Pfitz, even the 18/55 plan, and was just loosely following it and running on vibes.\n\nAbout 1-1.5 months out from Boston I had to make a decision: drop my goal of a PR and maybe sub-3, or try to push through the injury and see if my increased strength and fitness + PT will give me enough of an edge to recover into the taper. I chose to run through the injury. Four weeks out, I ran my longest run of the block, 23 miles at around a 7:10 pace and started to introduce some light speed work. It felt pretty good and I found once I warmed up I could run through the ankle pain without it getting much worse. Three weeks out, I ran a 21 mile long run with about 12 at MP through the Newton Hills. This felt pretty good, albeit a very tough workout. Two weeks out I raced a 15K tune-up racing, netting a new 10K PR of 38:25 and an overall time of 58:35. I was feeling pretty good, I was maybe on track for sub-3 pace, even though my weekly mileage was a bit low. I started a pretty hard taper, hoping my injuries would resolve by race day.\n\n\n## Pre-Race\n\nI live in the Boston area, so things were pretty easy for me. I respond very well to high carb fueling, and started loading on Friday with 600g of carbs. Saturday I took in 700g of carbs, and as a shakeout I ran the BAA 5K with some friends. It was a great atmosphere and I kept it pretty easy, 2 miles at MP. Sunday I didn't run at all, and consumed about 600g of carbs. I went to bed around 9:30pm and woke up at 3:30am, unable to sleep any longer. I ate a banana and a bagel and drove into Boston at 6am to catch the bus over to Hopkinton. \n\n## Race\n\nBecause of my \"Adaptive Athlete\" status, I was automatically put into Wave 1 Corral 8. This ended up working out pretty well for me, as I was aiming for around a 3hr marathon, which was right on pace for this group. The weather was good, not great - I'd say maybe a 7/10. The sun was intense and I burned pretty bad during the race. The energy was electric but I was feeling pretty calm and eager to get underway. I remember reading two comments on Reddit a few days earlier \"Please please please save something for the Newton Hills\" and \"Aim for high cadence after Heartbreak so you don't wreck your quads going towards Cleveland Circle\". I did my best to keep this in mind, but still went out a bit too fast at around a 6:35-6:40 pace. The first 6-8 miles dragged by, I actually didn't find them particularly easy; I don't know if I wasn't feeling it or not but I was feeling a bit sluggish and labored from the start.\n\nI kept pace and was enjoying the crowd energy as we came up to the half - 1:28 on my watch. A bit fast, but not too bad. I was a little nervous for what was to come and slowed up just a little. The next 3-4 miles starting feeling pretty rough...I think the heat was getting to me. I saw my family at 16, right after the big downhill going into Newton, right as my left quad was starting to really hurt. We began the hills, and it was actually a bit of a relief, as using some new muscles felt great after so much downhill to that point. I was tired, but knew I just had to get through Newton. I've run the hills maybe 2-3 times in training and was actually most worried about the 1st and 3rd hill. I wasn't wrong; these were very tough and I was starting to hurt pretty bad.\n\nAfter Heartbreak, the wheels came off. I've never cramped up before, so this was a new experience for me. I started to feel a slight shock/twinge in my calf and then it would completely lock up for a split second. I was just hoping every single step that I could straddle the line without it locking up completely. My fueling was great, and I started taking in more gatorade, hoping the extra carbs and electrolytes might help. Every step was a cramp and agony in my left quad as I pushed to the finish.\n\nThe rest of the race is pretty much a blur. I recall seeing the Citgo sign, thinking it was so, so far away, wondering if I should stop and stretch, questioning how much I really cared about going sub-3 anyway. At one point I looked at my watch and it was predicting a 3:01 and I almost stopped then and there. I pushed forward and didn't even notice the little dip under the overpass, trying to pick up the pace. Right on Hereford, left on Boylston. My watch told me I was now going to be around 2:59:30. Everyone says running on Boylston is a transcendent experience and frankly, it was terrible. All I could do was push forward as hard as I could. Stretch for the finish...2:59:25 on my watch. BQ.\n\nI am extremely satisfied for going sub-3, something I thought would never even be possible a few years ago. I'm really proud of the accomplishment and the journey to get here. Some things went really well, my nutrition was on point (275g carbs total taken in during the race), which is why I think I didn't bonk completely. My pacing and strategy could have been better but my splits weren't too bad all things considered. Did I enjoy the experience? I think so, but I'm still processing it all. I'll certainly come back to Boston, maybe next year, but I'm not sure yet. I think if I do I won't grind for a big PR and instead try and soak up this iconic race more than I could on Monday. I'm not entirely sure what is next. I'm signed up for the NYC Marathon, but I may defer until next year, and I have some shorter distance things over the summer. \n\n\nMade with a new [race report generator](http://sfdavis.com/racereports/) created by /u/herumph.",
      "author": "runawayMS",
      "created_utc": 1745462067.0,
      "score": 67,
      "num_comments": 7,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "twitter",
    "reddit"
  ]
}