{
  "id": "twin_rogeryonge44",
  "username": "rogeryonge44",
  "activity_count": 1,
  "interests": [
    "race",
    "with",
    "that",
    "through",
    "time"
  ],
  "post_times": [
    1750611495.0
  ],
  "history_sample": [
    {
      "id": "1lhspuz",
      "title": "Race Report: Manitoba Marathon - rambling my way through Winnipeg",
      "selftext": "### Race Information\n* **Name:** Manitoba Marathon\n* **Date:** June 15th 2025\n* **Distance:** 26.2 miles\n* **Location:** Winnipeg Manitoba\n* **Website:** https://manitobamarathon.mb.ca/\n* **Time:** 2:44:25\n\n### Goals\n| Goal | Description | Completed? |\n|------|-------------|------------|\n| A | Don't get hurt | *Yes* |\n| B | Sub 2:45 | *Yes* |\n\n### Splits\n| Kilometer | Time |\n|------|------|\n| 1 | 3:49\n| 2 | 3:49\n| 3 | 3:51\n| 4 | 3:49\n| 5 | 3:53\n| 6 | 3:49\n| 7 | 3:50\n| 8 | 3:50\n| 9 | 3:52\n| 10 | 3:51\n| 11 | 3:51\n| 12 | 3:50\n| 13 | 3:52\n| 14 | 3:52\n| 15 | 3:55\n| 16 | 3:50\n| 17 | 3:51\n| 18 | 3:50\n| 19 | 3:51\n| 20 | 3:52\n| 21 | 3:49\n| 22 | 3:52\n| 23 | 3:51\n| 24 | 3:53\n| 25 | 3:50\n| 26 | 3:51\n| 27 | 3:52\n| 28 | 3:49\n| 29 | 3:53\n| 30 | 3:50\n| 31 | 3:52\n| 32 | 3:46\n| 33 | 3:53\n| 34 | 3:52\n| 35 | 3:54\n| 36 | 3:50\n| 37 | 3:56\n| 38 | 3:56\n| 39 | 3:55\n| 40 | 3:57\n| 41 | 3:58\n| 42 | 3:55\n\n### Preamble\nThe Manitoba Marathon? That seemed perfect. I was scrolling through a list of races 7-9 weeks in the future, trying to lift my sprits after cancelling everything for Boston 2025. \n\nIn 2022 the Manitoba Marathon was my first attempt at the distance. I went into it with big goals – sub 3 and BQ – my pair of trusty Nike Pegasus and no idea what I was doing. As it turns out my lack of preparation somehow wasn’t what doomed me, as the race was stopped after about 90 minutes due to extreme heat. I would go on to finish the course, but the timing equipment had been turned off and I received no official time and was listed as a DNF. That felt harsh.\n \nThree years later with maybe slightly more of a clue about running and even bigger goals it seemed like good symmetry. Or at least a good story. \n\n### Training\nI registered 9 weeks before the race. Boston was scuttled because a significant issue with my IT band and quad. Disappointing as it was to miss that race, I wasn’t willing to the risk of not addressing it early and, with the injury hitting right at the start of my taper, I thought I had the opportunity to salvage my fitness. Recovery, with support from a physio, left me 6 weeks to execute a mini build and taper for Winnipeg.\n\nMy plan was focused on sharpening my existing fitness and staying healthy enough to give a good effort on race day. I wanted to hit some key workouts to gauge my progress along the way both in terms of fitness and how my body was holding up: \nWeek 1: 20 miler with 15mi easy and 5 at MP\nWeek 2: Half-Marathon race a little faster than MP\nWeek 3: 20 mile LR workout feature 6x1mi repeats at threshold\nWeek 4: Half-Marathon race at HMP\n\nThe two half-marathon races were already on my calendar, so I’m not sure if they were ideal but they were fun races that I didn’t want to miss out on. I had physio session at the end of each week to make sure I was still on track and otherwise just ran based on how I felt. After the end of week 4 I went into my taper, with only a little more tempo work before the race. My last proper workout was 10 days out.\n\n### Pre-Race\nI flew out to Winnipeg on the Friday, two days before the race, with my Wife and Mother In-law who came out to visit some family and visit around Winnipeg for the weekend. In the past I’ve maybe been guilty of overdoing it in the days before a race, so I mostly spent the warm afternoons inside and off my feet. Friday and Saturday I ran an easy 5kms with a few strides on Saturday and got a few walks in, but otherwise rested. \n\nSunday – race day – I woke up shortly after 4am to for some coffee and breakfast. I’m apparently slow to digest so even with just a piece of toast, jam and banana the early start was normal and necessary. I sipped on some Maurten caf 320 on the drive down to the start. \n\nI arrived with about 1:20 minutes before the start. To help manage my ITBS I had a lengthy warmup and stretching routine to go through. Somehow that took even longer than expected, and by the time I had my race shoes tied up and gels tucked away I could hear ‘O Canada’ being performed at the starting line. \n\nNormally I’m pathologically early to the point of comedy, so feeling late was uncomfortable. I jogged up to the start corral with few minutes to spare to realize that I had no idea how to get in. In the distance I could vaguely see a point where people were entering but it was far back and I’m not one to try and push my back up to my assigned corral. A runner in front of me was in the same predicament and recruited some help to hop the barrier. I grit my teeth and followed him over – without help – clambering over the short steel fence without much dignity and landing way to hard on my Endorphin Elite 2s, “bottoming out” the soft foam. Shoes not necessarily made for jumping – noted. \n\n### Race\nThe race went off and after reassuring myself that I hadn’t wrecked my shoes I was eager to settle into an early rhythm, aiming for even splits on the flat course. About 150 meters in I heard something clatter to the ground nearby, turned and realized one of my Caf 100s had fallen from my pocket. Not ideal for my nutrition plan but also painfully expensive, especially since the Caf 100s aren’t available in Canada. I buried my second one further in the pocket, an action I’d forget 25km later when I reached for it, couldn’t find it, and assumed I lost that one too. \n\nEarly on I tucked in with a pack of five including a local runner - the greetings and cheers he exchanged with spectators gave me away - a youngster clearly running well slower than his fitness, two running much faster than their fitness, and myself. \nSomewhere around the 5km mark we were set to make a turn onto one of the large boulevards with a traffic lane coned off for runners. Only this lane hadn’t be closed yet. A police officer directed us onto the sidewalk, calling unhelpfully from behind, “don’t worry, they are closing it now.”  \n\nI could only laugh at the symmetry between this and the 2022 race when we had also initially been directed onto the sidewalk after the race was cancelled. After about 1km we rejoined a now closed road.\n\nA large deer crossed our path as we entered Assiniboine Park, and we briefly became a pack of 7 when we picked up a runner who’d fallen off the lead pack and a spectator started running beside us while clapping and (hopefully) cheering in a language I didn’t understand.\n\nOn the other end of the park, I dropped back a little when the young fast runner sped up and the others attempted to follow. The runner who had dropped from the lead pack fell back next, followed by another who had be labouring for some time. We passed 25km and I started to feel tightness in my right quad. That was supposed to be my good side, but it didn’t seem too serious yet. I was sure I could make it to 32km and then I’d see what I had left. \n\nThe young fast runner was long gone and so was the pack of five. The local was still about 20 meters ahead but the others were out of site behind before 30km. At 32km the local fell back to me. I checked my time and decided, since quad hadn’t gotten any worse, to make a short push. During my last marathon (Marine Corps 2025) I’d gone through 32km feeling very strong but faded badly over the last 5. I was resolved to hold my pace as best I could this time. \n\nI can’t remember exactly when it started but a patchwork of runners from other distances began populating the course. A 5k, 10k and Half-Marathon were being run at the same time, and now that I was nearing the finish I’d be running through the slower parts of those races. In the cancelled 2022 race the only other runners I remember over the last few kilometers were faster marathoners who’d burned themselves out in the heat and were now walking in. This time around I weaved, dipped and ducked through the thicker crowds and narrowing course. I became more frustrated in my desperation to maintain what momentum I could and worried about also running an 8-year-old down from behind. At 40km I ran into a woman who abruptly stepped in front of me to give a spectator a high-five.\n\nThe race finishes at the University/CFL stadium. Having picked my way through the crowd I made a right hand turn into the finishing chute that led into the stadium and onto the field. Instinctively I followed the runners ahead onto the left-hand side of the coned-off chute, wondering the whole time who thought it was a good idea to make me run through this mass of humanity.\n\n I stepped across the line, veered towards a volunteer who handed me a medal, doubled over and stopped my watch. The clock when I finished read 2:39 and change, but that I was for the half-marathon. Did it start 5 minutes later? I checked my watch. 2:44:45. Under the goal.\n\n### Post-race\nAll my previous marathons have had distinct moments that live clear as day in my memory. At L.A it’s watching the mass of runners charge down the street from the top of Vin Scully Ave, at Erie 2 it’s the Banana Man who I had to pull back onto the timing mat, and  at Boston 2024 it’s dying on the crest of heartbreak and the kind woman who told me not to give up when she saw me about to stop and walk. What I hope to remember from this race is the image of my wife cutting through the crowd to get to me.\n\n “You did it!”, she said, her eyes shining with sympathetic joy. \n\nI asked if she knew my chip tip. 2:44:25. \n\n“That’s under your goal,” she reminded me, “and I bet you would have been faster if you’d gone down the marathon finish on the right-hand side, dummy.” \n\nA fitting mistake and another opportunity to be grateful. This was a good day.\n\nMade with a new [race report generator](http://sfdavis.com/racereports/) created by /u/herumph.\n",
      "author": "rogeryonge44",
      "created_utc": 1750611495.0,
      "score": 36,
      "num_comments": 8,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "youtube"
  ]
}