{
  "id": "twin_rodrigors",
  "username": "rodrigors",
  "activity_count": 1,
  "interests": [
    "felt",
    "that",
    "time",
    "this",
    "marathon"
  ],
  "post_times": [
    1746525929.0
  ],
  "history_sample": [
    {
      "id": "1kg0rl7",
      "title": "Prague Marathon 2025 - F*** you Garmin",
      "selftext": "# Race Information\n\n* **Name:** Prague Marathon\n* **Date:** May 5, 2025\n* **Distance:** 42.2 Km\n* **Location:** Prague, Czech Republic\n* **Website:** [https://www.runczech.com/en/events/orlen-prague-marathon-2025](https://www.runczech.com/en/events/orlen-prague-marathon-2025)\n* **Strava:** [https://www.strava.com/activities/14377780696](https://www.strava.com/activities/14377780696)\n* **Time:** 3:21:09\n\n# Goals\n\n|Goal|Description|Completed?|\n|:-|:-|:-|\n|A|3.23|*Yes*|\n|B|3.30|*Yes*|\n|C|PR (less than 3.48)|*Yes*|\n\n# Splits\n\n|Km|Time|Pace|\n|:-|:-|:-|\n|5|00:24:38|4:55 min/km|\n|10|00:47:30|4:45 min/km|\n|15|01:10:09|4:41 min/km|\n|20|01:38:48|4:41 min/km|\n|25|01:58:30|4:44 min/km|\n|30|02:21:23|4:43 min/km|\n|35|02:45:39|4:44 min/km|\n|42.2|03:21:09|4:46 min/km|\n\n# Training\n\nThird time doing the distance. During [the first time](https://www.reddit.com/r/running/comments/1cqu75f/leidens_marathon_kicked_my_butt/) I was mostly questioning myself if would be able to do it. For [the second time](https://www.reddit.com/r/running/comments/1g8mss6/amsterdam_marathon_2024_very_crowded/) I felt bit more confident, but still kind of wondered if the previous one wasn't a fluke. For this one I was going all in. I did Pfitz 18/55 again, but added some changes based on my previous experience:\n\n1. Increased all the runs shorter than 10k to 10k. The short and easy runs were not going to cut it for me, so I set the bar at 10k.\n2. Added 10 strides on every easy run. That meant adding between 3k to 5k per week. This proved hard at the beginning. I didn't know how to run strides and each bout of speed felt unnatural and exhausting. Amazingly, by half of the plan it became natural, I was actually able to work on form and running fast didn't feel super hard anymore.\n3. Every long run became a progression run with at least 5k of marathon pace. This one came as direct feedback from my second marathon. There I really felt I was lacking practice sustaining marathon pace. I had had marathon pace runs in that training block, but still the race felt all the time like I was struggling. So after reading about it and kind of following the advice by Stephen Scullion (in some video I can't recall he talks about the importance of having marathon pace stints in your long runs) I decided to give it a go and man it paid.\n\nI managed to follow the plan to the letter, only having to juggle runs a couple of times to fit work schedule. Besides that I stayed consistent and managed to run all the runs, no skips.\n\nAfter all that I felt ready. VDOT calculator suggested I should be able to run a 3.13 based on a 10k race where I managed to do 42 mins, Garmin suggested 3.18 and Runalyze 3.23. All these projections felt scarily out of reach. I did my training cycle aiming at 3.30, that was already 18mins faster than my previous marathon, so aiming for 3.13 felt like fairy tales. However somehow during the taper my head started to believe I might be able to do it. I felt great during my longest runs (34km), I was able to sustain efforts 10s faster than marathon pace for 15k at the end of those long ones. I was even feeling good after those runs, not trashed.\n\nFor this time I decided to treat myself to a pair of race shoes. In the past I didn't feel \"fast enough\" to think that super shoes would matter. Now I was a bit more confident and at the same time eager to go all in. So I said to myself I would put it all on the table, if that means having racing shoes too, so be it. I got myself the Adios Pro 3. I read many comments and people seemed to agree they were forgiving with \"no so fast\" paces. I gave them 5 runs before the race: 26k, 20k, 10k (dress rehearsal run) and 6k (shake out run). I felt I was fucking flying in them.\n\n# Pre-race\n\nThis time I did carbo load. The previous times I knowingly ignored it because I read somewhere it wasn't that effective so I figured I would try next time. This time I increased the carbs consumption for 3 days before the race. They usually recommend 2, but I wouldn't be able to do it in that time, so I went slower and longer.\n\n# Race (here's the f**** Garmin part)\n\nI was ready. The weather was nice, fresh but not cold, sunny but not scorching. I went to my start wave, got set and got my watch ready to start tracking, it blinked \"GPS acquired\". Some waiting then people started walking, then softly jogging, the start was on sight, I was about to start running, I pressed the start button and...no vibration. I looked at my watch and I panicked a bit. The blue triangle of dead was on screen. WTF Garmin, how can you do this right at this moment. I stopped 100m from the start, pressed some buttons in desperation trying to do something, but I knew it was pointless. I felt confused for a second, I felt like a \"strava runner\" whining in my head because my watch won't track my run. Then I told myself there was no point in complaining and the hard work was done already. So I just started running, trying to brainstorm at the same time ways to keep myself more or less on track with time. I decided to go mostly by feel, I knew it was not going to be optimal, but when you get lemons you need to learn to make lemonade. I had to focus on remembering how I felt on my hard runs, oddly enough my core was my main gauge. I knew that when I pushed at marathon pace I could feel my core working, not dying, but also not relaxed. Around 2km I asked somebody their pace, 5.15, too slow, keep pushing. Then I remembered the pacers, I needed to find the 3.30 pacers. I pushed pushed pushed. No pacers in sight. Since I stopped a bit before starting the pacers had overtaken me long ago. At this point I was trying to have some indication of my pace by using my phone's stopwatch and the race's KM markers. I would lap while crossing a KM marker and look at the elapsed time since the last one. I kept pushing and found the 3.45 pacers. There was still work to do but I was getting afraid I might burn out because I was going too fast trying to catch them. I kept pushing as I felt ok, then somewhere between 10km and 15km I managed to reach the 3.30 pacers. I tagged along with them for about 1 or 2 kms, but it felt very slow. My core was telling me I wasn't pushing as hard as I was expecting to feel and I was feeling very good, so I started pushing a bit more and left them behind. I kept telling myself that if I started to feel bad I can always slowdown a bit a latch onto them. I kept running, checking my pace with my phone every 2 or 3 kms, I tried doing it per km, but sometimes I forgot, others I got carried away eating a gel or trying to get water from the water station. So in the end feeling was my main driver. The last 10k were HARD. In my previous marathons the last 10 were hard too, but this time it felt much harder, I think mostly because of all the nonsense at the beginning trying to catch the pacers and not having a reliable way to pace myself. I had to focus on music to silence the pain, on the crowds and kept telling myself that I was enjoying this. At some point I remembered an Eliud Kipchoge's interview where he said something along the lines that he smiled when the race became hard to withstand the pain. I tried smiling on what I can only imagine looked like a mad man's smile. Between all those things I managed to push through and reached the finish line. Relief rushed, I knew I did a good job as soon as I saw the finish line showing less than 3.30. Got my medal, a bottle of water and a couple tears escaped my eyes.\n\n# Post-race\n\nI'm sore, with a bit of chafing below my armpits because I forgot to apply body glide there, but very happy and after all kind of grateful of the odd experience I got to live. I don't think I would have chosen to run without my watch, but in hindsight I think I enjoyed the run quite a lot more than I would have if I were stressing looking at the little screen.\n\nMade with a new [race report generator](http://sfdavis.com/racereports/) created by u/herumph. ",
      "author": "rodrigors",
      "created_utc": 1746525929.0,
      "score": 224,
      "num_comments": 31,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "tiktok",
    "instagram"
  ]
}