{
  "id": "twin_Singitsayit",
  "username": "Singitsayit",
  "activity_count": 1,
  "interests": [
    "with",
    "race",
    "training",
    "miles",
    "pace"
  ],
  "post_times": [
    1746576899.0
  ],
  "history_sample": [
    {
      "id": "1kgjz7w",
      "title": "BMO Vancouver: BQ on first road marathon!",
      "selftext": "# BMO Vancouver Marathon\n\n# Race Information\n\n* **Name:** BMO Vancouver Marathon\n* **Date:** Sunday, May 4, 2025\n* **Distance:** 26.2 (26.5 per my Garmin watch?)\n* **Location:** Vancouver, BC\n* **Website:**  [https://bmovanmarathon.ca](https://bmovanmarathon.ca)\n* **Time:** 3:15:04\n* **Elevation:** 820 feet (960 per my Strava?)\n* **Gear:** Adizero Adios Pro 3\n\n# Goals\n\n|Goal|Description|Completed?|\n|:-|:-|:-|\n|1|Sub 3:25|yes|\n|2|BQ|yes|\n\n# Splits\n\n|Split|Time|\n|:-|:-|\n|1|07:42|\n|2|07:35|\n|3|07:39|\n|4|07:26|\n|5|07:32|\n|6|08:08|\n|7|07:45|\n|8|07:31|\n|9|07:25|\n|10|07:28|\n|11|07:23|\n|12|07:10|\n|13|06:59|\n|14|07:16|\n|15|07:30|\n|16|07:23|\n|17|07:26|\n|18|07:22|\n|19|07:21|\n|20|07:19|\n|21|06:59|\n|22|07:07|\n|23|07:07|\n|24|06:56|\n|25|07:06|\n|26|06:58|\n|27|06:59|\n\n# Background\n\nI am 33F and relatively new to running “seriously.” Over the past 3 years, I’ve averaged ~20–30 mpw and mostly trained for fun trail races. I’ve completed a few ultras (two 50Ks), a trail marathon, and one road HM (1:38 PR), but this was my first road marathon.\n\nThis cycle, I wanted to challenge myself with speed and road-specific training. I didn’t have the best sense of my MP since I had only run on quite hilly trails (4+ hr was my PR), but I estimated I could achieve a BQ of 3:25 based on last year’s HM PR (1:38) and recent fitness gains.\n\n# Training\n\nI loosely followed the Pfitzinger 18/55 plan (18 week training cycle), though I had to adapt it heavily and shorten workouts due to work (10-hr shifts at the hospital) and life (puppy!). I peaked at 52 mpw, with most weeks in the 35–45 mile range. Body felt good with the higher mileage, and I mostly felt limited by time constraints. Long runs included two 20-milers and several 18–19 milers. Speedwork included strides, hill repeats, and tempo sessions. Weekend long runs were often on hilly trails or incorporated MP (7:30-40ish) on roads.\n\nStrength training dropped off in January, but I stayed consistent with Z2 aerobic volume, speedwork, and recovery. Had to cut short a lot of Pfitz’s mid-week long runs, but still had markedly higher mileage than I was used to, even with two or three rest days per week. Thankfully, I didn’t get injured and got sick only once (for three days).\n\nTraining was fun because I’d never focused on road running before, so I PR’d in everything this cycle: \n•\t5K: 20:25 \n•\t10K: 42:35 \n•\t10 Mile: 1:11:xx\n\n# Pre-race\n\nI tapered aggressively over 3 weeks and only ran a couple of short shakeouts during race week. Slept well, hydrated heavily, carb-loaded with intention, and avoided alcohol the final week. Took two full rest days before the race (with lots of walking).\n\nRace morning: Woke at 5:45, had pancakes and oatmeal immediately and an oz coffee with cream. I had slept decently despite nerves. Missed my pre-race warm up/ shakeout because the event was so crowded!\n\n# Race day details\n\nWeather: Couldn’t have been better—coolish (50s), sunny, dry, low wind. \n\nCourse: Rolling hills early, flat and fast later, with beautiful scenery—UBC forest, downtown, and the seawall.\n\nCrowds: WAY MORE than I’m used to (trail runner here). The energy was awesome, though the start was chaotic. Collosal lines for the bathroom, so I had to squat behind the Porta in order to make it to my corral in time. (Sorry.) I was able to squeeze my way to the end of the first corral before the gun time.\n\nFuel: Took SIS isotonic gels every 30 minutes, starting 5 mins before the gun. No hydration pack; just sipped from water/electrolyte cups at every aid station (every ~3K).\n\nGear: Shorts with gel pockets. Shoes were Adizero Adios Pro 3s.\n\n# Race strategy\n\nFocused on easing into the first 3 miles due to bottlenecking and conserving energy by running tangents (as able). My goal pace was around 7:40/mile, while \"banking time\" on the downhills (7:00-7:20ish; not overdoing it, to save my quads) and easing the pace on the hills (primarily Camuson Street).  I could not find my 3:20/3:25 pacer, so I selected other runners periodically to pace behind, before eventually passing them once I had my big \"kick\" at the final 10k of the race! I was consistent with taking one gel per 30 min, and drank to thirst from aid stations every 3-5k or so (alternating between electrolytes and water). Since I felt strong by mile 10, I dialed up the pace and had negative splits the latter half of the race. No bathroom breaks!\n\n# Race recap\n\nWhat a glorious course! It was rolling with plenty of gradual uphill/downhills. The city itself is gorgeous, clean and modern, contrasting with the lush forests of UBC’s campus and the mountain views along the Stanley Park seawall. Morale was high because of all the crowds of spectators throughout the whole course! Volunteers handed out cups of water and electrolyte juice every 3k or so.\n\nMiles 1-7: I started conservatively because of the hills and crowds in the beginning, but quickly realized I could handle a faster pace than my original target of 7:40-ish/mile. The biggest hill was the infamous Camosun (about 1.2k and 52 meters), which I’d built up to be way worse in my head than it was! It was also early at mile 6, which helped to get it out of the way. \n\nMiles 8-14: Flat-ish, serene forests of Pacific Spirit Park and the University of British Columbia (UBC) campus, followed by about 3 miles of speedy downhill to the Kitsilano neighborhood! Picked up the pace here (including sub-7min mile). \n\nMiles 15-18: Started to feel the sun exposure here, but doggedly followed a lovely lady in front of me, who seemed to be pacing about 7:25-7:30/mile. Slight uphill at Burrard Bridge around mile 18 was manageable.\n\nMiles 19-24: The course was mostly flat on the latter half of the race, so by mile 20 (the seawall at Stanley Park) I felt it was safe to amp it up some gears! Fresh ocean air, mountain vistas, and few spectators made for a calm and focused headspace. Felt good to be passing people at this point, pushing under 7-min/mile, even with burning quads! My militant fueling massively helped with this \"kick\"; I had learned my lesson from my last 50k, in which I bonked massively from underfueling.\n\nMiles 25-26.5 (according to my watch!): Slight uphill through the streets of downtown to the finish line HURT, but I pushed with all my might at under 7-min/mile pace!\n\n#Post-race\nQuads are VERY SORE, but otherwise feeling good (joints, feet, etc.!) Will take it easy for a few weeks before easing back into base building for next year. \n\n#Takeaways/next steps\n\nOverall, it was a beautiful day and a gorgeous course. I was thrilled by my time (3:15, ten mins faster than my BQ goal), fueling, and surprising negative splits! (Though now I am wondering if I should’ve started faster?) \n\nI am planning to take on Boston next year with a similar training plan. I had underestimated my MP, so I will focus on speed this next training block and might start making loftier goals— sub 3 one day? (Gasp!)  \n\nShout-out to the guy with the bib name “NOTSURE” (get the reference?)!\n\nMade with [Strava race report generator](https://race-report-gen.jezl.xyz/).",
      "author": "Singitsayit",
      "created_utc": 1746576899.0,
      "score": 53,
      "num_comments": 12,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "youtube"
  ]
}