{
  "id": "twin_ViciousPenguinCookie",
  "username": "ViciousPenguinCookie",
  "activity_count": 1,
  "interests": [
    "that",
    "with",
    "this",
    "were",
    "race"
  ],
  "post_times": [
    1746758729.0
  ],
  "history_sample": [
    {
      "id": "1ki878o",
      "title": "Eugene Marathon 2025 Race Report - First \"BQ\"",
      "selftext": "### Race Information\n* **Name:** Eugene Marathon\n* **Date:** April 27th, 2025\n* **Distance:** 26.2 miles\n* **Location:** Eugene, OR\n* **Website:** https://www.eugenemarathon.com/\n* **Strava:** https://www.strava.com/activities/14304669495\n* **Time:** 2:53:12\n\n### Goals\n| Goal | Description | Completed? |\n|------|-------------|------------|\n| A | 2:50 | ❌ |\n| B | 2:55 |  ✅ |\n| C | <3:00 |  ✅ |\n\n### Splits\n\n| 3M Split | Time\n|------|-------------|\n| 0-3 | 19:53 |\n| 3-6 | 20:02 |\n| 6-9 | 20:01 |\n| 9-12 | 20:12 |\n| 12-15 | 19:41 |\n| 15-18 | 19:55 |\n| 18-21 | 19:49 |\n| 21-24 | 19:27 |\n| 24-26.2 | 14:05 |\n\n### Training\n\nI’m 31M, have done multiple marathons, and for context I have Type 1 Diabetes and Celiac Disease so I yap a lot about blood sugars and finding gluten free food.\n\nAfter running the Toronto Waterfront Marathon in 3:04 last fall, I took a few weeks to rest, kept my mileage low, and did a few events. I PB'd in the 10k in December (just over 37 minutes) and ran a 45k trail race in about 6 hours. I signed up for Eugene in January and officially started training for it in the new year.\n\nI took advantage of a promo to get a gait analysis done. A physiotherapist observed me running on a treadmill. She identified that I was overstriding a bit and landing on my heel, and that I was leaning back a bit. She gave me tips to lean forward and try to land closer to my body. I did a follow-up a month later and my form seemed to have improved. I can feel it when I’m running too. Leaning forward feels more efficient, but when things get tough I have a habit of reverting back to my old ways. I have made improvements on that front, though. Towards the end of the training block, I actually also experimented with lifting my heels and landing more on the front of the foot, and I could tell that my legs liked the feeling of that a lot more. I felt a lot more fast and efficient, but I also knew that forcing a gait change isn’t a good idea in the short-term, so that’s something I’ll play around with this summer to see if that’s something I can naturally develop. \n\nMy original intention was to give it a solid effort to break 3 hours with hopefully better weather than TCS, but I didn't put too much pressure on myself to train too hard for it throughout the winter and let myself cross-train by swimming and playing volleyball while it was snowy outside. I ended up running a lot more than expected through the harsh conditions, and had a blast doing so. I think the mental training that came out of running through blizzards and doing long runs in a downpour while on vacation in Portugal really helped build my confidence in being able to manage discomfort.\n\nAt the beginning of the training block, I did a fair bit of workouts on the treadmill. My club's training plan started off with a block of high intensity efforts, and I found that doing intense efforts when it was below freezing triggered bronchospasm. I saw a doctor and ended up needing an inhaler to get over that issue. I decided to do treadmill workouts for a month or two. If I had to run fast outside, I would wear a mask to keep cold air from getting in my lungs. It wasn't until late February that I started doing workouts outside again.\n\nAs part of the training block, there were a few tune-up races I did:\n\n* A half marathon in the first weekend of March which I ran on a particularly cold day (9℉) in tempo shoes and wearing a mask the whole time in 1:25.\n* A ~6.8k relay leg in mid-March which I managed to run in Kinvaras at around 3:43/km, 5:58/mi pace.\n* A 30K where I just ran about 17 or so K at target marathon pace. It was a cold and rainy day and I wore NB Propels, which wasn't great for my knees in the end.\n\nI had the opportunity to get my VO2Max tested as part of a promotion. During the test, they measured oxygen flow through my muscles and my respiration. They had me run on a treadmill at an increasing pace and eventually incline until I stopped. I didn’t want to push too hard on the treadmill because my legs were starting to hurt and I certainly didn’t want to strain anything during the test, so I stopped. The end results were that my VO2Max was high, but my aerobic threshold was low, so that’s the biggest area of improvement for me. Another thing that came up during the test was that my respiration rate at aerobic and tempo zones was way too low. I explained to the doctor that I deliberately slowed my breath down with the logic that it would help my body relax like in yoga, and he told me to stop doing that immediately lol. I took that advice moving forward, and over the summer I’ll try to increase my mileage to get my aerobic threshold to improve. Overall, my mileage for this block wasn’t too high, peaking at 53 miles in one week, which is under 90k.\n\nI didn't have any injuries, but some minor issues during the block. My adductor would sometimes flare up in the beginning of the year, and that's an issue I've had before. My right achilles would also feel sore after runs in the beginning as well. My right knee often bothered me. I went to PT to make sure nothing was wrong, and I was given exercises to address all of those concerns. I did them pretty consistently (and need to get back into it), but found that all the exercises really helped. I don't really feel pain in my adductors anymore: just soreness sometimes.\n\n### Pre-race\n\nI planned a two-week solo trip to the Pacific Northwest as part of this race. My company has offices in Seattle and Portland so I worked out of those offices during my stay. \n\nThe Tuesday before race day, I had an 8am flight to Chicago (I grew up in the area). I screwed up the morning and didn't get on the train to the airport until 6:30. After it arrived at the airport, I dashed in my boots to the Air Canada kiosk to check in (online check-in wouldn't work). Thankfully the employee was able to do it despite it only being 61 minutes before departure. I got on my flight and arrived around 9am. I took the CTA to the city to eat breakfast, work at my company's office and meet high school friends for lunch. I also had a contact who could do my nails at a cheap rate so I got them painted green in preparation for Eugene. I also stopped by Do Rite Donuts to get some gluten free doughnuts to begin my carbo loading for the week.\n\nMy flight to Seattle was in the evening. I had dinner in the city and took the train back to the airport. I arrived in Seattle before 11pm, so I was able to take the Light Rail into the city. It took an extra 15-20 minutes because of construction, but I got to the hostel I was staying in around midnight near Pike's Place. Over the next few days, I did my runs in Seattle, worked from my company's office there, and used their facilities (there was a sauna in the office which is insane and I took advantage of that every day I was there). I think I did too much walking while I was in Seattle and think I should have used the Lime bikeshare system more than I did, but I was being stingy with my money. I walked over 33k and 22k steps every day I was in Seattle with many of that happening with my work laptop, charger, running shoes, and change of clothes on my back.\n\nI got a massage on Wednesday, and it was quite deep. My calves were in pain during the massage and slightly after. I applied some ice to my right calf while working, and I was still feeling a bit tight on my run the next morning, but I could tell things were loosening up. On said run Thursday morning, I kept it short, but ran 10 minutes at what felt like marathon pace. This ended up being around 6:35-40, but it was in my Novablasts. I also accounted for the fact that I was still sore from the massage the previous day.\n\nOn Friday, I took the 7am Amtrak train to Eugene. The station was a 20 minute walk from my hostel in Seattle, and the ride was pleasant. The train was full of runners. After arriving in Eugene, it was a 20 minute walk from the train station to my AirBnB. I walked my bags there and then walked back downtown to get my bib and have food (I probably should have biked or taken a bus). I ended up having a gluten free sandwich at Eugene Burger Company because they were very good at accommodating my restrictions. I felt bad about eating meat since I try not to, but their GF crispy chicken was very good, it came with a lot of fries, and they have certified gluten free Blue cheese, which I'd never had. After this meal, I ended up walking way too much to go to a grocery store to pick up cream of buckwheat, soy milk, and cookies. I didn't go out for dinner because my late lunch was very filling. I walked 14k steps on this day. Not too bad but I could feel the fatigue from walking.\n\nI signed up for the 5k happening on Saturday morning with the intention of using it as a shakeout and practice run. I microwaved the cream of buckwheat in some water in the microwave and then added soy milk, a pinch of salt, and honey to it as well. To be honest this was a pretty sad breakfast, but not terrible for quick stays. Hard to beat the porridge I can make at home with my instant pot and fresh fruits, nuts, and seeds. I took a bike to the start line and was able to get there in under 10 minutes. This was a good opportunity to learn how to use the bikeshare system and figure out where to park. I ended up being 45 minutes early for what I was treating as a shakeout so I just hung around and chatted a bit. I saw a woman stretching who had a CGM on her arm so I tried to start a conversation by calling her a fellow diabetic: turns out she wasn’t diabetic, just interested in health stats lol. But we still had a nice chat; she intends to run a marathon in every state. I forgot what number she was at but she clearly had a lot of marathon running experience. \n\nI wasn’t too serious about getting into a corral for the run since it was just a shakeout for me, but this was a mistake because I ended up starting with people who signed up to walk the thing. It probably took 500m of very slow running before I was able to make it to the sidewalk and get ahead a bit more. There was another person with me in the same predicament; he was a British man living in New Mexico who was also doing this as a shakeout. He was smart and he used the bikeshare system to check out points of the course the day before. In hindsight, I wish I had done that. Less than a mile into the 5k, I saw a young-looking woman puking on the side of the road. It sucked to see that so soon into a 5k; I guess she hadn’t seen the episode of the Office where Michael didn’t carbo-load for the charity 5k properly :/. I picked up the pace to do some strides towards the end of the run. We finished at Hayward Field ~~Park~~, so that was a good preview for what was to come. I visualized finishing the marathon and running on this same track. After finishing, I got my goodie bag and picked up some gluten free pancakes to continue my carb loading. I then biked back to my accommodation to shower. \n\nI biked back downtown to visit a gluten free bakery that was only open on Saturdays to pick up an amazing brownie and some bread rolls to snack on. I walked through the Saturday outdoors market and felt sad that I couldn’t spend more of the day walking around and spending time at each of the neat tents they had there. I went back to Eugene Burger Company for lunch. I preemptively took enough insulin for 180g of carbs because I was having a lot of problems with my blood sugar going high. I took this dosage over half an hour before having the sandwich and fries, and then brownie. I biked back to my accommodation and had some cookies. My blood sugar spiked shortly after this (mostly from lunch, but the cookies didn’t help). I tried to nap for about an hour. It took a few hours for my blood sugar levels to stabilize before I went out for dinner at Jazzy Ladies for some pasta. Again, I tried to take a high dosage of insulin well before eating. I ended up at about 18k steps for the day.\n\nThis time, when I got back to my accommodation, my blood sugar was reading low, and I kept getting alerts saying I needed to eat sugar, but I knew to ignore it because the pasta was going to cause a spike. This is extremely annoying, but it’s a very regular occurrence for me. My devices will beep at me for an hour straight telling me I need to urgently consume some sugar, I will keep having to silence them only for them to beep again a few minutes later, and then my blood sugar will end up spiking too high because whatever I ate a while ago is now being processed. This happened the night before the race where the whole evening I was getting alerts about being too low, but I knew it was going to spike. I wanted to avoid eating too much, but I also did NOT want to get woken up in the middle of the night with lows, so I ended up eating a bit of candy hoping that would prevent that from happening before I slept around 8 or 9pm. I think this was a mistake because my overnight sugar ended up being pretty high (between 10-14, or 180-252), so I didn’t get the best rest and I woke up feeling a bit nauseated and groggy.\n\n### Race\n\nI woke up around 4:15 in anticipation of a 7am start to the race. I had my sad beige buckwheat porridge and some coffee as well. I got everything ready the night before; I had my race belt with bib and six gels (4 Maurtens, one Huma+, and one ginger-flavoured Brixa), my pre-race snack (GF Honey Stinger Waffle), a water bottle with some table salt and honey mixed in that I would sip on that morning and while warming up, and my Saucony Endorphin Elite 2s in my drop-bag to switch into after my warm-up. I did some PT exercises in my room with a band to activate my glutes and adductors. As is tradition, I peed at least 5 times before leaving around 6:10am. It took me 10 minutes to bike to the start area. There, I did some PT for my knee and jogged around for a bit in my trainers before doing some dynamic stretching, using the porta-potty one last time, then switching into my race shoes and checking in my bag. \n\nI had about half an hour to spare. I got to the start corral and found the 2:55 pacer not too far from the front of the pack. I intended to try and stick with him for the first quarter of the race and see how I was feeling. About 15 minutes before gun time I had my waffle and disposed of the wrapper. Overall I was feeling not my best because of all the blood sugar issues, and I could tell that I was on my feet too much over the past week because I felt the fatigue in my legs, but I also didn’t feel too bad like I did in Vancouver last year. I felt that at least sub-3 should be possible. My blood sugar was around 8 or 9 and looked like it was going up a bit, which was perfect.\n\n#### Miles 0-3 (19:53)\n\nWtf, why is the 2:55 pacer going so fast? 😭\n\nMy goal for the race was to aim for at least 6:40/mile pace, but aim for 6:30 if I felt good to hit my A goal. It was a pretty crowded start and probably the hottest I’ve felt at the beginning of a marathon in a while. I felt like I was going too fast but the 2:55 pacer was way ahead of me. There were a bit of rolling hills in the beginning of the course, so I wasn’t expecting too consistent of a pace to start with, but after a few minutes and some elbow brushes with those around me, I had to give up and run my own race. This was unfortunately pretty disheartening, but I tried to tell myself that the pacer was going too fast (others around me felt the same way), and that my pace was fine. I did feel nervous though because I felt like the pace was a bit hot, and my expectation was that the first half of the marathon shouldn’t feel too difficult.\n\nAt around the 3 mile mark, the crowd thinned out a tiny bit, but there were still so many people at my pace. I knew going in that this was a fast race, and I think having so many people run sub-3 made it easier for me, whereas I don’t know how it would have felt at a slower race. I had Gatorade at almost all of the aid stations to keep my blood sugar levels high and to overcompensate for the fact that I felt like I would run a bit hot. I knew not to put too much pressure on myself in terms of heart rate, but I wanted to keep it under 160 for the first half if possible. It looks like I was able to do that for the most part. I did get nervous because right before the 3 mile marker, I felt a bit of sweat on my forehead. I worried that maybe it meant I was going too fast. My blood sugar was still around 9, and I tried to relax my body as much as possible and not push the pace too hard.\n\n#### Miles 3-6 (20:02)\n\nI believe at this point of the race, things were a bit quiet, but there were still cool moments. We passed two musicians with a banjo and guitar singing about marathon runners at one of the empty parts of the course. I heard some folks around me talk about how they were going for 2:55 so I ran around them for a bit. I checked my watch often to see what my pace was because I wanted to have as much buffer below 6:40/mile as possible without pushing myself too hard, and I also wanted to get as close to 20 minutes per 3 mile split as possible.\n\nThere was a woman in a green singlet well in front of me who had gels in pockets at the back of her singlet. I heard some of her friends make jokes about how they were just community gels that were up for grabs for anyone. Speaking of which, around 4.5 miles in is when I took my first Maurten gel, as I wanted to take one every half hour. My blood sugar levels were still around 9 or 10. It may have gone a bit high with that plus the gatorade, but I didn’t worry as I could tell it would drop soon. \n\n#### Miles 6-9 (20:01)\n\nIt was a gentle downhill for most of this leg. One highlight includes a guy who had an inflatable Trump punching bag that he brought to this section after having it available near the start too. The only aspect of this part of the race I remember is that after an aid station towards the end of it where I had some Gatorade, we had a sizable hill to climb (not too long) before going downhill again and making our way back to Hayward Field. On the uphill, I ended up catching up to the woman in the green singlet. We ran at a similar pace for a bit.\n\n#### Miles 9-12 (20:12)\n\nI saw from some peoples’ posts that there was a therapy Llama here? I completely missed it! (I ended up encountering a therapy Llama at Pioneer Square in Portland later that week so it’s all good.) \n\nAs we were crossing the Start Line going the opposite way, the crowds were pretty dense. On the other side of the road we could start to see the finishers for the half marathon looking strong. I had either another Maurten gel here, or my Huma+ gel.\n\n#### Miles 12-15 (19:41)\n\nAs we crossed the bridge into Springfield, reality started to set in with respect to my goals. The race was almost halfway over, and I was going to cross the halfway point at well over 1:25. To my left I could start to see runners ahead of me, but I didn’t know how far ahead they were as I didn’t study the course. Feeling motivated and perhaps coping, I tried to push the pace a little bit in mile 13 because I mentally wanted to be well under 1:27:30 for the halfway point. Even if I accepted that 2:55 would be my goal for the race, I wasn’t comfortable with not having much buffer.\n\nThe turn-around point was a bit after mile 12. I could see runners ahead of me and noticed a man wearing a button-down shirt. Instantly felt self-conscious over the fact that I was worried about overheating in my singlet and half-tights. Thankfully, shortly after turning around, I passed that runner and stayed ahead of them. It would have been demotivating to look at them ahead of me for much longer.\n\nI don’t recall quite what my half marathon split ended up being, but I remember not being thrilled about not having enough of a buffer. I felt pressure that I had to be very careful not to push myself too hard and to make sure I was getting enough electrolytes and fuel to avoid any cramps. At this point there were no major concerns. I just felt that the run was a bit tiring and I was mostly worried about reaching my limit at some point. Around 13.5 miles in, instead of having a gel, I had an Awake chocolate bite. None of my gels had caffeine and even though I’m skeptical of it having any effect on me, I figured it couldn’t hurt to have some during the race. Besides, a little chocolate was a nice treat where I’ve otherwise just had gels and Gatorade.\n\nThis part of the course took us through some suburban neighborhoods and then into an asphalt trail with a field of tall grass. There were two kids in their late teens/early 20s running besides each other having a very casual conversation. They both seemed very relaxed, which made me feel a bit self-conscious about how I felt like I was trying hard, but it also made me feel motivated. I ended up unintentionally eavesdropping on their conversation about university, their experience in Oregon, and choosing majors between CompSci and Finance. I heard loud footsteps approaching from behind me; I moved to the side and waved them in. Turns out it was the woman in the green singlet again. She may have slowed down during an aid station to properly take in fluids before speeding back up. I couldn’t keep up, but I stayed with the younger pair for the rest of the leg.\n\n#### Miles 15-18 (19:55)\n\nOne of the young lads pushed on ahead while the other stayed at my pace. We fist bumped as he moved ahead too eventually. There were lots of beautiful tree-lined trails in this section which I unfortunately wasn’t able to fully appreciate due to the fact that I was locked in, listening to my body, and paying attention to my watch. Throughout the race, my right ankle was experiencing some soreness, but nothing too alarming.\n\nAround mile 16 or 17, I started feeling a bit of tightness in my right hamstring and adductor, but it didn’t last too long. It made me paranoid about whether or not I would be able to hold on. Doing the math on how much of the race was left (10 miles and some change), I calculated what would happen if something gave out and I had to run 8 minute miles for the rest of the race. It would no longer be a sub-3. I didn’t feel bad enough to have to slow down so I thought that I just needed to hold on for a few more miles in order to achieve enough buffer for a sub-3. \n\nAt this point, I knew that my 2:50 goal was out of reach. I would have to push the pace a lot in order to make that a reality. It might be possible, but it’s also a risk I wasn’t comfortable with. Maybe I push myself to shave off a couple of minutes: in the best case scenario, I succeed, but won’t even have enough buffer for a BQ. In the worst case scenario, I could sabotage the race and not even end up going sub-3 let alone PB’ing. I chose to play it safe.\n\nBecause I was afraid of cramping, I took my Brixa ginger gel towards the end of this leg since I believe it had higher sodium content than the Maurten gels.\n\n#### Miles 18-21 (19:49)\n\nAfter mile 20, it became a matter of running one more 10k. I was a little bit over 2 hours at this point and I thought about how I had to run in the low 40s just to barely get under 2:55. I still felt strong and wasn’t worried about hitting a wall.\n\nShortly after mile 20, I caught up to the woman in the green singlet once again. This time, she started a conversation by pointing out that we met again. I asked about her goal, which was anything under 3 hours, and I told her that my original 2:50 goal was out of reach, but that I wanted to aim for under 2:55. We ran together for about 10-20 seconds, gave each other words of encouragement about being able to hit our goals, and I sped ahead. The words of encouragement helped me feel better about the rest of the race, and in a matter of minutes, I could see the 2:55 pacer off in the distance. At first they seemed far away and I assumed they would stay ahead since they were going pretty fast and the pack was looking pretty strong, but little by little I kept creeping up.\n\nI started with the goal of just catching up to the group, and it probably took me about 5 minutes to do so. If I recall correctly, there may have been some casualties along the way. I believe it was right before the 21 mile marker when I finally caught up. Catching up to them was a huge confidence boost for me. At the beginning of the race, I had just assumed the 2:55 pacer was gone for good. I’m not sure if they had a positive split; I know mine was negative, but I didn’t think it was *that negative* that I would get so far ahead that I would catch up to a group that I couldn’t see the whole race. As I was passing the group, I heard the pacer say that he knew what everyone was feeling, and that his hip flexors were hurting too. \n\nIt was a bit early, but I went ahead and ate my 5th gel, which was Maurten. With under 10k left, and with gels taking 15-30 minutes to really make a difference, I figured that delaying it any longer would make it pointless to have another. I still had one more after this; I figure the caffeine chocolate I had at the halfway point and the Gatorade throughout the course provided enough carbs such that I didn’t need a 6th gel.\n\nWith the pacer behind me, I felt strong. My legs still felt tight once in a while but it was perfectly manageable, and not nearly as bad as some of the training sessions I’d been through this season. There were some disheartening moments for sure: I saw a few women recovering from puking and struggling to get started again, lots of runners suddenly having to stop to stretch, and some runners who kept going but slowing down and looking like they were in pain from their strides. \n\nI tried not to put too much weight on those observations and kept on; I do a lot of running solo with no music so the quiet parts as we approached the turnaround were no problem for me. There were some memorable moments, like a marching band that was playing as we passed. There was a pair of signs saying “Damn, are those Sauconys?” followed by “Saucon-deez nuts!” As I was wearing Endorphin Elite 2s, I gave those folks a shout-out.\n\nAt the end of this leg was a turnaround, which involved going up a curved incline to reach a bridge. It felt a bit tough this late in the race but I was able to get up without anything going wrong thankfully. From here it was just 5.2 miles left back to Hayward Field.\n\n#### Miles 21-24 (19:27)\n\nThis part of the race went by very fast. I was feeling the runner’s high and was going faster than I was at any other point of the race so far. There were well under 40 minutes left and I knew I could manage the pain for that long pretty easily. \n\nIt doesn’t really show on the course profile much but it felt like there were a lot of undulating little hills in this section. It didn’t affect my pace, but I had to pay enough attention to my form to accommodate. It was hard to maintain pace and drink Gatorade so I did a quick power walk at the aid station to sip and got right back running.\n\n#### Miles 24-Finish (14:05, 19:12 equivalent for 3 miles)\n\nFinal stretch and still going strong! I felt good about how much of a buffer I had under 2:55. I didn’t have pressure about trying to hit 2:50, and at this point whatever time I could cut down was extra credit. \n\nWhen I made the final turn with less than a mile left, I tried speeding up as much as I could without feeling like I would strain anything. I crossed through a park with curvy sidewalks. A spectator started encouraging me to catch up to the person in front of me. Throughout this entire section I was passing people. In hindsight, I think I had too much energy here. We eventually merged with half marathoners who were still running, but were still separated by cones. I thought about how this was the section where I saw the top half marathoners finish almost two hours ago, and now it was my turn.\n\nAs I turned onto the track at Hayward Field ~~Park~~, just like I had in the 5k the previous day, I heard the announcer commend all of the marathon runners who were doing their best to get under 3 hours. I found this odd since it was still a few minutes below 2:55 and I figured he would highlight the BQ timing, but that’s a nit-pick! As I turned the final curve and went for the finish line, I was humbled by a dad in front of me who picked up his daughter from the crowd and jogged to the finish. Hoping to get a good finisher photo I hit a pose as I crossed the line and the clock read 2:53:22.\n\n### Post-race\n\nRight after crossing the line, I felt a bit disappointed. Obviously I was happy it was over; I hit a huge milestone with a technical BQ, and I could stop worrying about all the things that could go wrong in the race. However, I still had a lot of energy left. I felt like I could probably maintain a fast pace for another mile or two. My immediate thoughts were that I didn’t give it my all, that I may have run too conservatively, and that I spent too much time on my feet over the last few days. I think there was a part of me that was also just sad that it was over because it was such a fun race and I wanted to keep going and pushing myself.\n\nStill, I was happy that nothing went wrong. I hit my B goal. I didn’t have any digestive issues or feel sick. My blood sugar was cooperative for the first 20 miles (my glucose sensor stopped reading after that point. The Dexcom G7 is pretty unreliable but the fact that it worked for the first 20 miles was a miracle tbh). I have room for improvement for my next marathon because I know I can go faster, although it’ll be hard to beat the course profile and weather.\n\nI slowly walked through the chute to get my goodie bag with a banana, bagel and cookie. I tried pretty hard to get someone to take my bagel and cookie since I can’t eat gluten but eventually gave up because no one wanted it. I wasn’t a fan of how the goodie bags were handed to us with goodies already inside, especially because the bagel was bare and touching everything else.\n\nI sipped on the water bottle they gave us and ate the banana. It felt like a long walk to bag check, where I had to wait in line for a long time. It may have been 15-20 minutes of waiting in line before I got my bag. After I finally got my bag, I put on the jacket I had in there and switched back into my Novablasts. I slowly walked over to the water station to refill my water bottle and walked upstairs to get my gluten free pancakes. The pre-race guide we got said that there would be grilled cheese sandwiches, and that section mentioned “try our gluten free bread,” so I thought there would be gluten free grilled cheese. Sadly, I asked the folks at the Franz food truck if they had any gluten free bread and they said no. Not a big deal because I was happy to have pancakes at least.\n\nI got my pancakes and leaned against a wall to eat them. I was scared of sitting down because I don’t know if I’d be able to get up. After that, I took a selfie with my three medals with Hayward Field in the background, refilled my bottle, and headed towards the exit. \n\nThere was some confusion on shuttle buses at the exit. I asked a volunteer where I could go to catch one: the shuttle buses went downtown so I intended to grab brunch at Jazzy Ladies before biking or walking back to my accommodation. The volunteer told me to go to the cemetery, but after I walked up a hill to get there, there were no signs of a shuttle. I walked around a bit and found a group of people walking away from me. I asked if they were going to the shuttle and they said they thought so. I decided to follow them for a bit until I saw a woman look like she was waiting as well. When I asked her about it, I found out that we both talked to the same volunteer. We both decided to keep following this group.\n\nEventually, while the group was in front of us, I looked to my right and saw what looked like a crowd of people waiting for a bus. Apparently the source of confusion was because one of the last shuttles to the start was cutting it close to the start time, so runners on the bus asked to get off by the cemetery. For this reason, some volunteers thought this was a shuttle stop.\n\nThere was already a big group of people here waiting for the shuttle, and I heard a volunteer say that after one shuttle is full, the next one will be 10-15 minutes. There was also no line-up: people just crowded up until the shuttle arrived so it didn’t matter who was waiting for longer. Not wanting to be part of that chaos, I ended up just taking a bikeshare and biking back to my accommodation to shower.\n\nAfter resting a bit and eating a bread roll, I biked back downtown to go to Jazzy Ladies for brunch. Unfortunately, when I got there (2:30pm), they stopped accepting patrons for brunch and would re-open at 5 for dinner. I walked over to a fast-cas place called Cafe Yumm and got a rice bowl from there instead. It tasted a bit sweet, but it was still satisfying. I then had a few hours to kill in the city before dinner.\n\nI decided to go by the river and re-visit parts of the course since I wasn’t able to appreciate it while I was running. I got a bit carried away and covered 9k on [my walk](https://www.strava.com/activities/14307940257), going around the river and hiking up Skinner Butte before heading back downtown. I finally had Polenta Lasagna for dinner before heading to Handel’s Ice Cream at 5th Street Market to get my discounted ice cream for showing my medal. This place had long lines the whole afternoon. After dinner there was still a line going outside but it wasn’t too bad: it probably took me 10 minutes to get my cup. The server was very helpful at confirming which flavours were gluten free and scooping a cup out of a fresh tub with a sanitized scoop.\n\nThe next day, I took Amtrak to Portland. I stayed there and had an amazing time in the city for the week to cap off my PNW trip. I really fell in love with the city. I spent a decent amount of time in the Arboretum and Forest Park trails, and I did a half-day trip to see waterfalls. I had so much amazing gluten free food in Portland and am sad that I didn’t get to try all the places I wanted to. I ended the week by taking the train from there up to Vancouver, BC for a night before flying back to Toronto.\n\n#### Positives\n\nEugene Marathon was AMAZING! Highly recommended if you’re in the states. Probably the best marathon I’ve participated in all-around.\n\nThe city really gets taken over for the marathon. The train from Seattle was completely full because of it. 12,000 people participated in the event. Even though it’s a small college town, the organization is top-notch and I never felt that crowds were much of an issue even with all those people. Maybe getting your bag after the race was the only slow part.\n\nThe course itself is beautiful, and did not have any difficult parts to dread. Crowd support was very good. Aid stations were well-managed and I appreciate that they offered Gatorade instead of Nuun since that helps take in carbs during the race. The weather was very good and it was refreshing to not deal with strong headwinds, which is something I experience a lot in Toronto.\n\nThe people I interacted with were mostly friendly. The reputation of this race brings out a lot of very strong runners. So many people ran sub-3, and having others to run with and compete with may have helped things for me. According to findmymarathon.com, 16.8% of finishers BQ’d.\n\nThe gluten-free pancakes were much appreciated. One thing I didn’t mention was that in the 5k, they have a male and female pancake participate in the race, and if you beat the one in your respective category, you get free pancake mix. It’s too bad I had to save myself for the marathon because genuinely racing a pancake running a 17 minute 5k sounds really run.\n\nThe race being in the PNW makes it a really fun travel destination. The city is well-connected by transit to Portland and Seattle. The city itself is walkable, bikeable, and you can get by with the bus as well.\n\n#### Negatives\n\nThere aren’t many negatives to talk about. I suppose the situation with the shuttle after the race was a bit annoying, but I was still able to get where I needed to go pretty quickly by bike.\n\nThe hotels that were in Eugene were very expensive. This makes sense considering the size of the town versus how many people were coming in for the race. I ended up having to book an AirBnB guesthouse to keep things reasonable for a single person. There were some cheaper options over in Springfield, but that’s not as nice of a stay and would likely require a car or ride-hailing to get by. \n\n#### Future Plans\n\n* I have a 10k this Sunday, but it feels incredibly unlikely that I’ll be able to race it. I really tired myself out after the race with my hike and all the exploring I did in Portland, which included a hike and a trail run. I stayed in hostels for the week after the race so I didn’t get great rest. I arrived back in Toronto pretty late at night so I didn’t sleep well, and haven’t been sleeping well this whole week. I could use a post-trip vacation. I went on an easy run on the Wednesday before the 10k and it felt tough on the legs.\n* I am signed up for the Sulphur Springs 50k at the end of the month, but again, I’ll have to decide next week if I want to run it. I planned to do it for completion and not try too hard during it, but if I am still recovering at that point, I am considering dropping to 20k. I was looking forward to running this with a friend, but that friend hurt her ankle and is likely not running, so that hurts the motivation to push myself here.\n* I want to work on my 5k and 10k times over the summer while also upping my easy pace mileage. I have one 10k and one 5k that I've signed up for so far. I’m also signed up for a 100k casual bike ride, and a trail relay at Blue Mountain, ON. My friends and I are signed up for an Ekiden relay in June so I’m excited to run that for the first time.\n* My fall plans are not set. I am signed up for P’tit Train du Nord, but I may refund that registration. Hyrox Toronto is going to be the same weekend and I would like to participate in that. I am considering what other fall marathons can take its place. I am considering:\n * Georgina Marathon in early September\n * Niagara Falls Marathon in late October\n * Málaga Marathon in December\n * Which marathon I do will depend on whether or not I can convince others to join me so I’m not going solo. It would be nice to break 2:50 and maybe even get closer to 2:45 if qualifying for Berlin is possible.\n* For next Spring, I’ve signed up for the London lottery but probably won’t get in. If not, I am considering other marathons in Europe. Namely:\n * Paris\n * Copenhagen\n * Zurich\n * Edinburgh\n * Rotterdam\n * I will also sign up for the Tokyo lottery. I’ve never been to Japan. I may even pay for a tour or charity for Tokyo just because it would be the perfect excuse to finally travel there.\n\nMade with a new [race report generator](http://sfdavis.com/racereports/) created by /u/herumph.",
      "author": "ViciousPenguinCookie",
      "created_utc": 1746758729.0,
      "score": 45,
      "num_comments": 17,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "twitter",
    "reddit"
  ]
}