{
  "id": "twin_Illustrious_Echo5609",
  "username": "Illustrious_Echo5609",
  "activity_count": 1,
  "interests": [
    "pace",
    "that",
    "this",
    "time",
    "race"
  ],
  "post_times": [
    1746690433.0
  ],
  "history_sample": [
    {
      "id": "1khkhob",
      "title": "Race Report: Sydney HOKA Half Marathon",
      "selftext": "* Male, 51\n* Started running 10 months ago.\n* First half marathon\n* Target a: 1h45\n* Target b: 1h49:16 pb (although that is just from a training run)\n* Target c: negative split\n* Result 1h45:02, negative split\n\n**Official Splits, all in kms**\n\n5km 24.53 (4:59 pace)\n\n10km 50.11 (25m18 for 5km, 5:03 pace)\n\n15km 1:14:10 (23m49 for 5km, 4:48 pace)\n\n21.1km 1:45:02 (4m58 pace overall)\n\n**Training**\n\nFollowed Garmin Coach HM plan, 18 weeks, coach Amy.\n\nWould not recommend this, did not seem to adapt, did not include any tempo runs, strides, and only 1 or 2 hill sessions. Did not adapt to my times. Had target pace of 6:00/km for most  \nruns. I understand you have to run easy for a lot of practise, but 6:00 felt slow given I was targeting 4:58 pace.\n\nThat said, I did train 4 x a week, and the plan did get me to my time goal I suppose! I generally  \nignored the 6:00 pace and went a bit faster in training. A typical month had me  \nrunning 125-150km at average pace of 5:15/km.\n\nThis was my first HM so the 1h45 time goal came from extrapolating from times in 5km and 10km races.\n\nIn training I think I did 3 HMs, 1:49; 1:56 and 2:05 maybe.\n\n**Taper**\n\nThe garmin plan had a taper with no runs in the 3 days prior, but I did a shake out run 2.5km the day  \nbefore, easy pace. Think that was good. After running 4x a week for months, going 3 whole days with nothing would have been odd.\n\n**Carb loading**\n\nAlthough I read a lot about this, I in fact didn't take it that seriously, I just ate a few more carbs than normal in last couple days. Didn't measure it. Would take it more seriously for a full marathon.\n\n**Race day**\n\nThought I might be real nervous as I'd be training a lot and thinking about the race a lot, but in fact  \nI wasn't nervous at all. Breakfast of muesli + yoghurt plus 1 slice toast with peanut butter and honey.The weather forecast was good, and it was a perfect day, 13-17 degrees, sunny. Warm enough not to need to take a jacket on the ferry on the way there. Got there plenty early and checked out the start, and got to my corral area very early, with an hour to kill.\n\n**Equipment**\n\nI had a running vest packing 1.25km water, 4 gels, 2 band aids and my phone. While that was 2kg of extra weight, I appreciated it as I did not have to stop in the chaos of water zones, and I didn’t have to risk gels I’d never tried before. So I’d do that again, even though I reckon less than 5-10% people were doing same. Plan was to have one gel before start, and then 5,10 and 15km, which is what I stuck to and worked well.\n\n**The Corral**\n\nI got one of the last tickets to this race. And that meant I was in the last corral, for people expecting to do 2h15 and over. This being my first HM, I thought that could be a problem, but I also thought that as there was a 50 min gap between the start time of the previous corral, if I got to the front of mine, there might be some clear road ahead. That wasn’t what happened at all, the previous corral and mine merged really, so just one big queue to get through the very narrow start, 2 people at a time. Still, I ended up starting 10 mins ahead of the official start time for the coral.\n\n**First 5km**\n\nAs my overall race pace was 4m58, and I was targeting a small negative split, I thought I’d go out at 5m pace, and do first 5km in 25 mins. This was after my only other race when I went out way too hard (22m for 5km, and then hit the wall after 5km and finished in 45m47 for 10km). So key to settle in easy, keep heart rate low, and not let adrenaline get me carried away. That worked well, and did first 5km on pace, at 24m53.\n\nHowever, due to me being in a much slower pace group (and even the corral before was a 2-2h15 group), I spent the ENTIRE race, all 21.1km, weaving and overtaking. So in fact my Garmin reads that I ran 21.44km, an extra 340m of distance through weaving. My Garmin HM time therefore, is 1h43m25. So the weaving, primarily through being in wrong pace group, cost me 1.5 minutes.\n\n \n\n**5-10km**\n\nMy first concerns.\n\nIs that a blister coming? I’d had one blister in training, in 10 months, but nevertheless I’d put a pre-emptive band aid on that spot. Luckily, the concerns didn’t materialize, no blisters.\n\nAre my nipples getting sore? I had no idea this was even a thing until recently reading race reports on here. I started to feel this 8km in. But again, it didn’t eventuate.\n\nAt this point, I’m just targeting getting to 10km in under 50 minutes and then seeing how I feel for second half negative split?\n\nAccording to my Garmin I was about 30 seconds ahead, but on race time, I found out afterwards I was 11seconds behind, again the difference being all the weaving I was doing.\n\nNote that I didn’t see the km markers the whole way, only one I noticed was at 9km, so I was more plugged into garmin distance than hm distance – learning for next time.\n\n \n\n**10km-15km**\n\nFeeling ok at this point. Still weaving the whole time, “coming through on your right!”\n\nEffort is starting to go up to keep same speed. In fact, this 5km was quickish at 23:59. Nice. So I’m feeling like I’m well ahead of 1h45 pace BUT unaware that my weaving is actually making it line ball.\n\n \n\n**15-20km**\n\nIt starts with the BIG HILL which I kept going on, no issues.\n\nMy Garmin tells me I did 15-20km, 5km, in 24m25, again ahead of 4m58 pace.\n\n \n\n**20km up to finish.**\n\nThe official splits for some reason go from 19.6km to finish, and show 7m50 for 1.5km, which seems slow, but there are a couple hills in there. Garmin shows 6m43 for last 1.44km. (Remember, it thinks I ran 340m extra due to all the weaving). By the time I hit the last 300m I was flying and hit up to 3m20 pace right towards the line, so still felt strong.\n\nNegative split, I can say yes to that as first 10km official timing was at 5:01 pace, and overall pace was 4:58, so around 30 secs quicker for second half maybe?\n\nFelt actually ok at finish. Still feeling ok, not to sore, a few hours later.\n\n \n\n**Reflections**\n\nReally pleased to get first HM done, and hit target (give or take 2secs). I don’t love crowds, so running with 20,000 people wasn’t joyous for me, and the weaving was frustrating. So, will have to book early and get right corral next time. Literally the whole way was so busy. The training seemed to pay off, the nutrition and gel strategy, and taking my own water worked well. All the race reports I read on here helped think through and make plans.",
      "author": "Illustrious_Echo5609",
      "created_utc": 1746690433.0,
      "score": 31,
      "num_comments": 15,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "instagram",
    "youtube"
  ]
}