{
  "id": "twin_macanddisease",
  "username": "macanddisease",
  "activity_count": 1,
  "interests": [
    "running",
    "runs",
    "anything",
    "supplements",
    "i've"
  ],
  "post_times": [
    1742303243.0
  ],
  "history_sample": [
    {
      "id": "1je4ijx",
      "title": "Is there anything wrong with glucose tablets / supplements for running?",
      "selftext": "Hi all,\n\nI've read a lot of post on here recently about fueling when running and just wanted some more opinions / clarity if you'd be willing to share.\n\nContext:\nAs a fairly new(ish) runner myself (regularly doing 5ks several times and week and longish runs of 10-20k once a week, having been running low volume on and off for 2-3 years), I want to start explore more about what kind of fueling supplements would be good to take to help enhance my performance. I've read loads on here from people saying about not necessarily needing to take anything like gels, sugary foods etc. before or during a run if you're running less than 60-90 minutes due to your glycogen stores not having depleted. Although I'm  sure this is true, I do find personally since I'm not an overly experienced runner that my energy levels do ebb and flow throughout my run and at times I could use a slight boost, even during my shorter runs.\n\nAs such, I've recently begun experimenting with Dextrose Energy Tablets and using some generic dissolvable electrolyte tablets for my long runs and have experienced a noticeable different in my performance (i.e. in speed, focus, endurance etc.). I'm yet to try anything more complex or expensive like gels so can't really comment on their benefits, although I'm sure they'd probably have a similar effect. For context, I do usually eat a good balance of carbs and sugars in advance of my runs and drink plenty of water, including taking 250-500ml during my long runs if they're exceeding 5-8k, so I've hopefully got that covered!\n\nI'm due to be running my first HM in April and now that I'm nearing the end of my training plan, I'd like to learn more which could help me get across that finish line just a little quicker and less fatigued. \n\nQuestion (tl:dr)\nIs there anything inherently wrong with taking these supplements? Would i potentially be hindering my long term fitness if I was regularly taking these supplements instead of allowing my body to adapt?\n\nThanks in advance!\n\n",
      "author": "macanddisease",
      "created_utc": 1742303243.0,
      "score": 23,
      "num_comments": 31,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "youtube"
  ]
}