{
  "id": "twin_AidanGLC",
  "username": "AidanGLC",
  "activity_count": 2,
  "interests": [
    "race",
    "with",
    "running",
    "from",
    "this"
  ],
  "post_times": [
    1758634746.0,
    1748364964.0
  ],
  "history_sample": [
    {
      "id": "1nohnxj",
      "title": "Race Report; Canada Army Run 10k",
      "selftext": "**Race Information**\n\n* **Name:** Canada Army Run 10k\n* **Date:** September 21, 2025\n* **Distance:** 10km\n* **Location:** Ottawa, Canada\n* **Website:** [https://armyrun.ca/](https://armyrun.ca/)\n* **Time:** 44:3x\n\n**Goals**\n\n||\n||\n|**Goal**|**Description**|**Completed?**|\n|A|Run a good race|*Yes*|\n|B|Don't fall apart in the penultimate km|*Yes*|\n|C|Have good legs (mid-45)|*Yes*|\n|D|Have great legs (low-45)|*Yes*|\n\n \n\n**Splits**\n\n||\n||\n|**Kilometer**|**Time**|\n|1|4:17|\n|2|4:27|\n|3|4:25|\n|4|4:21|\n|5|4:29|\n|6|4:30|\n|7|4:26|\n|8|4:29|\n|9|4:32|\n|10|4:3x|\n\n \n\nOn the last day of summer, I ran the Canada Army Run 10k in Ottawa. Meant as a rust-buster and gauge of where my legs are at, things went way better than expected and left me with lots to reflect on as I begin to map out the next year of fitness.\n\n**Training**\n\nI went into this race with fairly minimal expectations, in part because I haven’t done any run-specific training since the spring. I was physically and mentally wiped after the Ottawa Half-Marathon in May and needed a break from intense running work. I pivoted to cycling for most of the summer, with running mainly serving as cross-training – easy runs only (with the occasional long easy run thrown in). From May to September, my weekly volume was anywhere from 6km to 25km – all of it easy – with bike volume ranging from 140km/week to 280km/week. I did one quality session last weekend (6x1km threshold) to get the legs used to fast running again.\n\n**The Course**\n\nCanada Army Run starts at the usual Ottawa race starting blocks (on Laurier between City Hall and Confederation Park) and ends at the National War Memorial at the intersection of Elgin and Wellington about a block east of Parliament. I last ran the Army Run in 2022 (a then-PB of 46:4x) and this year’s course was broadly similar: the [10k course](https://www.racepoint.ca/maps/armyrun.html) goes out-and-back on Wellington, then down Sussex Dr. before circling back at the grounds of Rideau Hall and heading back downtown. It’s similar to the back half of this past spring’s Half course. On Sunday, the first 5k were a net downhill and the back 5k a net uphill.\n\nGiven the lack of run-specific training since May, this was a tough one to figure out how to pace. My bike legs felt *really* good through the summer, but I was somewhat unsure of how that would translate to running. Based on the 1km threshold repeats a week ago, I settled on a plan to go out at 4:33-4:35/km and then make pacing decisions in the back half based on how the legs felt. On Saturday, I decided to be a little bolder: stick with the 45:00 pacers until I got dropped, then go from there. I went in with little to no pressure, but with an informal yardstick that I’d be pleased with anything faster than 45:30.\n\n**Race**\n\nWoke up at 6am, ate pre-race breakfast, and took the LRT to my office (which is just across from the start area) to change and drop my bag at my desk. The 5k was running past me as I exited the building shortly after 8. Did around 3km of warmup with a few race pace pickups, then found my way to the first race corral with the 45min pacers. The weather was perfect: +8 at the startline with enough of a breeze to cool you off, but not enough to feel like you were fighting crosswinds.\n\nThings were delayed a few minutes from the planned 8:45 start, but the starting howitzer (not a typo) went off for the first corral a little before 8:50. We got up to speed quickly and set to work with a pace group of around 30 runners. The opening km of the 5k and 10k are always a little frantic as folks try to escape crowding, and we split it a bit faster than intended (4:17). Got into a really good rhythm in the section up and down Wellington, then kept it going through the descent towards the Chateau Laurier and the National Gallery on Sussex (4:27/4:25/4:21/4:29 for the next 4k). Things were feeling solid at the halfway split (22:10) – way better than I’d expected. We slowed a little in the false flats through and around the Rideau Hall grounds (4:30/4:26) and back onto Sussex to head to the finishing stretch (4:29). The road turned north to head back to downtown, and we found ourselves running smack into a headwind. The group had been steadily whittling down since Rideau Hall; when we hit the headwind, it quickly disintegrated.\n\nIn past 10k races, I’ve had a bad habit of cracking in the penultimate km; even when I’ve been able to dial it back in for the final km, it’s reliably been my slowest split – by a healthy margin - in the last three 10ks I’ve run. Between the late race fatigue, the false flat, and the headwind, I was rapidly running out of matches and could see runners dropping from the group around me. I kept waiting for the crack to happen, and…it didn’t. Split that km 4:32 – the slowest of the race so far, but not aggressively so.\n\nThe final boss of this race is a brute: From Sussex, the race turns back onto Wellington and ascends a 250m kicker to the finish at the war memorial. It’s a 5% gradient from the turn until about 10m before the finish line. I’ve done the Army Run twice before this one (one 5k and one 10k) and have watched countless runners completely fall apart on that finishing hill. The pacer nearest me called out “get ready to hurt!” as we made the turn, and hurt it did. A productive summer of getting my legs ripped off on grouprides came in handy: if there’s one thing I know how to do, it’s smash out a 45-second effort deep into the red after a long period at threshold. I very nearly puked with about 40m to go but managed to keep it together and cross the line. Chip clocked in at 44:3x: my third sub-45, my second-fastest 10k ever, and only 12s short of my PB.\n\n**Post-race**\n\nI was *vibrating* as I walked through the finishing area to grab my medal, electrolytes, and post-race snack. If you’d asked me pre-race what a “great race” would look like, I’d have said somewhere in the 45:00-45:15 range. I’d planned to stay with the 45min pacer until they dropped me; instead, I crossed the line one second ahead of them. After spending the summer not focused on running, having mid-44 in the legs was not on my radar *at all*. It was also the smoothest race I’ve ever run: no ninth km blowup, no feed zone mishaps, no aggressively positive splits (22:10 and 22:2x). The thought that kept coming into my head the rest of the day was “oh, so that’s what it feels like when you finally put it all together”. I’m still riding the post-race high.\n\nIt also has me thinking about the future and perhaps needing to adjust some of my near-term running goals. The tentative plan for 2026 is to prioritize the 10k distance for the spring (and use that block to test whether I have the durability to survive a plan that peaks in the 60-70km/week range) before taking another swing at 1:40 at the Toronto Waterfront Half in the fall. A week ago, I’d planned to set sub-44 as a 10k goal for the spring, but if I’m at the point where I can knock out a mid-44 on low + easy running volume and bike training alone, I think I need to reassess what an ambitious-yet-realistic goal looks like. I also need to reflect on how I mentally approach goal races: I felt *way* less stressed going into this race, and I think the lack of internal pressure helped me run a smoother, better, faster race.\n\nMade with a new [race report generator](http://sfdavis.com/racereports/) created by u/herumph.\n\n ",
      "author": "AidanGLC",
      "created_utc": 1758634746.0,
      "score": 39,
      "num_comments": 10,
      "subreddit": "running"
    },
    {
      "id": "1kwsf5f",
      "title": "Race Report: 2025 Ottawa Half-Marathon",
      "selftext": "**Race Information**\n\n* **Name:** Ottawa Half-Marathon\n* **Date:** May 25, 2025\n* **Distance:** 13.1 miles\n* **Location:** Ottawa, Canada\n* **Website:** [https://www.runottawa.ca/races-and-events/half-marathon/](https://www.runottawa.ca/races-and-events/half-marathon/)\n* **Time:** 1:43:2x\n\n**Goals**\n\n|Goal|Description|Completed?|\n|:-|:-|:-|\n|A|Enjoy the Process|*Yes*|\n|B|Finish the Race|*Yes*|\n|C|Sub-1:40|*No*|\n\n**Splits**\n\n|Kilometer|Time|\n|:-|:-|\n|1|4:37|\n|2|4:37|\n|3|4:44|\n|4|4:42|\n|5|4:43|\n|6|4:48|\n|7|4:47|\n|8|4:47|\n|9|4:35|\n|10|4:47|\n|11|4:41|\n|12|4:42|\n|13|4:47|\n|14|4:47|\n|15|5:00|\n|16|4:36|\n|17|5:13|\n|18|5:04|\n|19|5:31|\n|20|5:21|\n|21|5:16|\n|0.1|0:30|\n\n# Background\n\nI (33M) started road cycling in 2014 and running in 2018. While the former remains my primary sport, my running has steadily increased since my first 5k in 2019 (Ottawa Race Weekend, 24:41). From 2019-24, I ran six 5ks (PB 21:29) and three 10ks (PB 44:46), plus one 10k DNS after getting COVID a week before 2022 Ottawa Race Weekend. For spring 2025, I set my sights on running my first half-marathon and doing so at a pace that was in-line with my 2024 5k and 10k results (sub-1:40).\n\n# Training\n\nFor my inaugural crack at the distance, I went back and forth between Higdon’s Intermediate 2 plan and Pfitz 12/55 before ultimately deciding that the latter was a touch too aggressive for where my running volume was at. At the same time, I wanted a Half plan that also incorporated some amount of speedwork. Both for scheduling and load management, I made a couple of consistent changes to the plan:\n\n* Thursday’s easy run (which is always 4.8km in the base plan) consistently became cross-training on the bike (indoor trainer until early April, outdoor rides thereafter), both to limit injury risk and also allow me to pile on more aerobic work. At the peak of my cycling block in spring 2023, I was averaging 350km/week, so I knew from experience that I could ramp up bike volume and intensity considerably faster than running. For easy aerobic work, I also just vastly prefer riding to running. The order of the T/R workouts in the plan was also flexible depending on my schedule and Ottawa’s incredibly fickle March/April weather.\n* To gain back some of the lost running mileage from the switch, every long run was 1km longer than the plan called for.\n* Monday’s cross-training sometimes became a second rest day, depending on how my legs were feeling.\n* Instead of a week 6 10k and week 9 15k, I ran the St. Lawrence 10k as a tuneup race on April 26 (Week 8). I juggled the schedule to accommodate the switch, and added a long, hilly ride in Week 9 to have something of a de-loading week afterwards.\n\nThe training block generally went really well. I ran a 21:11 PB in the 5k TT in horrible conditions (flurries and crosswinds), then ran a 44:25 in the St. Lawrence 10k (good for Top 20 and 21s off my PB). The training block also benefitted from good sleep habits (averaging almost 8.5hrs/night since February), no major travel, and drastically cutting down on weekday alcohol consumption. That allowed for the most consistent block I've ever managed: I missed one run the entire block, putting down 390km of running and 640km of biking between March 1 and May 24, peaking at 47.5km of running in Week 10. Began tapering 10-11 days out from the race, and was feeling relatively good throughout (usual Taper Scaries notwithstanding).\n\nI live near the route, and my office is \\~100 meters from the startline. This also meant I was able to recon every part of the course multiple times, including a 20.5km LR in week 10 that was essentially a dress rehearsal of the race. Between past Ottawa Race Weekends and runs on in-office days, I’ve run the finishing 2-3km north of thirty times.\n\nThe Higdon Intermediate 2 plan was fine, though with some things I liked and some things I didn’t like:\n\n* The plan was simple, which made planning individual weeks and runs very easy (and also lent itself to plug-and-play with cross-training on the bike and to needed schedule adjustments to reflect when my tuneup races were) BUT not particularly periodized or as distance-focused as a Pfitzinger or Hanson plan.\n* The back-to-back pace and long runs on weekends were a great confidence builder for race day, BUT meant that weekly mileage was incredibly back-loaded. I consistently had plans to add cross-training on Mondays and my legs frequently went “nah” the morning of due to accumulated fatigue from the Sat/Sun runs.\n* The plan started gently compared to my weekly mileage during base-building, BUT I also feel like there wouldn’t be a ton of time gains to be had from prepping another Half with this training plan.\n\nIn sum, I generally agree with the sub’s consistent feedback on Higdon plans: it was a great plan for my first crack at the distance, and particularly as someone who has struggled with ramping up running mileage too quickly in the past, but it's not a plan I'll be using again.\n\n# The Race\n\nCarb-loaded Saturday night at my wife and mine’s favourite Italian restaurant, strolled three blocks to watch some of the 10k – including both ME and WE elite – then got as much sleep as adrenaline would allow. Woke up at 6am Sunday, showered, ate my ritual pre-race breakfast (a breakfast sandwich from Kettleman’s Bagels – an Ottawa institution) then took the LRT downtown. Used my office’s locker room to change and for bag storage, did an easy 2k to warm up with a few race pace pickups, and then wolfed down an energy bar about 25min prior to the start.. I raced this Half in Nike Vaporfly 3s, which I'd also used for my 10k tuneup in April.\n\nCompared to past Ottawa race weekends, conditions were fantastic Sunday morning: partly cloudly, lightly breezy, and 11C when the Half started. I slotted into the first time corral (1:45 or faster), found the 1:40 pacers, and waited for the gun to go. The plan was to stick with the pacers until 15-16kms, then make a judgment call about whether I enough left in the legs to push the pace once the course was through the final hill on Sussex Dr.\n\n**Part 1: Vibing (Start - 12km)**\n\nThe Half started at 9am on the dot. In previous Race Weekends running the 5k or 10k, it's been a knife fight to escape crowding in the opening km of people who've insisted on being at the front despite not running \"at the front\" times, but this was not the case this year. Our group was up to speed by the time the race turned onto Wellington St. in front of Parliament Hill. Settled into a rhythm very quickly and began knocking out kms at race pace (or close to it) as the race wound into Gatineau. Sticking with the pace group made the first half incredibly straightforward from a mental standpoint - didn't really have to think about pace, just stuck with the group and knocked out steady kms. My wife and two friends of ours were in the cheer zones at the 2km mark (just before crossing the Booth St. bridge into Gatineau) and then again at around 10kms in when the race crossed back into Ottawa near the National Gallery. The crowds were *electric* \\- this is the best weather that Ottawa Race Weekend has had since probably 2019, and the city showed up accordingly.\n\nThe back half of the course was rolly, so we pushed the pace in the opening half. My watch had me running a little ahead of the splits I was targetting - 18:41 through 4km, 37:48 through 8km, 56:36 through 12kms. I also stuck to my fueling plan, taking in gels at 25min and 50min and using my disposable bottle of electrolyte mix until I discarded it at the 9km aid station.\n\n**Part 2: Hurting (12km - 16.5km)**\n\nWith hindsight, the blisters on the arches of both feet probably developed in the 9-10km stretch, but they became impossible to ignore at around 12kms as the Half course headed along Sussex into the Rockliffe Park area. Almost immediately, it became clear that the one on my right foot was both larger and worse than the one on the left foot.\n\nStill, pushing through discomfort is part of the gig - both my tuneup races were run in bad weather, in 2023 I rode [the first day of Rideau Lakes](https://ridewithgps.com/routes/49335537) through a biblical rainstorm (and then rode [the second day](https://ridewithgps.com/routes/49444378) with all of the accompanying chafing and contact point pain). So for the next 4-4.5kms, I just dialed in and kept at goal pace through the rollers on the GEC Parkway. This year's course ran through the grounds of Rideau Hall (for non-Canadians, the residence of the Governor General, our stand-in Head of State on the 363-5 days of the year when the King isn't in town), which was an unbelievably cool moment. I struggled with the overpass on Sussex drive, but was somehow still hustling despite the steadily-worsening pain in my right foot. I split 1:15:39 through 16kms - almost exactly on sub-1:40 pace.\n\n**Part 3: Surviving (16.5km - Finish)**\n\nDespite holding onto goal pace through the first ten miles, by this point I knew I was running on borrowed time: the temperature was rising, and my fuel gauge was steadily falling as the pain gauge steadily increased. At around 16.5kms, the lines crossed one another and the wheels began to come off. The pain from the blister was excruciating - basically every step felt like jabbing a knife into the underside of my right foot. The left foot was in better shape, but not by much. From then onwards, my pace slowed considerably, and I was promptly dropped by the 1:40 pace group (which by this point had maybe 10-12 people left in it).\n\nHad this been another race, I'd have likely stepped off the course at this point and DNF'd to avoid inflicting even more damage on my foot. But this was both my goal race for the spring calendar and my first time racing a Half, so there was no way that was happening. Faced with coming back with my shield or on it, I opted for both.\n\nThe last 4.6kms of the race were mostly a fight for survival. I'd run as close to goal pace as I could for as long as the pain would allow, then walk for 10-15s, then repeat. By this point, my racing shirt was also soaked from both sweat and water I'd poured over myself when going through aid stations, and I was chafing to the point of drawing blood. Those final few kms along the Rideau Canal felt eternal - no matter how many times I've run them in training (and I've run them a lot) they're always a miserable slog come race day. However, they were buoyed by the crowds, which by this point in the race were absolute pandemonium. My ears were ringing the entire finishing stretch.\n\nI bled time through the final 5kms, but generally kept on running as fast as I was able for as long as I was able, before emptying the tank in the final 100m. I ultimately crossed the line in 1:43:2x.\n\n# Post-Race Thoughts\n\nI was *shattered* at the finish line, and slowly made my way through the finishing chute and back into the mingling area at Confederation Park. My wife was waiting for me, and after the embrace she took one look at me - limping, covered in sweat, bleeding from both nips - and simply said \"you look...unwell.\" I briefly chatted with a couple friends who were running either the Half or the Full on similar schedules, picked up my bag from my office (a hack that I will be repeating as long as I work in that building - saved me probably 20-30min in a bag line), then headed home and did after-care on the blisters. Somehow, the right arch blister didn't pop on the course, but I'm pretty sure I'm going to lose two toenails (one on each foot) from the race as well. Woke up Monday morning feeling (physically) like I'd been hit by a bus, but also still riding the emotional high of having finished my first Half-Marathon.\n\nI ended up short of my goal, but I can't be too disappointed with my time given what transpired on the course. I have a session with my physio (who's enough of a running geek that it's like having a coach that my insurance pays for) later this week to chat through what happened, but I strongly suspect the fault lies with the narrowness of the Vaporflys' midfoot/arch area combined with my own very flat arches. It was also a good reminder that **nothing** is guaranteed on race day: you can put in a great training block, taper well, have a good racing and fueling plan, and sometimes things go wrong anyways because racing, if done well, involves putting your body right up against the limit of what it can do (and sometimes pushing a little beyond it).\n\nI also know what I'll be looking for in a future training block: now that I know my body can handle higher mileage without breaking down, I'll be looking to add volume next time I prep for a Half - either Pfitz 12/55 or one of the Hanson plans (probably the former, as I quite liked the 4 days running, 1-2 days biking schedule of this past spring) - and a plan that adds race pace to the end of long runs. Without the blister, I think I could've plausibly finished in the high-1:41/low-1:42 range, but I will need to add more miles at race pace on already-fatigued legs to get through those brutally hard final 5km and under 1:40.\n\nAs for the near future, this marks the end of my spring running season. After recovering for the next couple weeks - including vacation in Spain - I'll be pivoting to road cycling for the summer, with running primarily serving a recovery and cross-training role. Physically and mentally, I need a break from high running volume and race prep. The current plan is to run a 10k or two in the Fall, and then prep to take another swing at a sub-1:40 Half in 2026 (current thinking is Ottawa or/and Toronto Waterfront, but I'm still in the very early stages of planning this). This was my first half-marathon, but it absolutely won't be my last.\n\nMade with a new [race report generator](http://sfdavis.com/racereports/) created by u/herumph.",
      "author": "AidanGLC",
      "created_utc": 1748364964.0,
      "score": 48,
      "num_comments": 22,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.98,
  "channels": [
    "youtube"
  ]
}