{
  "id": "twin_pointofannihilation",
  "username": "pointofannihilation",
  "activity_count": 1,
  "interests": [
    "race",
    "with",
    "that",
    "about",
    "could"
  ],
  "post_times": [
    1752457937.0
  ],
  "history_sample": [
    {
      "id": "1lza4mg",
      "title": "Run Melbourne HM - Race Report",
      "selftext": "### Race Information\n* **Name:** Run Melbourne Half Marathon\n* **Date:** 13th July 2025\n* **Distance:** 21.1 km (20.82 on watch)\n* **Location:** Melbourne, Australia\n* **Time:** 1:37:37\n\n### Goals\n| Goal | Description | Completed? |\n|------|-------------|------------|\n| A | Sub 1:40 | *Yes* |\n\n### Splits\n| Kilometer | Time |\n|------|------|\n| 1 | 4:37\n| 2 | 4:36\n| 3 | 4:35\n| 4 | 4:36\n| 5 | 4:42\n| 6 | 4:46\n| 7 | 4:36\n| 8 | 4:39\n| 9 | 4:49\n| 10 | 4:35\n| 11 | 4:40\n| 12 | 4:39\n| 13 | 4:46\n| 14 | 4:50\n| 15 | 4:38\n| 16 | 4:53\n| 17 | 4:42\n| 18 | 4:30\n| 19 | 4:39\n| 20 | 4:43\n| 21 | 4:47\n\nI came 37th in my category (age 20-24 F), average pace 4:37, with a time of 1:37:37!\n\n### Training\nI'm pretty new to running, so it was a hell of a learning journey for me. I still have a workout preset saved on my watch called 'Tempo 1' consisting of x5 1 km (I thought anything over 800m was too long to count as an interval). I was anxious about never having done any serious training or anything close to a half-mara distance before, so I trained for about 20 weeks all up (albeit starting at a pretty low intensity/mileage of 20-30 km per week for the first half of training).\n\nGoals-wise, I had initially just set out to finish somewhere within 1:46-1:55 when I signed up for the race in January, but as with training going well I decided to push harder for sub 1:45. After a particularly good track session about 8 weeks out, I was feeling competitive and cranked it to 1:40, although I didn't actually think I could do it once the cockiness wore off a few days later. But I decided to stick to it anyway because 'aim for the moon and you'll land among the stars'.\n\nOver time, I developed a 4-run weekly split which normally looked like the following:\n\nTuesday: 7-10k either tempo or easy\n\nThursday: a track session - either I'd do a progression run (if I'd done an easy run on Tuesday) or intervals (8x400, 4x100, or 6x1k) with a long warm up/cool down. This would usually total 10-13k in distance.\n\nSaturday: fast parkrun, followed by another easy 5k\n\nSunday: long run of 10-16k typically, with the longest being 18.5k\n\nI peaked at 51 km 5 weeks prior to the race, but kept running 45+ km for another 2 weeks before tapering.\n\nMy final run before the taper was a particularly fast 12k progression run one Saturday after a Friday night out, which resulted in me straining my left achilles (which still hasn't gone away completely). I felt the niggle as I was walking home, not thinking much of it - I actually thought it was a surface wound and I'd just nicked the skin from walking too far in heels the night before.\n\nWent out again for my usual Tuesday and Thursday runs (both short and easy, about 5k at 5:30/km pace for my taper) and it wasn't going away. I was scared out of my wits since I'd heard for years that there was no running injury more vindictive than an achilles. But I could still walk, it wasn't hurting enough to stop me from running completely, and I had faith.\n\nI began fanatically researching, icing, and eccentric heel-dropping with only one week to go. Bought KT tape, kept stretching and resting, only ran easy, about 16 kms in the final week before the race on Sunday. I'd developed a habit of going to parkrun every week, so I went as usual for my shakeout to help settle my nerves. It felt good, the air was nice, the achilles felt ok, and I was feeling at least sort of confident for the race again.\n\n### Pre-race\nI got out of bed at about 3:30 am after a night of tossing and turning. The night had been a cycle of reading race reports on this sub and then drifting off phone in hand, only to start awake after 20 mins, convinced that I was already late. But race day adrenaline REALLY is something else. My heart was pounding through to my skull already, and I was ready to jump 6 feet into the air at the slightest sound outside on the street, even despite getting barely any rest.\n\nI made and ate my breakfast of oatmeal and frozen raspberries with peanut butter and honey. Drank my coffee, which did what I needed it to do after some squats and lunges. Full makeup and braided my hair - got to be prepared in case those race photos were going to be my last.\n\nMy parents took me (dad drove and mum came with me to the start line), about a 30 min drive. The whole way there I sat in the back like a little kid, rocking back and forth in my seat, shaking quietly and questioning why I thought this was a good idea.\n\nGot there at about 6 am for a 6:40 start in the B wave. I (very stupidly) thought that 30 mins before the race start would be enough for a bathroom trip since the toilets were close by - it definitely wasn't and I could see the lines bending around the portables. Seeking alternative solutions, I set off circling the area for bushes to pretty much no avail - there was a bit of shrubbery in a patch of mud but I didn't want to ruin my white shoes and risk slipping in the mud with my shorts around my ankles.\n\nDecided to just hold it - I wasn't busting desparately anyway, and it might've just been me starting to overthink every small twinge in my state of pre-race panic. Taped up my ankle, tied my ribbons into my hair, chugged the rest of my Gatorade (yes despite my bladder concerns minutes earlier), and made my way into the corral.\n\n### Race\nTypical rookie move of starting out FAST. My goal pace was 4:46/km (or a few seconds under) to finish in 1:40, and setting off I felt pretty steadied and was shuffling along with the crowd at what I thought was a fairly conservative speed. Glanced down at my watch about 1 km in and I'd gone through it in 4:36.\n\nI was surprised and I also wasn't given the adrenaline wave I'd barely been bridling, but I was anxious that only 5% into the race I might already be heading towards a crash and burn. But it was race day and I couldn't have stomached holding back and leaving anything on the table - what if I could push through? I decided I'd hold steady for the time being and just dial back if I started feeling it too early.\n\nThe first 10k felt amazing, the course was scenic, and there was a beautiful sunrise coming up as we ran by the water (a very nice change from the neverending laps around the same two concrete circuits and red 400m that made up most of my training). It wasn't overly busy just yet and I could see quite far ahead, which made it easy to run the tangents and I was cruising through the almost totally flat paths thus far. I went through the 10k mark at 46:12. Started thinking, maybe I really can do this.\n\nStopped (well, still half-running because I was terrified of slowing down) at the aid station 12k in. My steps threw half of my cup of water in my face, so I probably gulped a quarter of it and wore the rest. I was still feeling all right, not fully suffering yet, but my heart rate was rising from the steady low 150s to the high 150s and entering the 160s. By this point, I was halfway and starting to think about the end - the first half was good primarily because I didn't let myself acknowledge the distance left (I don't think I could've held pace if I'd told myself at 4k that I'd have to do this for another 17). 9 km left was at least in the single digits, a lot less threatening. But my legs were starting to ache, blisters were coming in, and I had now reached the roll of the first hill.\n\nThe strait of 12k to 16k, it was like all the runners were surfing a massive 4 km long wave. The uphills were difficult in either length or incline, but not both, and there was still plenty of relief in the downhill we were rewarded with for every climb. I think I made a lot of my race in the first 10k and also in this section, as I kept a pretty straight path and used gravity to fly down the hills (slow cadence, long strides, low arms) while I slowed to save energy on the ascents. Actually, this was pretty much the theme of the rest of the race as the hills got steeper, which you can see from my splits in the last half. Funnily enough, I finished with 4 back-to-back 23-minute 5ks - exactly 4:37/km pace in each segment. It evened out I guess!\n\nThe push through 17, 18, 19k, fighting demons. That one climb at 17k was UNRELENTING (Anderson St Hill - straight from hell). You could feel the evil force of gravity trying to drag us all backwards and tumble us on heavy legs that didn't have much left to resist with. In my photos you can see me leaning forwards almost clawing my way up, I felt like somehow I could pull myself upwards by the arms to the crest.\n\nWhat got me through this was my mum finding me just at the relief of that ascent as I passed the 18k mark. Once I saw her, I yelled, waved, I felt a sudden rush and picked up the pace, and went for the full send. 3 km left, it was go time - I was gritting my teeth and ramping up for the last push to empty the tank.\n\nAs I hit 20k, I looked at my watch again and it said 1:32:something. That left me with over 7 minutes to run the last 1.1 km, which I knew I could do even on my worst days. I wish I hadn't looked, because I was in pain by this point and I might've been able to push harder if I hadn't had that confidence that I would reach my goal. But I crossed the finish smiling wide and happy that I'd made it. (Before doubling over in direct line of finishing photography.)\n\n### Post-race\nMy mum was there to catch me at the finish line and she told me my result - she held my phone during the race and the preliminary result had already come through. Almost 3 whole minutes ahead of my target!!! Now I'm not usually the most physically expressive person ever, but there I was jumping for joy, whooping, arms in the air, feeling like I'd just conquered the world.\n\nWe walked back towards Flinders after, coffee and cake at Brunetti, the best cheesecake I've ever tasted. Grill'd for lunch too, I was almost expecting not to have much of an appetite but I ate like no tomorrow. We talked about the race, went through all the photos, laughing at the race shots (glad I lived to tell the tale because those photos could CERTAINLY not be my last). I'm so beyond grateful to my mum and I could never had made it without knowing she was cheering me the whole way.\n\nAfter getting home: ate, bath, bed, movie, 8 hr sleep. EXCRUCIATING DOMS.\nI'm walking, but it will be more of a hobble for probably at least the next couple days.",
      "author": "pointofannihilation",
      "created_utc": 1752457937.0,
      "score": 60,
      "num_comments": 20,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "instagram",
    "youtube"
  ]
}