{
  "id": "twin_KeyResponsibility577",
  "username": "KeyResponsibility577",
  "activity_count": 1,
  "interests": [
    "race",
    "miles",
    "training",
    "with",
    "mile"
  ],
  "post_times": [
    1742223865.0
  ],
  "history_sample": [
    {
      "id": "1jdes6y",
      "title": "First Marathon (Los Angeles)",
      "selftext": "Race Information\n\nName: 2025 Los Angeles Marathon slow runner edition\n\nDate: March 16, 2025\n\nDistance: 26.2 miles\n\nLocation: Los Angeles, CA\n\nWebsite: https://www.mccourtfoundation.org/event/los-angeles-marathon/\n\nStrava: https://strava.app.link/Yizw5nqpORb\n\nTime: 5:39:41\n\nGoals\n\nGoal Description                                       Completed?\nFinish\t before the first cutoff (6:30)       Yes\r   \nNegative Split.                                           Yes \n\n\n\nSplits\r  \n\r  \n1\t14:25 \n\n2\t12:12\n\n3\t12:12\r  \n\n4\t13:09  \n\n5\t13:37\r  \n\n6\t14:12\n\n7\t13:13\r  \n\n8  12:54\r  \n\n9\t13:54\r  \n\n10\t13:33\n\n11\t14:03\n\n12\t14:30\n\r\n13\t12:54\r  \n\n14\t12:57\r  \n\n15\t11:25  \n\n16\t12:05\r  \n\n17\t12:52\n\n18\t12:12  \n\n19\t11:55\r \n \n20\t17:46 \n\n21\t12:39  \n\n22\t13:17 \n\n23\t13:01\n\n24\t11:22\r  \n\n25\t11:05\r  \n\n26\t10:21 \n\n26.3 11:40  \n\r  \nBackground:\n\nI’m a 28-year-old woman, 5’2” and 125 lbs. I’ve been consistently weightlifting for the past 3.5 years, focusing on strength training and muscle development. While I’ve always enjoyed lifting, I never really liked cardio and avoided it for the most part.\n\nIn June 2024, I decided to give running a try but only ran once or twice a month, never going beyond 3 miles at a time. Running felt like more of a challenge than something I enjoyed, so I wasn’t consistent with it. However, in November 2024, I joined a run club to push myself and be part of a supportive community. We started a structured 20-week training program to train for the Rose Bowl Half and LAM.\n\nSince then, I’ve been working on gradually increasing my mileage, improving my pace, and learning how to balance running with my strength training routine. My goal is to become a stronger, more efficient runner while maintaining my muscle and overall fitness.\n\n\r  \nTraining:\n\nWhen I first joined my run club and started training, my plan was simple: train for the Rose Bowl Half Marathon first and see how I felt before even considering a full marathon. As an inexperienced runner, the thought of running 26.2 miles felt impossible. A half marathon already seemed like a massive undertaking, so I didn’t even entertain the idea of signing up for the full race.\n\nInjury Setback: IT Band Syndrome\n\nAround six weeks into training, I started dealing with a pretty bad IT band injury. Looking back, it was a combination of factors:\n\nPushing my pace too much instead of focusing on building endurance\n\nImbalanced muscle strength, where my hip flexors were weak compared to my quads, glutes, and hamstrings\n\nLack of mobility and stabilization work, which put extra strain on my knees\n\nThe pain made it nearly impossible to run without discomfort, and I knew I had to take a few weeks off to avoid making it worse.\n\nWildfires & Delayed Training\n\nJust as I was hoping to get back on track, wildfires in January forced another training delay. The air quality was terrible, and it wasn’t safe to run outdoors. On top of that, the Rose Bowl Half Marathon got postponed, meaning my original goal race was no longer happening before the marathon.\n\nDuring this period of limited training, I started feeling FOMO as I watched other girls in my run club ramp up their mileage for the full marathon. The idea of running 26.2 miles, which had once felt so intimidating, now seemed like something I might actually be able to attempt—if I could get my injury under control.\n\nPhysical Therapy & Progress\n\nTo address my IT band issues, I started going to physical therapy, focusing on:\n\nStrengthening my hip flexors and glutes\n\nStability exercises to improve my knee alignment\n\nTargeted mobility work to relieve tightness in my IT band\n\nEach week, I saw small but significant progress. The pain didn’t disappear overnight, but I could run a little longer each time before discomfort set in.\n\nThe Decision to Run the Full Marathon\n\nBy this point, I knew that I wouldn’t be able to fully catch up in my training plan, but I still decided to sign up for the marathon before it sold out. The idea of finishing my first marathon—even if it wouldn’t be perfect—was too tempting to pass up.\n\nI did my best to increase my mileage gradually, balancing injury prevention with pushing myself just enough to be prepared. I knew I wasn’t going to have the ideal training cycle, but I reminded myself that some training was always better than none—and if people could finish marathons with zero training, I at least had a shot.\n\nTraining Stats & Race Shoes\n\nLongest run: 13.1 miles @ 12:45 pace\n\nTotal training mileage: ~200 miles\n\nPeak weekly mileage: 21 miles\n\nAverage pace for shorter runs: 10:31\n\nI trained in my Saucony Endorphin Speed 4s, and they felt great for most of the cycle. But towards the end, I started getting arch pain, which made me nervous. By the time I noticed the issue, it was too late to switch anything—so I just had to hope that race day adrenaline would carry me through.\n\nI went into the marathon nervous but determined. I knew my training hadn’t been ideal, but I also knew I had put in enough effort to at least give myself a chance to cross that finish line.\n\nRace Week: Tapering, Carb Loading, and Recovery\n\nSeven days before race day, I began my taper, significantly reducing my mileage and intensity to allow my body to recover fully. My focus shifted toward maximizing recovery, ensuring I was well-rested and primed for race day.\n\nThree days before the race, I ramped up my carbohydrate intake, aiming for at least 400g+ of carbs per day to ensure my glycogen stores were fully replenished. I prioritized easy-to-digest, high-carb foods like rice, pasta, bread, and fruit while keeping my protein and fat intake moderate to avoid feeling sluggish.\n\nTwo days before the race, I started increasing my electrolyte intake, making sure I was well-hydrated and that my sodium, potassium, and magnesium levels were optimized.\n\nI dedicated the entire race week to recovery and mobility work, focusing on compression boots, myofascial release, and light stretching to keep my legs fresh. I also took a couple of yoga classes to promote relaxation and mobility while ensuring I wasn’t doing anything too strenuous \n\nShakeout Run: LA 5K Experience\n\nThe day before the marathon, I participated in the LA 5K as my shakeout run, keeping it at a light jog/walk pace to avoid unnecessary fatigue. This was less about performance and more about getting my body moving, easing any pre-race nerves, and soaking in the race-day atmosphere. The energy of the event was incredible, and being surrounded by other runners added to the excitement. Plus, the bonus medal was a nice incentive!\n\nNight Before the Race\n\nI made sure to eat my final meal by 6 PM, keeping it simple, carb-heavy, and easy to digest—something I knew wouldn’t upset my stomach. After dinner, I got into bed by 7 PM, knowing I needed as much rest as possible.\n\nAt 12 AM, I woke up, partially from excitement and partially because I needed to use the restroom. My alarm was originally set for 1 AM, but since I was already awake, I just laid in bed, trying to relax and focus on my breath, even though I couldn't fully fall back asleep.\n\nRace Morning: Early Start & Shuttle to Dodger Stadium\n\nAt 4 AM, I left the house, making the drive from the SFV to Century City, where I had pre-planned parking.The drive over is typically about 25 minutes, on race morning the traffic wasn't too bad around that time, the most difficult thing was navigating the road closures. By 4:50 AM, I was parked and got in line for the shuttles, the lines were long but moved quickly and by 5:15 AM, I was on the shuttle, heading toward Dodger Stadium.\n\nThe shuttle ride was smooth, and getting into the stadium was effortless. As soon as I arrived, I checked my bag at the gear check station made a final stop at the restroom, and then met up with my run club. If I was a first timer again I would better familiarize myself with a map of the stadium as to not waste my time running around the entire place looking for things. Also, use the restrooms inside the stadium to avoid the long porta potty lines, they're also very clean!\n\n\r\nRace Day: \n\nRace Start – 7:00 AM\n\nMiles 1-13: Finding My Rhythm \n\nFrom the beginning, I focused on keeping my pace controlled, aiming to stay within 12:00-13:00 per mile to conserve energy for the second half. The adrenaline of race day made it tempting to go faster, but I kept reminding myself of the bigger goal—finishing strong before 6:30.\n\nHills Strategy: Any time I hit steep inclines, I speed-walked or slow-jogged to avoid exerting too much energy. I took advantage of downhills to gain back time, letting gravity carry me while keeping my effort level steady. Miles 4-6 are the steepest of the hills, thankfully I knew what to expect as I had run a preview route of the race a few weeks prior.\n\nHydration & Nutrition: I drank from every single aid station, ensuring I stayed hydrated, I alternated between water and electrolytes at each. I had been trying to avoid a bathroom stop, but by mile 12, I knew I couldn’t hold it any longer. The lines at each restroom were so long I knew if I stopped at those I'd have a hard time getting that time back. I waited until I found restrooms with a shorter line, losing some time but ultimately feeling much better.\n\nStrava Discrepancy: Around this point, I also noticed that my Strava was measuring ahead of the official mile markers—by about a quarter mile. This was frustrating because it meant I would likely have to run farther than expected according to my watch.\n\nI reached the halfway point feeling surprisingly good, with a steady energy level. My plan was working.\n\n---\n\nMiles 13-20: The Mental & Physical Battle Begins\n\nOnce I hit mile 13, I took a moment to assess how I was feeling. Surprisingly, I still had a good amount of steady energy, though my feet were starting to ache.\n\nAt mile 17, my earbuds died. I had a backup pair waiting for me at mile 19, where my run club had a cheer zone. I was trying really hard to push myself through without music. This area is through Rodeo drive which has great scenery. Once you turn the corner though you're headed back uphill, but it's not as large of an incline as the hills in DTLA.\n\nTrying to Pick Up Pace: I attempted to speed up to 11:00-12:00 per mile, but the hills were relentless. Every time I tried to push harder, the elevation gains made it difficult. Still, I knew I wanted to make it to mile 19 with a little extra time, so I pushed through the discomfort.\n\nCheer Zone Stop (Mile 19): When I arrived, I quickly swapped out my earbuds, changed into dry socks, and freshened up with some deodorant and wipes. Unfortunately, they were out of Biofreeze, which I had really been looking forward to for my sore feet. This stop cost me about 5-6 minutes.\n\nI left the cheer zone feeling slightly refreshed but still bracing myself for what I knew would be the toughest part of the race.\n\n---\n\nMiles 20-23.1: Mental Battle\n\nThis was where things got mentally tough.\n\nThe Finish Line Tease: Around this stretch, I could see the finish line in the distance, but I still had to run past it to reach the turnaround point. Watching other runners on their way back while I still had miles to go was mentally brutal.\n\nThe Hills Were Relentless: This section of the course was almost entirely uphill. I had planned to increase my pace to 10:00-11:00 per mile, but every incline made it nearly impossible. I could feel my legs getting heavier. At this point I knew I would for sure hit my goal of sub 6:30 but because I wasn't feeling too bad and only had 6.2 miles left I changed my goal to 5:30:00 -5:40:00.\n\nIt truly seemed like the longest part of the run, waiting to hit the turnaround point. \n\nI was anticipating the wall but I never hit it, thankfully. I think that was due to me fueling properly prior to and during the race.\n\n---\n\nMiles 23.1-26.2: Pushing Through\n\nAt mile 23.1, I finally reached the turnaround point, and something inside me clicked.\n\nTunnel Vision Mode: I locked in mentally, and tuned out everything—the crowd, the pain, the time. It was just me and the road ahead.\n\nPain Disappeared: All of my pain was gone, it was probably because I took 2 ibuprofen when I stopped at mile 19. I no longer felt my sore feet or tired legs. It didn’t even feel like I had been running for over five hours. My body was just moving.\n\nCrowded Course: The biggest challenge at this point wasn’t my fatigue—it was weaving around walkers. The course had narrowed, and since I had picked up speed, I had to maneuver around large groups of people.\n\nThe Heat Factor: The sun was beating down, and there was zero shade. The heat was brutal, at every aid station I would grab 2 cups of water, one for drinking and one for pouring on myself to keep from overheating. This helped out a ton!\n\n\nThe Finish Line & Final Thoughts\n\nCrossing the finish, I was hit with a wave of emotions—relief, pride, exhaustion. I knew my training hadn’t been perfect, but I had pushed through every challenge, injury, and setback to make it to the end.\n\nI finished. And I was happy with my performance.\n\n\nPost-Race:\n\nThe moment I crossed the finish line, a wave of exhaustion, pride, and relief hit me all at once. My legs felt heavy but functional, and my body was running on pure adrenaline. I took a moment to soak it all in—I had officially completed my first marathon.\n\nGear Pickup & Finisher Photos\n\nThe first order of business was retrieving my checked gear bag. Thankfully, the process was smooth and organized, and I quickly swapped out my race shoes for a more comfortable pair of slides—my feet were aching, and the instant relief was incredible.\n\nBefore heading out, I stopped by the official finisher photo area to capture the moment. It still hadn’t fully sunk in that I had just run 26.2 miles.\n\nI still felt pretty good all things considered, I really think that was due to my pre race and negative Split strategy.\n\nBeer Garden & Post-Race Celebrations\n\nAt the engraving station, I had my medal personalized with my name and finish time. The line moved quickly, I definitely recommend waiting for it if it's something you're wanting to do.\n\nI went to the beer garden to catch up with some friends, the good thing about the race ending at the mall is that there's a ton of food options available to choose from. Also, Westfield offers special discounts to those who complete the marathon.\n\nBy this point, hunger had fully kicked in, I ordered some Din Tai Fung to go. \n\nSo far, my recovery routine has been pretty minimal:\n\nUsing my mini massage gun to loosen up my tight muscles\n\nDoing some light stretching to keep my legs from stiffening up\n\nOnce I found my car, getting out of the area wasn't too difficult. I'd say I added in about an extra 1.5 mile walk post race between the mall and finding my car.\n\nFinal Thoughts: Would I Do It Again?\n\nAbsolutely. I had so much fun running this marathon, and despite the challenges, I never once felt like I wanted to quit. If anything, I feel like I could’ve pushed myself more and increased my pace sooner—but my uphill/downhill strategy worked well, and I was able to finish strong.\n\nNow that I know what I’m capable of, I’m confident I can PR my next race. \n\n---\n\nMy advice to any beginner running the course for the first time:\n\n-Prepay for parking if you're driving yourself and know exactly where your garage is and what streets are available to get into it\n-Take the shuttle to the start from Century City, the traffic to get into Dodger Stadium was crazy, I saw people getting out and walking along the freeway.\n-Use the restrooms inside of the stadium when you get there\n-Preview run the course if you can\n-Take it slow the first 6 miles \n-Don't give into the adrenaline and other runners passing you by.\n-Fuel early and often\n-Drink from every aid station \n-They have free chili dogs at mile 6 if your stomach can handle it\n-Be mentally prepared to see the finish line on the other side when you're still at mile 19\n-If you start feeling like you're getting too hot when the sun starts to come up, pour some water on yourself, it helps a ton\n-Enjoy the race, it's really fun\n---\n\nMade with a new race report generator created by /u/herumph.",
      "author": "KeyResponsibility577",
      "created_utc": 1742223865.0,
      "score": 82,
      "num_comments": 20,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "youtube"
  ]
}