{
  "id": "twin_siliwei",
  "username": "siliwei",
  "activity_count": 1,
  "interests": [
    "that",
    "marathon",
    "race",
    "just",
    "miles"
  ],
  "post_times": [
    1750548103.0
  ],
  "history_sample": [
    {
      "id": "1lh9oqy",
      "title": "My First Marathon!!",
      "selftext": "Race Information\n\nName: Grandma’s Marathon\n\nDate: June 21st\n\nDistance: 26.2 miles\n\nLocation: Duluth, MN\n\nTime: 4:33:34\n\nGoals\n\nGoal\tDescription\tCompleted?\n\nA\tFinish\tYes\n\nB\tSub 4:10\tNo\n\nSplits\n\nMile\tTime\n\n1\t9:19\n\n2\t9:23\n\n3\t9:29\n\n4\t9:25\n\n5\t9:23\n\n6\t9:29\n\n7\t9:33\n\n8\t9:39\n\n9\t9:35\n\n10\t9:19\n\n11\t9:39\n\n12\t9:39\n\n13\t9:37\n\n14\t10:07\n\n15\t9:50\n\n16\t10:17\n\n17\t10:34\n\n18\t10:19\n\n19\t9:45\n\n20\t10:46\n\n21\t11:43\n\n22\t12:46\n\n23\t11:40\n\n24\t11:55\n\n25\t9:41\n\n26\t12:36\n\nThis marathon was SO hard but taught me SO much about finding joy when things don’t go to plan and trying to avoid an all or nothing/results orientated mindset!\n\nTraining:\nI followed the pfitz 18/55 program. I got so fixated on improving in something that I was finally passionate about, after being a hobby hopper all my life! I knew it’d be a challenge, especially for how slow I am running, but I knew my body could recover pretty well. I got lucky with the weather for the most part and felt good all throughout my training! I had to decrease the mileage on some weeks but still ran an average of 40 miles/week, never missed a day except when sick, ran 3 20 milers and my last 20 miler, i did 5 miles, then 10 miles at goal marathon pace (9:09), followed by 5 miles. I felt good! Garmin was predicting a 3:57, and I knew garmin was pretty accurate for me based on my last race. However for like the week leading up to the race, I was so nervous! I’ve never thought about myself as a nervous person before…but i was getting worse quality sleep and stomachaches. First lesson learned, I shouldn’t have had a pace goal for my first marathon!!\n\n\nPre-race\n\nI didn’t run at all the week before the marathon, just because i was kind of feeling burnt out from running, and I wanted to be extra fresh for race day! I probably would’ve ran if it wasn’t for the heat wave in the twin cities right now…\nI got 6 hours of sleep and woke up to the race being delayed 30 minutes. At this point I just wanted to survive and have fun, so I adjusted my goal time to 4:10 based on a heat-training calculator. Oh yeah…this race was hotttt! It fluctuated a lot but the last 6 miles of the race were in the low to mid 80s. \n\nRace\n\nSo one thing about me is…I’ve never done well in the heat, I almost never go a day without sweating even in the winter. So I’ve been getting up at like 5am for the past month to run, and so far I haven’t had to run in temps over 75 and most were under 60 (all the long runs were cool too). That’s just how I like it and how I will actually enjoy running, because otherwise what’s the point! I guess it’ll never be perfect though, because if I do a summer marathon then my training will be ideal, but then the marathon might be really hot and vice versa for a fall marathon. I guess a winter marathon would be ideal, but they don’t really exist in Minnesota lol. Anyway, first mile and BAM 185 heart rate at a 9:19 pace and my garmin says i’m at a -6 performance readiness and I’m drenched in sweat. I also have to pee bc i’ve been downing water at the start line and the lines for the portas were so long, so I only got to go like an hour before the race started. It also just feels…weird to be running but I figured I was just warming up.\n9:30 pace was feeling comfortably hard, despite my HR averaging in the high 180s (max is around 202). Lesson 2, I just need to buy shokz man…my beats headphones kept slipping from all the sweat which wasn’t really a problem before. I took gels every 3 miles and water at basically every aid station. Around mile 16 was when it got a lot harder to hold the 9:30s so I’m like ok that’s way earlier than I would fatigue on my long runs but that’s chill, I’ll do 10:30s. There was a moderate hill at around mile 21, I was able to slowly run up it, then run the downhill that followed but after that it got sooo much harder! This was also when it got a lot hotter because we weren’t getting the wind off lake superior anymore. My hamstrings probably hurt the most, my upper back and stomach too. Before, I would briefly walk through the aid stations but now I was walking through the entirety of the aid stations and at other parts too. I’ve never felt that much fatigue from running it’s crazy! I thought Id feel that as I was booking it to the finish line but nope…those 11:30s got handsssss. This was so different from the half marathons I’ve done, I’ve always had something left in me to do a fast last 5k and mile and sprint to the finish, but this one I had nothing left in me! I thought maybe there was some kind of mental barrier since I could sprint finish before, so I tried to pick it up at mile 25 because if I finished the last two miles in under 20 minutes I could maybe break 4:30 but nope, that wasn’t happening either. At this point I was a bit confused about how my body was feeling and just because of how far off my time was going to be, even though I quit looking at my watch a while ago. All the volunteers and cheerers were amazing though it was so wholesome! I loved the live music, dancers, and some people I didn’t even know looked at me and cheered my name! In any other scenario I’d be creeped out but I was just so happy at that point. One thing that I was glad I did was take out my headphones once I got to duluth because it was so fun! My heart goes out to the people experiencing dehydration or other medical problems, as there were quite a few, I hope you’re ok!\n\nPost-race: My hamstrings are so sore! But otherwise I’m very happy I did it. I’m a marathoner!! One thing I was struggling with afterwards was the slight disappointment of training at specific paces and running on average 8 hours a week+2/3 hrs of cross training (with a few 10 hour weeks too) and not even being close to my goal. Im so used to setting goals, that’s how I motivate myself to do anything. But with a marathon, especially a first one, just showing up and doing the best you can is enough. I know one hard race doesn’t negate all the work I did, but idk it’s hard not to think about it like that. I just have to remind myself how lucky I am that I get to do this. Also comparing time trained to race time is just a recipe for bitterness and jealousy, definitely still need to work on that i’ll admit it. I guess that was lesson 3 and 4?\nAnyway, thanks for reading, my whole running journey is basically on my reddit page, and to anyone who raced Grandma’s today: you’re all so strong fr.",
      "author": "siliwei",
      "created_utc": 1750548103.0,
      "score": 74,
      "num_comments": 14,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "youtube"
  ]
}