{
  "id": "twin_jjaksha",
  "username": "jjaksha",
  "activity_count": 1,
  "interests": [
    "kickr",
    "with",
    "tread",
    "that",
    "peloton"
  ],
  "post_times": [
    1743191225.0
  ],
  "history_sample": [
    {
      "id": "1jm3tc5",
      "title": "Wahoo Kickr Run treadmill (and Peloton Tread comparison)",
      "selftext": "*Disclaimer: I'm not affiliated with Wahoo or Peloton in any way. Paid full retail for both treadmills. Stand nothing to gain from this post financially (but if Wahoo wants to send me one of those cool Headwind fans, I will accept). I paid $***5,737.24** after tax and shipping for the Kickr Run, and previously paid $**3,565.76** for the Peloton Tread with the extended protection plan.\n\n**Background**: I'm a consistent recreational runner, probably 80% indoors. 6' \\~170 lbs, run about 30-45 miles per week. Live in Austin, so an indoor running option is clutch for a good part of the year.\n\nI've had the Peloton Tread for over 3 years now and put a lot of miles on it, so it makes sense for me to compare the two. Hope you find it useful.\n\nI've spent the last several months researching treadmills, as the extended warranty on the Tread is almost up and it's had several meaningful repairs during the ownership period (3 deck replacements, plus one set of lateral support replacements.) I demo'd a number of treadmills at Johnson Fitness and watched countless YouTube videos before deciding to give the Kickr Run a try.\n\nI don't cycle anymore and have no prior experience with Wahoo, and they didn't have a Kickr Run in my area that I could test in advance. I'm confident they'd sell a lot of more if they had more of them set up in shops in major metros.\n\n**Delivery**: I'd read some less-than-ideal reviews of other delivery experiences with their delivery partner RXO. Mine was fine, and communication was good. Once they arrived, it took them about 45 minutes to unpack and set up. I think they got on the line with Wahoo's support team at one point, which isn't surprising given that this is a new device out in the world.\n\n**Setup**: I'd seen enough YouTube videos about the Kickr Run to know what to expect and some of the general operation. Once I powered on, the Wahoo app on my phone quickly found and connected to the Run and then connected the Run to my WiFi. It downloaded one update that took about 5 minutes, and the promoted a series of short videos on the app to acquaint me with the Run's controls. Very well done, quick and to the point.\n\n**Running Experience**: Part of the reason the Kickr Run appealed to me was the clean console and lack of a large screen. I'd already set up a TV on the wall in my garage so that I could choose from different apps, or just watch a show/movie for longer run days. The screen shaking on the Peloton Tread always annoyed me, especially at really any pace above a 9 min mile or at incline. It's one of the trade-offs of the Tread's design - it looks super clean and minimalist, but to achieve that, the attach point for the massive screen isn't enough ton hold it solid. And yes, I leveled the Tread.\n\nI actually had the Tread in the garage still after the Kickr Run was delivered, and it was shocking to see them side-by-side. The Wahoo just looks so much more commercial grade. The base is tall and beefy, the belt is longer and wider. It definitely takes up more space, so that's a consideration if you're constrained there.\n\nThe Kickr Run's beefier construction comes through in the run. It feels *extremely* solid and stable underfoot. With the Tread, it just always seemed a touch wobbly, as I mentioned before. Not so with the Wahoo.\n\nI found the Tread's controls to be responsive; that was never an issue. The Wahoo's are equally so, with some additional gestures for pace and include that allow for additional flexibility (ex: short taps, long holds, etc.).\n\n**Noise**: I've always felt the Tread to be acceptable noise-wise. It's not loud. The Kickr Run, however, is almost silent. It's crazy. When running, you really only hear your footfalls on the belt.\n\n**Misc**: I often use the Peloton Tread as a walking desk with an additional acrylic desk you can set on top. That didn't fit the Kickr Run, but the built-in desk at the front actually works pretty well for this, especially if I'm walking during a Zoom meeting or something where I'm more of a passive attendee vs. needing to type something out consistently.\n\n**Apps**: I mentioned before that I'm not a cyclist, so I don't have prior experience with Zwift or other apps. I'll try them out soon. Another reason I decided to move on from the Peloton Tread was that I was using the subscription less and less, and really only took classes from one favorite instructor (Matt Wilpers). At some point, I might use the Peloton app on my TV with the Kickr Run, which would be fine, because some of the integrated Tread features like the Leaderboard don't mean anything to me.\n\n**Overall Comparison**: It's not entirely fair to compare these two machines as apples to apples. The Kickr Run costs $2K more. With all the repair issues we've had with the Peloton Tread, I've come to feel that it's really designed to be used 3-5 times a week for an average of about 30-45 minutes at a time. Our usage was much more than that, and likely contributed to the repairs.\n\nTo their credit, Peloton support was always friendly, responsive and made good on those repairs. They're peculiar in that almost any issue with the Tread's base requires them to replace the whole base.\n\nThe Kickr Run is a more substantial, and powerful machine. The running surface is more stable, but I'd say both the Tread and the Kickr Run have a firmer feel underfoot, which I prefer. Some of the higher-end machines like TechnoGym and others almost feels like running on trampolines, to me. Someone said the Kickr Run's feel is a bit like \"packed dirt,\" and I think that's a good comparison.\n\nIf you love Peloton classes and the instructors, and only plan to run on it about 5 hours a week, it might be for you. It's still a good machine - ***but get the extended warranty***.\n\nOne of the reasons I initially hesitated on the Kickr Run was buying a Gen 1 device seemed risky to me. So far, it feels pretty polished.\n\nOne of the other drawbacks was their initial warranty offering (1 year) didn't seem like a lot of confidence in the product. They've since upgraded this to 5 years for frame, motor, and running belt, which is think is the right call at this price point. Many of the commercial machines at this price from somewhere like Johnson will have that, at a min, and many have lifetime warranty on core components.\n\nQuestions? Fire away, I'll do my best to answer.\n\n  \nUpdate: Have put about 150 miles on the Kickr Run now. Love it so much, it's a beast!",
      "author": "jjaksha",
      "created_utc": 1743191225.0,
      "score": 40,
      "num_comments": 39,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "twitter",
    "reddit"
  ]
}