{
  "id": "twin_rukja1232",
  "username": "rukja1232",
  "activity_count": 1,
  "interests": [
    "that",
    "week",
    "this",
    "with",
    "pace"
  ],
  "post_times": [
    1743296042.0
  ],
  "history_sample": [
    {
      "id": "1jn0yr9",
      "title": "Western Pacific Half Marathon Race Report: How does hill training translate to a flatter grade?",
      "selftext": "\\### Race Information\n\n\\* \\*\\*Name:\\*\\* Western Pacific Half Marathon\n\n\\* \\*\\*Date:\\*\\* March 29, 2025\n\n\\* \\*\\*Distance:\\*\\* 13.1 miles\n\n\\* \\*\\*Location:\\*\\* Fremont, CA\n\n\\* \\*\\*Website:\\*\\* [https://brazenracing.com/westernpacific/](https://brazenracing.com/westernpacific/)\n\n\\* \\*\\*Time:\\*\\* 1:42:30\n\n\n\n\\### Goals\n\n| Goal | Description | Completed? |\n\n|------|-------------|------------|\n\n| A | Finish | \\*Yes\\* |\n\n| B | Sub 2 | \\*Yes\\* |\n\n| C | All splits sub 8:30 | \\*Yes\\* |\n\n| D | Beat my friend | \\*Yes\\* |\n\n\n\n\\### Splits\n\n| Mile | Time |\n\n|------|------|\n\n| 1 | 7:43\n\n| 2 | 7:29\n\n| 3 | 7:40\n\n| 4 | 7:48\n\n| 5 | 7:50\n\n| 6 | 7:43\n\n| 7 | 7:44\n\n| 8 | 7:56\n\n| 9 | 7:48\n\n| 10 | 7:52\n\n| 11 | 7:51\n\n| 12 | 7:46\n\n| 13 | 7:36\n\n| 14 | 7:25\n\n\n\n\\### Background\n\nI (21 M) started running about a year ago. I came from a pretty aerobic base, having played soccer in high school and ultimate in college. I trained for and ran a half marathon with a few friends in August 2024. The day before, we realized it was a trail half marathon. Let's just say that the experience was one I would never forget. First half marathon + 1,700 feet of elevation gain.\n\nI had trained hard for that race, and although I was proud of my performance (2:01), I knew I could do much better. But I never set a timeline for the next race; I was hooked on running but I was also exhausted and demotivated. I found weight training to be a lot easier than running, so I focused on the former. I still ran once a week, but averaged around 5 miles at an easier (for me) pace (8:30-8:45). \n\nDuring winter break (December 2024 - January 2025), I came back home from college and bumped into some family who were all runners. They convinced me to sign up for a marathon which would take place in October. \n\nWhen I went back to college, I started building on my base. I generally walk around 5-7 miles a day so my cardio base is always there. My ever-supportive parents got me a Garmin Forerunner 245 for my birthday; it's now my best friend. I only ran around 12 miles a week over two days, but it was better than before, and I was having fun.\n\nIn February, I noticed (on Strava, the best social media app) that one of my friends (call him A) who had ran the last half with me was also running. I reached out, asking if he wanted to run a 10k together in late March when we both had spring break and would be back home. He suggested we do a half marathon instead. \n\nI had trained for over 5 months for the last one. Now I would only have one month. My brain told me not to do it. So I said yes. We signed up for the Western Pacific Half Marathon, a significantly flatter race than the one prior. I was nervous. \n\n\n\\### Training\n\nI kept the 2-run a week schedule. In hindsight, I wished I bumped it up to more. It's not like I couldn't--I was doing weight training or core/flexibility work the other 5 days. \n\nI'm a morning runner, so most of my runs were in 45-50 degree weather starting around 5:30/5:45 AM. My longer runs were on Saturday and generally began around 6:15 AM. The comparatively shorter run was on Wednesday, and I was pretty strict about start time, especially because I had early classes.\n\nI progressively increased mileage after signing up. I had about 5 weeks of training time.\n\n\\## Week 1 (total mileage: 12; 4.7 (wednesday) and 7.3 (saturday):\n\nI remember feeling pretty good this week. My pace was all over the place, though, ranging from about 8:10 on the short run and 8:30 on the longer run. I go to school in a hilly place, so elevation gain was around 500ft +.\n\nMy routes were pretty well established at this time. However, I found myself getting bored on my \"long\" runs, so I decided to motivate myself by running to breakfast spots nearby and taking the bus back. \n\n\\## Week 2 (total mileage: 14.84; 5.96 (wednesday) and 8.88 (saturday):\n\nThe Wednesday run was on very little sleep. It was quite windy and cold, and there was around 600 feet of elevation gain. I ran at a slower 8:30 pace, but better than no pace and no run. \n\nI rewarded myself with that Saturday longer run for sure, getting three massive  bagels with tofu cream cheese. The second half of this run was with a friend, but I was actually faster (8:16/mi pace) because it was largely a downhill run. \n\n\\## Week 3 (total mileage: 14.59; 6.06 (wednesday) and 8.53 (saturday):\n\nWednesday run was the exact same as the prior week, but I was a bit faster at a 8:23 pace.\n\nI'm a morning runner but I ran the Saturday run in the afternoon because I was out until 1 am that morning. Honestly, I didn't want to run. It also didn't help that it was at the same time as a home basketball game against our rival. But sacrifices must be made. \n\nAlthough it was a shorter run than the prior week, it was the toughest yet, with 800 feet of elevation gain. I ran at a 8:40 pace.\n\n\\## Week 4 (total mileage: 15.77; 6.14 (wednesday) and 9.63 (saturday):\n\nWednesday run was more of the same, but I was slower. This was frustrating, and I thought I could redeem myself on Saturday. \n\nAgain, I ran to a breakfast spot with a friend at a conversational pace, but I did get a 15k PR in the process! \n\nThis was the week before finals; honestly, the Saturday run was a great start to the week and I'm happy I decided to run instead of study.\n\n\\## Week 5 (total mileage: 16.24; 6.08 (wednesday) and 10.16 (saturday):\n\nLast week before taper!\n\nWednesday = groundhog day, except I had a final exam to complete as soon as I finished my run! I ran through a stomachache and in hindsight, I really shouldn't have done that.\n\nI came back home on Thursday and got ready for my long run on Saturday. Since I was back home, I started a bit later than usual. My heartrate and power were at threshold by mile 4, which I knew was a bad sign. I slowed down and ended up completing the run at a 8:39 pace.\n\nThis performance was disappointing to say the least. There was roughly 600 feet of elevation gain, but I thought I could do it at sub 8:30. I still got a PR in the 10 mile.\n\n\n\\### Taper Week\n\nI broke all the rules I set for myself for this week. Coming back home for break is always a blast; my family and friends are here and home food is the best! \n\nBut my friends and family are quite active. After my long run on Saturday, I wanted to work out daily (lifting or HIIT + cardio) and walk my dog (~3-6 miles a day), but I did not want to run or do anything excessive. But this was the only week I would see my friends for a while, so I couldn't say no to anything. \n\nMonday was good. I did nothing excessive and felt great. On Tuesday, I got it in my head that I should do a shakeout run. Terrible idea. I completed a 4.26 mile run at a 8:22 pace, but I felt terrible at the end and wanted to throw up by mile 3.\n\nMore than anything, this dented my confidence. My ankles were also significantly swollen. I continued my bad decision making by playing badminton with friends right after my run. \n\nOn Wednesday, I did a 6 mile hike (2100 feet of elevation gain) with friends in roughly 2 hours, which only worsened the swelling. When I got back, I headed straight to the city with some other friends and spent the day walking. 30k steps that day.\n\nThursday morning, my ankles were the size of lemons. I did nothing except light walking and some mobility and core exercises. \n\nOn Friday I did some upper body strength training and walked my dog. The pain in my ankles had subsided but I was still scared.\n\nThe race was at 8 AM, so I slept around 9 PM Friday night. \n\nA lot of folks talk about carb loading. I didn't carb load per se, I just ate a lot during the week. Home food hits different. For hydration, I generally drink around ~4 liters (~140 ounces) of water a day, and I didn't change that during the week. \n\n\\### Pre-race\n\nGot up around 6, took a massive dump, and then ate a peanut butter sandwich with a few oranges. Finished a massive bottle of water.\n\nMy friend, A, swung by to pick me up around 7:10 and we got to the race around 7:30. Checked in, dropped my bag off, and put one headphone (right earbud only) in. I would have liked to use the restroom but we got there too late. \n\nStill, I was excited by the number of people and how official the race looked. There were pacers and six aid stations. In my first half marathon, there were only two aid stations and no pacers. \n\nThen I messed up. Kind of. \n\nThere was a big crowd at the starting line and I made my way to the front. I got it into my head that the 1:40 pacer was best for me and my goals because that meant an 8 minute mile pace. My math was the following:\n\n8 * 60 = 140. Don't ask me where I got the 60 from or how I got 140 at the end of that calculation. \n\nSo I stood awkwardly towards the start of the crowd, waiting for the race to begin. \n\n\n\\### Race\n\n\\## Miles 1-3:\n\nThis part was relatively flat and downhill. My music playlist was geared to exactly the right songs, but I know I went out too fast. My second mile split was 7:29, about a minute faster than my training. \n\nAs I ran past the beautiful lakeside scenery, two thoughts were dueling in my mind. I felt good, even though I was going fast. But I always read horror stories about people going out too fast. I felt great but by the end of the third mile, I knew this was not sustainable.\n\n\\## Miles 4-6:\n\nAnother flat portion in a race of flat portions. I made the conscious decision to slow down here but still pace myself by keeping the 1:40 pacer in my view. A few racers then caught up with me and I decided to run with them for a while. After mile 5, there was a nice downhill portion under a bridge that came up after about 20 feet. I sped up here and was met with cheering volunteers at an aid station on the other side. I downed a cup of water while running and tossed it in the trash.\n\nThe water gave me a small boost and I found myself alone again, between the 1:40 group and the folks who I was running with prior.\n\nMy split for the first 6 miles was 46:14 with an average heart rate of 154. \n\n\\## Miles 7-9:\n\nAt this point, I realized that I could run at a sub-8 pace. I still hadn't convinced myself that this was sustainable, so I decided to distract myself.\n\nAfter going around a lake, the route takes racers along a creek. This is an out-and-back portion. I got to the turnaround and 50 seconds later, I bumped into A.\n\nAt least I would beat my friend! This gave me an energy boost and I sped up. As I passed racers headed in the other direction, I tried to give each of them a fist bump, high five, or say something positive. When I passed runners doing a 10k, I kept that practice up. This took my mind off of the run but it also slowed me down (my excuse for the mile 8 split). \n\n\\## Miles 10-12:\n\nThe 1:40 pacing group was slowly leaving my sight line here. As I sped up, Gotye's \"Somebody that I used to Know\" came on, and I remembered my first ever \"major\" run from 3 years ago: a hilly 8-miler at a 7:43 pace. If I could do that then, I can do anything know, I thought.\n\nI ran faster, pushing myself, and it paid off. I got some more water from an aid station but I knew I couldn't finish it before I got to the trash can, so I spilled it over my head. This gave me another energy boost.\n\nMy split for the second 6 miles was 46:56 with an average heart rate of 168. \n\n\\## Home stretch:\n\nThe finish line was in site but I wasn't there just yet. The grade was downhill so I picked up the pace for the 13th mile, running at 7:36.\n\nThere wasn't any pain or cramping, but I was definetely out of breath. I also began to regret not using the restroom prior to lining up at the start. No matter; I literally had 8 minutes until I could get that relief. \n\nAt this point, my playlist went back to the start. Although I had queued up 2 hours worth of music, I had skipped some songs (sorry Beatles!).\n\nI ran as fast as I could for the last 0.5 miles and heard my name on the speaker as I crossed the finish line. \n\n\n\\### Post-race\n\nI'm still shocked at my overall pace of 7:45/mile (according to Strava). This was much faster than any of my training runs. I think a large factor was the lack of elevation change in the race (~100 feet). But I can save that analyzing for another day.\n\nAfter crossing the finish line, I downed a bottle of water and then went back to the finish line to record A. I waited for about 10 minutes before he came through. We embraced at the end and then I used the restroom (much needed!).\n\nI ate a few bananas and then went to see if I won a medal for my age group. The volunteers informed me that I had, and gave me a vintage medal that the organizers were discontinuing. I then went and thanked the 1:40 pacer. \n\nMy family said that they would be at the finish line to record me but they showed up right after. I helped my sister get some more snacks for herself before leaving the venue with A to grab brunch.\n\nI've never devoured a veggie burrito faster. \n\nWhen I got home, I took a long shower and went to the race website to see my photos. I was really happy that they weren't behind a watermark. I'm extremely grateful to the volunteer photographers for the work that they do. I'll definetely be on the page in the next few days as more photos are uploaded. \n\nThere's still a lot of reflecting that I have to do. I'm not sure how my taper played a role or why I was so much faster than my training runs. I was falling out of running in November and December of 2024, but now I love it again. Running makes me happy. I should do what makes me happy. \n\nI'll probably wait a week before running again, though. \n\nIf you made it this far, thank you! I apologize for any grammatical or spelling errors. \n\n\nMade with a new \\[race report generator\\](http://sfdavis.com/racereports/) created by u/herumph.",
      "author": "rukja1232",
      "created_utc": 1743296042.0,
      "score": 70,
      "num_comments": 7,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "tiktok",
    "instagram"
  ]
}