{
  "id": "twin_crazerk2",
  "username": "crazerk2",
  "activity_count": 1,
  "interests": [
    "race",
    "with",
    "more",
    "some",
    "training"
  ],
  "post_times": [
    1752394520.0
  ],
  "history_sample": [
    {
      "id": "1lynm2y",
      "title": "Run Melbourne HM 25 Race Report",
      "selftext": "### Race Information\n* **Name:** Run Melbourne\n* **Date:** 13 July 2025\n* **Distance:** 20.7km\n* **Location:** Melbourne, Australia\n* **Time:** 2:04:23\n\n### Goals\n| Goal | Description | Completed? |\n|------|-------------|------------|\n| A | Sub 2:20 | *Yes* |\n| B | Sub 2:30 | *Yes* |\n| C | Finish! | *Yes* |\n\n### Splits\n| Kilometer | Time |\n|------|------|\n| 1 | 6:09\n| 2 | 6:17\n| 3 | 6:09\n| 4 | 5:58\n| 5 | 6:01\n| 6 | 6:08\n| 7 | 6:01\n| 8 | 5:55\n| 9 | 5:56\n| 10 | 5:51\n| 11 | 5:53\n| 12 | 5:56\n| 13 | 5:48\n| 14 | 5:58\n| 15 | 5:51\n| 16 | 6:10\n| 17 | 6:13\n| 18 | 5:47\n| 19 | 6:02\n| 20 | 6:01\n| 21 | 5:53\n\n### Training\n\nThis was my first time joining an organized race; Training plan was self designed at 3 runs a week, increasing by not more than 10% weekly mileage with a back off every 4th week. One run would be some kind of speed work, one long run, and one easy run.\n\nI had 6 months to build up, but did pick up a hip injury halfway thru which took me out for 3 weeks. In the following 3 months, training wasn't ideal either as I was plagued with peronneal tendonitis on both feet and had to reduce my mileage (any tips for prehab?)\n\nMy peak volume was 31km at 3 weeks out, with a long run of 17km. Was supposed to do a 18km the following week but feet were hurting so I cut it to a 15km.\n\nDid NO long runs in the final 2.5 weeks, which I thought was a death sentence to any respectable timing. To make things worse, my right peronneals were flaring up real bad in the final week so I did not run at all in the 8 days leading up to race day. \n\n### Pre-race\nThe day before race day, my peronneals hurt so much (every step was sore) I was super bummed and mentally prepared to just walk/run the course. Being my first running event ever, I just tried to tell myself to enjoy the experience. I tempered my expectations from a sub 2:20 to a 'dont DNF'\n\nRace morning, I had a can of Milo and some Julies peanut butter biscuits. Race fuel was 1 SIS gel, 1 GU Cola gel, 1 PURE gel, 1 GU choc (I felt GU gives me the most 'boost' but eating too many GU gels makes my tummy upset, so I tried to mix it up. SIS and PURE go down more easily for me)\n\nI also taped up my right foot based on some random Google link to help my peronneals; midfoot hurt a bit still so I also wrapped 2 lines across my midfoot. Shockingly, this helped immensely and I didn't feel discomfort in my right foot all race!\n\nWeather was 10 deg C which is a very cold run for me, coming from a country with lowest temps at 24 deg C (SG). Donned a secondhand sweater waiting for the start, which I shed before the gun. Race attire was an UA tee, arm sleeves, shorts over running long tights, and gloves.\n\nWas also supposed to start in Wave D (>2:06)), but we (me and my friend) got tired of walking down the long line and just slipped in with the Wave C runners (1:56-2:06) and decided to pace ourselves.\n\n### Race\n0-10km:\n\nWe didn't agree on a pace, but I knew she wanted to finish under 2:10 if possible. I initially wanted to go more conservatively because of my injuries but I decided to follow her as long as I could, as it felt nicer to run with someone.\n\nShe set off pretty quick - my target race pace was 6:30/km (easy run pace during training was 6:50-7) - we were going at 5:15-6:00 in the first few km with some downslopes but settled at around 5:45-6 in the mostly flat first half.\n\nThe first 10km felt pretty chill physically. My feet weren't hurting and 6:00/km was theoretically a fast pace for me, but somehow in the cold weather it felt perfectly manageable and very comfortable. I shed my gloves after about 5km, though with the random gusts of cold wind, it was still an overall very cold race for me even after my body warmed up a bit.\n\nThe route brought us back into the CBD, away from the event village, which meant virtually no supporters. The segment ended off running alongside the river with a nice view of the yachts and city skyline, and we crossed back towards the Royal Botanic Gardens.\n\n10-15km:\n\nMy wife was waiting at the Gardens so I was looking forward to this segment and got a hi-five boost at about 11km. This was also where more and more spectators lined the course and made for a more motivating environment. The course was mostly flat still; my ankles and feet started to get more fatigued from this point, but I was surprised I could still hold my pace and keep a steady rhythm.\n\n15-18km:\n\nThe start of a series of climbs. You can actually anticipate it due to the route looping to a turnaround at 15km so you pass everyone coming back on the gentle climb from 15-17km.\n\nI lost my running buddy as she held a strong effort and I just tried to keep a steady rhythm to not blow up as I passed some walkers. The climb got a little steeper 17-18km before levelling out. My left foot had began to hurt but nothing that went beyond 2/5 so thankful for that. \n\n18-20.7km:\n\nI had taken a gel at 5km, 9.5km, 14km. I had planned for one more at 18.5km but my stomach was feeling slightly weird so I skipped the gel but took a full cup of electrolyte drink at the aid station instead.\n\nThis segment was as good as a victory lap. Mentally I knew I was not going to stop even if things started to hurt so I pushed and maintained my rhythm.\n\nThere were many more spectators and you can feel the vibe shift as you get nearer to the end. Every runner was pushing harder which made me push harder too (tho not really reflected in my splits)\n\nThere were still some steep but short climbs near the end that threatened to cramp me up but turned out ok. \n\nWas such a rush running through the finish line with my arms raised as I acknowledged my imaginary fans... And was so pleasantly surprised to smash my goals despite the injury woes leading up to the race.\n\n(The course length turned out about 300m short, but even if I added that I think it's a comfortable sub 2:10!)\n\n### Post-race\nWe walked around the event village to snap photos, grab some small freebies - some choc protein milk, some candy, and nothing much. Is it normal for events not to give a finishers tee/ singlet? Was expecting one and bummed to only have a medal.\n\nQuite an interesting first-time experience running a race effort for '21km', though it was only made possible with the cold weather (my usual training weather is 28-33 deg C). \n\nHad a cheeseburger for lunch but my body was having the shits for most of the day (from gels? From the hard effort?) so couldn't really stomach much food. \n\nWhat's next? Probably do a block of strength training for injury prevention before going into another HM training block to see if I can replicate this timing in hot and humid Singapore. Then maybe, just maybe, a full in 2026?\n\nFor now, everything is sore, but my heart is full.\n\n~~~\n\nMade with a new [race report generator](http://sfdavis.com/racereports/) created by /u/herumph.",
      "author": "crazerk2",
      "created_utc": 1752394520.0,
      "score": 40,
      "num_comments": 23,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "twitter",
    "reddit"
  ]
}