{
  "id": "twin_InMyFlopEra",
  "username": "InMyFlopEra",
  "activity_count": 1,
  "interests": [
    "**mile",
    "miles",
    "race",
    "time",
    "week"
  ],
  "post_times": [
    1742677100.0
  ],
  "history_sample": [
    {
      "id": "1jhiirf",
      "title": "Annapolis Half Marathon – slow runner sets new PR",
      "selftext": "# Under 2:30Race Information\n\n* **Name:** Annapolis Half Marathon\n* **Date:** March 22, 2025\n* **Distance:** 13.1 miles\n* **Location:** Annapolis, MD\n* **Website:** [https://runsignup.com/Race/MD/Annapolis/AnnapolisRunningFestival](https://runsignup.com/Race/MD/Annapolis/AnnapolisRunningFestival)\n* **Time:** 2:15:54\n\n# Goals\n\n* **Under 2:30** – completed\n* **Under 2:44 (PR)** – completed\n\n# Splits\n\n* **Mile 1:** 12:15\n* **Mile 2:** 11:12\n* **Mile 3:** 10:59\n* **Mile 4:** 10:41\n* **Mile 5:** 10:32\n* **Mile 6:** 10:34\n* **Mile 7:** 10:40\n* **Mile 8:** 10:19\n* **Mile 9:** 10:09\n* **Mile 10:** 9:39\n* **Mile 11:** 9:45\n* **Mile 12:** 9:36\n* **Mile 12:** 9.23\n\n# Training\n\nBrief history: I have been a casual runner for years and trained for half marathons in 2019 and 2022 (2:44 each time, lol) but lost interest after each race to focus on my other athletic hobbies like lifting and climbing. So while I could always have fun on a 3-4 mile casual run with friends, I never really improved fitness or got faster. \n\nIn February 2024, I had a great time training for and running a 10-mile race and managed to maintain around 10-15 miles per week for the rest of the year.\n\nI started training in earnest at the end of January, but viewed it more as a fun way to increase my mileage. I ran 4 times a week, maintaining about 20 miles per week, consistently increasing my long runs every weekend while doing some tempo treadmill runs. My longest run was 11 miles, two weeks away from the race. Throughout this process I lifted 2-3 times per week and took a hot yoga class every week or two. \n\n# Pre-race\n\nI stayed over at my girlfriend's mom’s house in Annapolis the night before the race. We went out to dinner, where I had an (extremely mid) pita + hummus plate and french fries. I went to bed at 10 p.m.\n\nWhen my alarm went off at 5:15 a.m., I felt super tired and heavy. But I drank a yerba mate, ate a banana with sunflower seed butter, and put on my race fit and bib, and felt a lot better.\n\nMy girlfriend’s mom graciously dropped me off at 6:15 a.m. It was still dark out, but nice to use the porta potties without a line and jog around for a few minutes. They also had a sock burning fire (it’s an Annapolis tradition to burn your winter socks to welcome spring) to warm up in front of.\n\n# Race\n\nMiles 1–4: Easy peasy. I made sure to start the first mile nice and slow. This was a really comfortable pace without too many hills.\n\nMiles 4–6: We hit the Navy Bridge, which is a particularly nasty hill! Luckily I took my first gel with 35mg of caffeine, and the (mostly placebo) effect got me up it, plus the thrill of passing people. I started to feel a little uncomfortable with the rolling hills, but in good spirits. \n\nMile 6–8: We enter an out-and-back on the B&A trail, a paved trail that goes through nature and residential areas. Even though I now feel like I’m racing and not just on a long run, it was really refreshing and lovely to hear bird calls and see the beginning of spring. This is when I started to pass people. I would set my sights on someone who looked pretty athletic and think “awesome, I’m going to follow them for the rest of the race.” But then I would just… go faster! It was a nice ego boost. I also took my second gel. \n\nMiles 8–10: Time to lock the fuck in. I put my headphones on for the first time and bump ericdoa. I’m pushing, but these two miles are a mild downhill.\n\nMiles 11–12: Back on the Navy Bridge. Everything hurts and I’m furious about everyone who has ever wronged me. \n\nFinal 0.1 miles: This was bruuuutal. They had us go uphill and through an unaesthetic parking lot to get to the finish line! I really pushed myself to cross the finish line.\n\n# Post-race\n\nI was honestly in shock at my time! Throughout training I was expecting to eek out 2:30 – and totally not expecting to run under 10:00 pace for the last three miles. I grabbed the post-race goodies and asked a stranger to take a picture of me with my medal before my girlfriend’s mom picked me back up.\n\nI drove the hour home, showered/walked the dog, and met friends for brunch and devoured a waffle, Impossible sausage patty, and iced lavender latte. Weirdly enough, my left IT band felt really painful – it’s bothered me in the past, but hasn’t flared up in more than a year. It’s only 7 hours post-finish, so we’ll see how I feel tomorrow. \n\nI’m pretty jazzed, honestly, and I’m wondering if there’s another race or time that I should set my sights on. I have to train for a Grand Canyon Rim-to-River hike next month, but after that, I’m wondering: Do I try for a faster half? Faster 10k? Or go longer and do my first marathon? Either way, maintaining consistent mileage per week paid off, and I definitely want to stay around 15-20 mpw until I decide what to do next.\n\n*Edited for fuck-ass formatting*",
      "author": "InMyFlopEra",
      "created_utc": 1742677100.0,
      "score": 82,
      "num_comments": 17,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "youtube"
  ]
}