{
  "id": "twin_chol4",
  "username": "chol4",
  "activity_count": 1,
  "interests": [
    "race",
    "mile",
    "first",
    "\\###",
    "this"
  ],
  "post_times": [
    1747719208.0
  ],
  "history_sample": [
    {
      "id": "1kqxanm",
      "title": "Race Report: Denver Colfax (first) Half Marathon",
      "selftext": "\\### Race Information\n\n\\* \\*\\*Name:\\*\\* Colfax Half Marathon\n\n\\* \\*\\*Date:\\*\\* May 18, 2025\n\n\\* \\*\\*Distance:\\*\\* 13.1 miles\n\n\\* \\*\\*Location:\\*\\* Denver, CO\n\n\\* \\*\\*Website:\\*\\* [https://www.runcolfax.org/races/half-marathon/](https://www.runcolfax.org/races/half-marathon/)\n\n\\* \\*\\*Time:\\*\\* 2:32:58\n\n\\### Goals\n\n| Goal | Description | Completed? |\n\n|------|-------------|------------|\n\n| A | Sub 2:30 | \\*No\\* |\n\n| B | Sub 2:35 | \\*Yes\\* |\n\n| C | Finish the Race | \\*Yes\\* |\n\n\\### Splits\n\n| Mile | Time |\n\n|------|------|\n\n| 1 | 12:50\n\n| 2 | 12:21\n\n| 3 | 12:05\n\n| 4 | 12:04\n\n| 5 | 12:17\n\n| 6 | 11:58\n\n| 7 | 11:35\n\n| 8 | 11:03\n\n| 9 | 10:55\n\n| 10 | 11:33\n\n| 11 | 10:46\n\n| 12 | 10:50\n\n| 13 | 10:04\n\n| 14 | 1:57\n\n\\### Background\n\nI was pretty athletic growing up. I have played soccer all my life, but never considered myself a good \"runner.\" Do you remember those president fitness awards they would hand out in elementary school? I would always pass all the challenges except running a mile under 10 minutes. This translated in me thinking I could never be a good runner. However, 6 years ago, I signed up for my first 5k. Since then, I have done another 5k and an olympic distance triathlon. This year I finally signed up for a half marathon after wanting to do one since last year.\n\n\\### Training\n\nI followed the 80/20 Running 15 week plan. I really liked the structure of the plan and the different runs. It does however require a lot of patience. I noticed improvement in my heart rate zone trainings, but it can be incredibly annoying at times when my heart rate spikes, and I have to run/walk extra slow to bring it down to zone 2 or zone 1. I tried to follow the plan as much as possible although the first several weeks I ended up missing long runs due to travel and calf aches. For some reason, I didn't start stretching after my long runs which contributed to aches. In addition, I ran 7 days a week (I know major no no. Idk what I was thinking). However mid-way through my training, I buckled down and got back on plan with my long runs. I also made sure to run no more than 4x a week.\n\n\\### Pre-race\n\nThe day before, I had a double serving of pasta and meat sauce. I felt a little bad given how much I ate including when I did a 20 min zone 1 run. However, this paid off the next day (race day). I ate waffles with water and a gu. I also made sure to do my favorite runners stretch. Once I got to the venue, I waited with my corral group for the start. Thankfully it was an overcast day in the 50s, perfect weather for a run. I was not as nervous as I thought I would be. I luckily got good sleep. I was a lot more nervous for my triathlon.\n\n\\### Race\n\nI had nothing on me except 4 gus and my phone. I read up on a lot of tips from previous half marathon/marathon runners. The main thing I did at the start was run slower than my goal pace. During my training, I was able to run a pace of 12:37 min. I knew I wanted to aim for sub 2.5 hours. I conspired a plan of running a 13 min first mile, 12 min miles 2-6, and 11 min miles 7-13.1. I was able to aim for a pace around 13 min for my first mile, but it was so easy to run faster. With people passing me and the thrill of my first race, I actively had to slow down when I started going faster. By mile 2, I kicked it up to a 12 minute pace, but I still had to hold myself back from going faster. Mile 4 was through the zoo which was nice although there weren't too many animals out. The highlight was seeing an elephant, but I didn't stop at all. The race narrowed a bit here so it was a little cumbersome going around people. An hour in, I took a gu. By mile 6, I started going 11 min, and that still felt pretty good and easy to maintain as the sun was coming out. The course was overall flat with a few hills. Up the hills, I naturally slowed down but allowed myself to go faster downhill while keeping my pace during the flat parts. I took another gu after 1.5 hours in. My left knee started hurting a bit around mile 8. Luckily, I still kept my pace. The pain went away a couple of miles later. I felt a couple of aches in my calf or feet but they lasted a short time and went away. By mile 10, I had about 32 minutes left. I knew I was very close to meeting my sub 2.5 hour goal, but I would need to run 10 minute miles. I took another gu. This was when I pushed myself more. It was during this part that the race narrowed a bit due to sharing the road with the marathon/urban 10 runners. I had to maneuver around people. This was when I consistently passed people. It felt great, I knew I had paced myself well. In the last mile, I tried to hit a sub 9 min / mile, but I was hitting my limit as I naturally kept slowing down. However, I kept powering and telling myself that I still had fuel left in the tank. I was sprinting at this point and finished strong.\n\n\\### Post-race\n\nWhat an amazing feeling to finish the race and finish so powerfully. Obviously my first thought was how close I was to meeting my time goal, but I tried to focus on the other awesome parts of the race. I was so proud of myself for my pacing. I had never run such fast miles and to do it for the first time in a race felt astonishing. The fact that I was able to continue to speed up and feel good about it was a great feeling. This probably means I could have stuck with an 11:27 mi pace in order to meet my 2.5 hour goal since I probably had a little more left in the tank, but I have no regrets. On to the next race!\n\nMade with a new \\[race report generator\\](http://sfdavis.com/racereports/) created by [u/herumph](/user/herumph/).",
      "author": "chol4",
      "created_utc": 1747719208.0,
      "score": 36,
      "num_comments": 3,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "youtube"
  ]
}