{
  "id": "twin_oceannless",
  "username": "oceannless",
  "activity_count": 1,
  "interests": [
    "just",
    "ncaa",
    "football",
    "that",
    "sport"
  ],
  "post_times": [
    1744087295.0
  ],
  "history_sample": [
    {
      "id": "1ju5ftv",
      "title": "House v. NCAA is terrible for the sport",
      "selftext": "In the recent House v. NCAA, it aims to limit roster spots on XC teams to 17 and Track & Field teams to 45. Although every athlete may now be scholarshipped, is it really what is good for the sport?\n\nFirst of all, it ruins walk-ons. Like no more walk-ons. Many rosters will fill their spots to 17. It doesn't allow for high schoolers who are seeking to run at a higher level than D3 and hope to improve. Personally, I am a junior who runs a 9:40 3200m and hope to lower it to around 9:20 by the time I leave. These times are not close to level needed to get recruited to run D1, and I am okay with that. But, I still want to try to run at a D1 level and improve towards a better time and maybe be able to make a top spot my senior year of college, but I won't even have the chance to do so. I worry that because this limits the ability to have larger rosters, many teams will need to just take runners they already know are great: Kenyans. It is obvious that a majority of Kenyans are better than high school runners, but are these rosters really going to be filled with foreigners because our own damn country is too worried about the money. Look, I want to be inviting to the United States, but should we not put our people first in some cases?\n\nIs this really the nature of college athletics? I mean the whole goal of the lawsuit is to drive more money towards the power 5 schools. Most schools will not have the ability to scholarship 105 football players. And after all, what do we go to college for? To get a higher education. Instead, the NCAA is worried about seven figure contracts for students. Don't get me wrong; I do think that these football players do deserve a piece of the pie for the revenue they bring in, but do we really have to cancel Olympic sports because they aren't as profitable? Is NCAA for student-athletes or for the money filled power five football programs? I wish XC could make money. We work just as hard as the football teams. We work our asses off for four years just to try to walk on to a program to try to be a great runner one day and enjoy being a college runner, after all we all are amateurs. I don't ask to be overly funded, just to be able to compete and enjoy the sport. But nope, we are too worried about making sure the football programs can fund their $100 million dollar training facilities. \n\nI understand that football funds a majority of our sports, but what is the nature of college sports? Is it the new professional league or is it to give high school students the opportunity to compete at a higher level? I am just frustrated. I want to just be able to walk on and run D1 and enjoy the sport for what it is, but the NCAA is too worried about limiting the amount of people on these programs that are already underfunded. I am frustrated the person who filed the case was a swimmer, and their sport will be affected as hard as ours will be. The NCAA should be for all student athletes, not just football, not just money making programs. The NCAA should help all sports. ",
      "author": "oceannless",
      "created_utc": 1744087295.0,
      "score": 30,
      "num_comments": 14,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "tiktok",
    "instagram"
  ]
}