{
  "id": "twin_vegansxerunner",
  "username": "vegansxerunner",
  "activity_count": 1,
  "interests": [
    "miles",
    "race",
    "first",
    "mile",
    "around"
  ],
  "post_times": [
    1745975204.0
  ],
  "history_sample": [
    {
      "id": "1kb47sc",
      "title": "Race Report: Alexandria Half Marathon",
      "selftext": "Race Information\n\nName: Alexandria Half Marathon Date: April 27, 2025 Distance: 13.1 miles Location: Alexandria, VA Website: [https://www.alexandriahalf.com](https://www.alexandriahalf.com) Time: 1:28:59 Goals\n\nGoal Description Completed? A Sub 1:30 Yes Splits\n\nMile Time 1 6:56 2 6:54 3 6:50 4 6:52 5 6:59 6 6:56 7 6:40 8 6:50 9 6:45 10 6:48 11 6:42 12 6:39 13.1 7:06\n\nFirst off sorry if this is too long this is my first race report.\n\nBackground info\n\nI started running in 2010 when I joined the cross country/track team my junior year of high school and had some decent times 18:30 5k, 4:57 mile for someone running only two years. After High School I ran off and on but never consistenly and never following any kind of plan. Around 2019 I started taking it seriously again only to lose all motivation when Covid started. Once summer 2020 came around I found the motivation again and have consistently trained since. The past five years I ended up running a little under 1000 miles, 1000 miles two years in a row, 1200 miles the next year and last year around 1750. I raced here and there a couple of 5 mile turkey trots and local 5ks. I like most people wanted to eventually run Boston. So I knew a first step was to first run under 1:30 for the half. I raced the DC half-marathon September 2024 and ran 1:33:24. I was happy but a little dissapointed. Now to the this races training cycle.\n\nTraining\n\nAfter the DC half I basically ran around 40mpw for the rest of 2024 except around the holidays and when I got my knee tattooed. Starting in February I did the Pfitz 12/47 half program. I followed the training to a tee only missing two workouts, the 38 minute tempo and the first 10k tune up race. I was sick during these weeks so I still ran all the volume in these weeks but all super easy miles. The training had me feeling pretty condfident I was hitting all the workouts and was quite suprised. Dont get me wrong the workouts were tough but I felt strong. The 10k tune up right before the race had me feeling a little deflated as I ran just over 40:00 minutes and was hoping for a little faster. I do not know the exact time becasue the race wasn't certified and my watch said I ran 6.1 miles in 39:25. I knew this was at the end of the training cycle so on fresh legs for the half I should be ok but still.\n\nPre-race\n\nNot much to say here. I was nervous because I knew I could probably meet my goal but also knew I would be pretty sad if I didn't meet it. A couple of friends were also signed up so we warmed up together talked about our goals and lined up in our corrals.\n\nRace\n\nThe plan was to go out with the 1:30 pacers for the first 6 miles and try to push for the remainder. The pacers said they were aiming for even splits so that was easy enough. After the first couple of miles I realized we were behind pace enough to start to worry me, but I felt good so I went with my plan to push on, knowing it could be a risk but also that I must. The first mile I did this I basically gained back the time I needed. From here on out on the hills I tried to stay arounf 6:50 which is still faster than the pace I needed but slower than the 6:40 I just ran. To my suprise I was feeling super strong so I was closer to high 6:40s. I took a gel at mile 7 mainly for the mental boost. I continued to push on and since the course was out and back I knew miles 8-10 were kind of uphill. So I was a little worried I would crash out later but I kept pushing. I kept feeling good so I was starting to get elated knowing that if I kept it up I would make my goal. Once I got to the flat land around mile 10/11 I had it in my head to really push the last 5k. This ended up being where I started to feel uncomfortable, particuarly around mile 12. I just kept pushing and crossed the finish line a little after 1:29!\n\nPost-race\n\nThe chip time ended up being 1:28:59 and my last 5k was almost 20:30 which felt really great after running 10 miles. After the race I watched my friends finish and am happy to report that they all hit their goals as well. Everyone ran a great race and it was an amazing feeling to share that with them all. The plan now is to build a base and start Pfitz 18/55 for the Philly marathon in November.",
      "author": "vegansxerunner",
      "created_utc": 1745975204.0,
      "score": 23,
      "num_comments": 2,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "twitter",
    "reddit"
  ]
}