{
  "id": "twin_angahleen_x",
  "username": "angahleen_x",
  "activity_count": 1,
  "interests": [
    "this",
    "half",
    "miles",
    "race",
    "with"
  ],
  "post_times": [
    1742399235.0
  ],
  "history_sample": [
    {
      "id": "1jf036u",
      "title": "United NYC Half Race Report - A slower runner tackling their second half!",
      "selftext": "### Race Information\n* **Name:** United NYC Half-Marathon\n* **Date:** March 16, 2025\n* **Distance:** 13.1 miles\n* **Location:** New York, NY\n* **Website:** https://www.nyrr.org/races/2025unitedairlinesnychalf\n* **Time:** 2:35:XX\n\n### Goals\n| Goal | Description | Completed? |\n|------|-------------|------------|\n| A | Under 2:30 | *No* |\n| B | Under 2:38 (PR) | *Yes* |\n\n### Splits\n| Mile | Time |\n|------|------|\n| 1 | 11:08\n| 2 | 11:18\n| 3 | 10:54\n| 4 | 11:08\n| 5 | 11:50\n| 6 | 10:57\n| 7 | 12:30\n| 8 | 11:33\n| 9 | 12:25\n| 10 | 12:49\n| 11 | 12:07\n| 12 | 12:34\n| 13 | 12:34\n\n### Training\nI completed my first half-marathon in Fall 2023 and thoroughly caught the running bug. I spent the first half of 2024 working on my strength and speed and completing the 9+1. I intended to run my second half-marathon in Fall 2024, but I sprained my ankle quite badly in July 2024 and dealt with about 5 months of rehab and overcompensation injuries. I got into the United Half via the lottery this past fall and set my sights on it as my comeback race. I was finally cleared to run regularly in December and was able to complete a full training block!\n\nI used the NRC Half-Marathon plan (14 weeks), which I had also used for my first half. In 2023, I couldn’t ramp up to >3 days a week running without shin splints, but I’ve focused heavily on conditioning and strength training since then and was able to run a lot more for this training block! I ran 4x a week, typically consisting of a coached group speed workout, a solo tempo, a recovery run, and a long run. I peaked at 22 miles a week and logged a little over 200 miles throughout the whole training block. This is relatively low compared to some other people, but I’m a slower runner and this was still 33% more miles than my last training block, so I felt really good about it! And no complaints from my shins or my previously sprained ankle! I’m located in NYC, so most of those miles were early morning, dark, and frigidly cold. I definitely prefer cold weather to hot weather for running, but this winter really tested my willpower.\n\nI spent a lot of time waffling before the race about what my time goal should be. My previous half time was 2:38:XX on a pancake-flat course in a tropical rainstorm. I’ve had about a year and a half of growth since then, but I was also coming off significant injury (and was sick with a cold for my last week of taper). The United NYC Half is a hilly course, but all the hills in the first half were on my home turf, so I know them well and had trained for them. So, overall, there were a lot of factors that made it difficult to predict. I toyed with following the 2:25 pacers, then backed off and decided to run with 2:30. Breaking 2:30 felt like an achievable goal (whoops).\n\n### Pre-race\nLike I said, I came down with a cold on the Tuesday before the race, so I spent the end of my taper sleeping as much as possible and chugging orange juice daily. By race morning, I was feeling about 95% back to normal, which was good enough for me. My wave didn’t start until 9:20, so I got up at 6, stretched liberally, ate my traditional oatmeal + egg, and popped some more Dayquil. Hilariously, I was able to watch the pro runners run the whole course on TV before I even left my house. I live a mile from the start line, so I left at 8AM and jogged slowly to the corrals. I had been placed in Wave 5 corral A, but I dropped back to B so that I could run with the 2:30 pacers. I brought a handheld water bottle and Torq gels for every 5K. The drizzling had stopped by the time my wave started, so the weather was cool, a little breezy, and humid.\n\n### Race\nMiles 1 - 3 - Flatbush and Prospect Park: This is my home territory, and I’ve dragged my way up Battle Hill plenty of times. I started feeling strong and had no issue keeping up with the pacers, who were running noticeably faster than the target pace of 11:27/mile. This was my first issue - I should’ve slowed down. I’ve really been honing my ability to hit negative splits on my runs, but there was little chance of me hitting negative splits down the line if I started out that fast. But the energy was amazing, my partner was cheering me on from multiple locations, and I blasted through the hills and down Flatbush.\n\nMiles 4 - 6 - Downtown Brooklyn and Brooklyn Bridge: Again, this was literally the route I take when I run-commute to work. If anything, Brooklyn Bridge felt a little easier since we didn’t need to get up to the pedestrian level. I still felt strong, but I took the bridge slower than the pacers (who were still blazing!! Very curious if they actually finished in 2:30 or not). Coming off the bridge, I started to lose them. At this point, I was also starting to feel it. By the time we looped around and got onto FDR, I had lost the pacers, and my energy was quickly waning. This is when I started to lose the mental battle.\n\nMiles 7 - 9 - FDR Death March - WOOF I blew up here, and you can see it in my splits. Seeing the pacers race away and realizing that I ran the first half too fast was a mental beating. The boring expanse of FDR was also a mental beating. Despite it being pretty flat, my pace started tanking. I started to tell myself that I wouldn’t even PR after 1.5 years of hard work. My mental grit did not show up for these miles. Eventually the endless highway ended, and I dragged myself up the incline towards 42nd St.\n\nMiles 10 - 13.1 - Midtown, Central Park: The amazing crowds from 42nd St to Times Square to Central Park really helped. At this point I knew I was going slow, but I took some walking breaks and tried desperately to stop beating myself up for it. Once I got through the uphill from Times Square to Central Park and saw my partner cheering again, I grit my teeth and told myself that I would run the last ~1.5 miles and leave whatever I had left out there on the course. The last bit of uphills in the park were mean, but I did it and ran over the finish line with zero gas left in the tank.\n\n### Post-race\nI hobbled out of the security area, found my partner, and put on my new NYC Half sweatshirt. We grabbed beers with a friend, and then I headed home to shower, stretch, hydrate, eat, eat more, and lay on the couch. I was a bit sore on Monday but felt back to normal by Tuesday. None of my former injuries were aggravated!\n\nI had been so confident beforehand that I would break 2:30 and maybe even get a 10-minute PR, but it was not in the cards for this race! STILL I got a tiny little 3-minute PR, tackled a TOUGH course only a few months after a frustrating injury, and was so proud of the effort I put into this training cycle. Next up will be the NYC Marathon, and I’m looking forward to those longer training runs to hone my mental grit and continue my growth as a new runner!\n\n\nMade with a new [race report generator](http://sfdavis.com/racereports/) created by /u/herumph.",
      "author": "angahleen_x",
      "created_utc": 1742399235.0,
      "score": 42,
      "num_comments": 5,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "tiktok",
    "instagram"
  ]
}