{
  "id": "twin_MooFog",
  "username": "MooFog",
  "activity_count": 1,
  "interests": [
    "race",
    "were",
    "this",
    "with",
    "line"
  ],
  "post_times": [
    1746304696.0
  ],
  "history_sample": [
    {
      "id": "1ke2kk3",
      "title": "Race Report: Maine Coast Half Marathon",
      "selftext": "### Race Information\n* **Name:** Maine Coast Half Marathon\n* **Date:** May 3rd, 2025\n* **Distance:** 13.1 mi\n* **Location:** Wells, ME\n* **Time:** 2:23:23\n\n### Goals\n| Goal | Description | Completed? |\n|------|-------------|------------|\n| A | Finish | *Yes* |\n| B | Sub 2:30 | *Yes* |\n\n### Splits\n| Mile | Time |\n|------|------|\n| 1 | 11:11\n| 2 | 11:05\n| 3 | 10:57\n| 4 | 11:08\n| 5 | 11:08\n| 6 | 11:00\n| 7 | 10:52\n| 8 | 11:00\n| 9 | 11:02\n| 10 | 10:44\n| 11 | 11:28\n| 12 | 11:00\n| 13 | 9:56\n| 0.1 | 0:21\n| Average pace | 10:57\n\n### Training\nI am 28/F. This is my second race ever (ran a 5k last September) and my first half marathon. I have been running since March 2024 and never had been a runner in my life prior to this time. I never liked running until a random warm spring day last year when I decided to go for a jog and stuck with it. I was slow but I enjoyed it regardless. I found it to be good for my mental health just as much as my physical health. My running was pretty casual and sporadic 1-2x a week until January 1st of this year when I began the Nike Run Club half marathon training plan. \n\nI stuck to the plan for the most part, save for a few weeks in February when I hurt my knee and took it easy. I ran usually 4x a week and did some light weight training 2x a week. Coming into race week, I felt very prepared and excited for what lied ahead. My husband ran with me and while he did not train as much, he has a background in XC from high school and a base level of fitness appropriate for a HM.\n\n### Pre-race\nWe headed down to Wells yesterday afternoon, stopping to pick up our bibs and swag (branded zip-up fleeces). I was feeling very anxious most of the day--not even because of the race but in general--but these feelings dissipated after we went on a walk by the ocean and got dinner. We sat around a fire at the inn we were staying at to close out the evening. I showered and we got to bed around 8:30 PM...but, we did not sleep well.\n\nThe bed was comfortable enough but the room was warm and the inn did not have their AC units in yet. The mattress and sheets made it so any little movement my husband made I felt and vice versa. The minifridge was loud to the point where we ended up unplugging it in the middle of the night. We were irritated and nervous. We got maybe 5.5 or 6 hours of sleep in total which is less than we normally get most nights.\n\nWe woke up at 4:40 AM and I managed to eat a half a blueberry bagel and drink most of an Alani Nu energy drink. I felt energetic despite the poor sleep. We arrived at Wells Elementary School, our assigned parking location, only for one of the gals directing traffic to say there were few or possibly no spots. We tried anyways and found a spot and walked maybe 15 minutes to the school buses that were set to take us to the starting line. Along the way, we noticed how many empty spots were at the other parking options. \n\nThe bus line was incredibly long, too. The crowd had a nervous, incredulous energy as we all wondered how the hell we were going to start the race on time. It was maybe 6:20 AM at this point and the race was set to begin at 7:00 AM and there were hundreds of people behind us.\n\nWe arrived at the starting point after 6:30 AM. The lines for gear drop and port-a-potties were long and many people were confused about what lines were for what purpose. You could barely hear the announcer. It was after 7 AM by the time we made it to the front of the port-a-potty line. It also had started downpouring unexpectedly. We finally dropped our gear and walked to the starting line around 7:15 AM.\n\n### Race\nAs you can tell, pre-race kind of sucked and I worried the whole experience would be like that. But the race itself went so well.\n\nIt was a scenic course--along the ocean and zig-zagging across the marsh several times. And the rain passed quickly, thank god. We ran in a cloudy haze for the first couple miles which dissipated into some sunshine. There was some sporadic crowd support throughout the course with more towards the finish line and lots of signs that made me smile. The natural beauty of the course was enough to keep me going.\n\nMy husband and I maintained pretty steady splits and did not take a walking break until mile 11, where we walked for about 2 minutes. I was very proud of that, as I imagined we would take more walk breaks. I drank some water and electrolytes from my vest flasks while my husband hit up the many water and Gatorade stops along the way. We each took in 3 gels, at miles 5, 8, and 11 respectively. Once we hit mile 12, we sped things up since we still had some energy in the tank and did our fastest mile split at 9:52. We crossed the finish line hand-in-hand, just like we wanted to :)\n\n### Post-race\nWe almost immediately got on the bus to head back to our car. There was a crash on the main road through town so the bus got rerouted and ended up dropping us off closer to the elementary school, which was nice. We snapped a few photos with our medals, stretched, and drove back to the inn where we took showers and finished packing. Before we even left the parking lot I put in an order at a Five Guys nearby. Lo and behold, there was an accident on the interstate that made a 15 minute drive into a nearly 40 minute one. Once we arrived, the burgers and fries hit the spot, at least. Now we are home, headachy and sore but not too worse for wear.\n\n### Reflection\nI am really happy with how the race went despite not-ideal circumstances pre-race and less than impressive logistics from race team. I was pleasantly surprised with how strong and relatively effortless I felt through the bulk of the race. This gives me a lot of hope for the future of my running practice, and reinforces why I enjoy doing this so much. ",
      "author": "MooFog",
      "created_utc": 1746304696.0,
      "score": 50,
      "num_comments": 31,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "instagram",
    "youtube"
  ]
}