{
  "id": "twin_DoddyUK",
  "username": "DoddyUK",
  "activity_count": 1,
  "interests": [
    "this",
    "that",
    "with",
    "eastleigh",
    "been"
  ],
  "post_times": [
    1743185423.0
  ],
  "history_sample": [
    {
      "id": "1jm1j3j",
      "title": "Eastleigh 10k 2025 - “The home of the PB” lives up to its reputation once again",
      "selftext": "### Race Information\n* **Name:** Eastleigh 10k\n* **Date:** March 23 2025, 9:00am\n* **Distance:** 10 kilometers\n* **Location:** Eastleigh, Hampshire, UK\n* **Website:** https://www.runningmania.co.uk/eastleigh-10k/\n* **Time:** 45:22\n\n### Goals\n| Goal | Description | Completed? |\n|------|-------------|------------|\n| A | 49:07 (New PB) | *Yes* |\n| B | 48:00 | *Yes* |\n| C | 47:00 | *Yes* |\n\n### Splits\n| Kilometer | Time |\n|------|------|\n| 1 | 4:35\n| 2 | 4:36\n| 3 | 4:38\n| 4 | 4:43\n| 5 | 4:15\n| 6 | 4:32\n| 7 | 4:32\n| 8 | 4:33\n| 9 | 4:29\n| 10 | 4:21\n\n\n### Background\n\nThe Eastleigh 10k has always been one of my favourite races on the calendar. Fast, relatively flat and friendly, I've achieved new 10k personal bests on this course for a number of years. In 2023 I even ended up winning the prize for best improver for lowering my 2022 time of 1:06:31 to 49:19 12 months later. Held in the railway town of Eastleigh, a few miles north of the city of Southampton, this was the 40th anniversary of the race and the 39th edition owing to 2020's Covid cancellation. \n\n### Training\nI'm currently in the midst of training for the Manchester Marathon, so a lot of my training efforts have been focused on long-distance endurance. However that training has also had a huge impact on my short-distance times as well. I've had a number of 5k parkrun PBs over this winter, and I'm looking to go sub-22 this spring. Overall I'm feeling very positive about my health and in my late 30s I'm currently the fasest I've ever been. This was also my first 10k event of the year, having been forced to miss the Winchester 10k in February due to illness, and likewise this was my first visit to Eastleigh in two years as I was also ill for last year's event.\n\n### Pre-race\nDespite the start line only being a few miles from my house, I currently don't drive so it was an early start to get the bus and train. Arriving at the Places Leisure Centre just before half 7, I collected my bib and went to a coffee shop up the road for a nice sugary breakfast of a Blueberry muffin and a coffee. I find that a bit of caffeine and easily-digestable sugars help me for shorter distances where I don't need to take any more fuel onboard mid-race. Otherwise I just kept relaxed and ran over the strategy in my head once again.\n\nI saw a few familiar faces from my running club and had a chat, but otherwise I kept myself to myself before the start. The weather was rapidly warming up though, so I took off the extra layer I was wearing. Other than that, it was just a standard pre-race wait.\n\n### Race\nMy target was 48:00, so I placed myself a little bit in front of the 50 minute marker. The start was about the same organised chaos that you get with a single-wave mass start, with some traffic islands to avoid in the first few hundred metres. After that I was able to settle into a rhythm with consistent splits of 4:35, 4:36 and 4:38 respectively. At the time I thought I was maybe going a little fast, but I was going to largely judge things based on the outcome of my main tactic.\n\nAt 3.5km the only significant hill of the course arrived, Allbrook Hill. A 17m gain over 400 metres, this is by no means a tough one but still merited a slight slowdown. However after the up comes the down, a slightly longer 600m stretch to drop those 17 metres once again. Here is where my plan kicked in, as the only major downhill on the course I’d push hard during this fifth kilometre and see how I feel for the second half. I was aiming for sub-4:20 here and got 4:15.\n\nThe second half of the course is virtually pancake flat, with a few minor rises and falls. My average pace was rapidly approaching 4:30/km, so I decided to stick with it in the hopes of getting close to 45 minutes. I already had nearly two minutes in the bank for a PB, so as long as I didn’t blow out then this would be a very successful morning.\n\nKilometres 7, 8 and 9 ticked by at around 4:30/km, and going into the final kilometre I had enough in the tank to push on a little more. The PB was guaranteed, sub-48 was guaranteed, sub-46 was very likely and there was still the outside chance of sub-45. Entering Fleming Park I was looking up trying to judge how far away the finish line was, but knew quickly that sub-45 would be a stretch too far today. I managed to keep pace with a slightly younger woman for most of that home straight, though she left me for dust with a strong burst in the final 200m.\n\nI crossed the line in 45:22, finisher #499, and a new PB by a huge 3 minutes and 47 seconds. I’d also set a PB of 49:19 here two years ago and promptly collapsed after the line, this time I stayed on my feet and I feel that sub-45 would have been achievable in hindsight with a slightly less cautious start.\n\n### Post-race\nI was oddly a lot more calm and collected than I was two years ago. Back then I had ended up reducing my year-on-year time from 1 hour 6 minutes to just 49, and that improvement had genuinely caught me by surprise (I ended up winning the award for best year-on-year improver). I’m not eligible for that prize this year having missed 2024’s edition through illness, and my PB this year felt more like an inevitability even if the degree of improvement was more surprising. Even so, bringing sub-45 right into view is a huge confident boost with a half-marathon coming up next weekend and the Manchester Marathon in a month.\n\nIf you live along the south coast of England and the 10k is your favourite distance, I can’t recommend this event highly enough. No wonder it’s been going strong for 40 years.\n\nMade with a new [race report generator](http://sfdavis.com/racereports/) created by /u/herumph.\n",
      "author": "DoddyUK",
      "created_utc": 1743185423.0,
      "score": 39,
      "num_comments": 6,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "tiktok",
    "instagram"
  ]
}