{
  "id": "twin_TheIrishHawk",
  "username": "TheIrishHawk",
  "activity_count": 1,
  "interests": [
    "that",
    "they",
    "race",
    "event",
    "people"
  ],
  "post_times": [
    1756022086.0
  ],
  "history_sample": [
    {
      "id": "1mypnc3",
      "title": "AsIAm 5k",
      "selftext": "\\### Race Information\n\n\\* \\*\\*Name:\\*\\* AsIAm 5K\n\n\\* \\*\\*Date:\\*\\* August 17th 2025\n\n\\* \\*\\*Distance:\\*\\* 5 km\n\n\\* \\*\\*Location:\\*\\* Corkagh Park, Dublin\n\n\\* \\*\\*Website:\\*\\* [https://asiam.ie/events/run4autism](https://asiam.ie/events/run4autism)\n\n\\* \\*\\*Time:\\*\\* 38:46\n\n\n\n\\### Goals\n\n| Goal | Description | Completed? |\n\n|------|-------------|------------|\n\n| A | Don't die | \\*Yes\\* |\n\n| B | Run the whole thing | \\*Yes\\* |\n\n| C | Sub 40 | \\*Yes\\* |\n\n\n\n\\### Splits\n\n| Kilometer | Time |\n\n|------|------|\n\n| 1 | 6:47\n\n| 2 | 7:32\n\n| 3 | 7:35\n\n| 4 | 8:06\n\n| 5 | 8:28\n\n\n\n\\### Training\n\nI've never been much of a runner. Never really liked any kind of sport. But like a lot of people approaching the wrong side of 40, I needed to lose weight so I started jogging. No plan, no programme, had flunked out of Couch to 5K a few times so I just said I'd run to the next lamp post, the next Pokestop, whatever. Gradually, it became easier to run for a whole song, then a few songs and so on. It got to where I needed to buy proper trainers, proper shorts, something to hold my phone, that kind of thing. Wasn't breaking any land speed records but I was able to do 5-6 km at a time a few times a week. For a few years now, an Autism charity in Ireland has had a 5k run event. It's advertised as accessible and for all ages, abilities and so on but I'd never had any interested in going. This year, as I was starting to get into running, I said I'd sign up. I'm autistic so I figured it would be nice to raise some money for the charity and give something back to my community.\n\n\n\n\\### Pre-race\n\nMy wife was working and I didn't really have any friends who were interested in coming along with me, so off I went on the day on my own. The race was due to start at 12 but the event started at 11, so I said I'd get there for 10:30 to beat traffic and crowds. I figured I could sit in the grass and read my book or just relax and wait for the event to start. The first thing I noticed was how busy it was already. Everyone had my idea, get there early. There was plenty of space but it was already kinda hectic. Next thing was: no bag drop. I had just a change of shirt and some food but there was nowhere to put it, which I thought was a bit of an oversight. I think I was quite unique, almost everyone there had someone with them that was waiting around the finish zone that was holding their stuff. It was definitely more of a family fun day than a race event. Waited around until 11:40 or so and then they kinda called everyone over to do some kind of warm-up and have a little talk about it. They say to not change anything on a race day and I guess that really applies to Marathoners but for 5k, it's probably less important. Still, the race was starting way later than I'm used to (I usually run before work around 7am) and so that was a bit different for \"fuelling\". The other thing was that I never really do a warm up. I stretch my legs a little and walk to my starting point and then run a little slower than my pace until I feel warmed up. This warm up was pretty full on, something that actually tired me out quite a bit ha ha.\n\n\n\n\\### Race\n\nEventually, we all got warmed up and lined up and here we go. As the event was accessible, there was plenty of non-runners, walkers, kids on bikes or scooters, people with dogs, everything you could imagine. There was no instructions from the organisers for people to line-up by category or ability or anything (part of the event is the idea of giving everyone the same chance in life, so it all feeds into that). This meant a solid kilometre of having to dodge around people, running on grass and whatever way I could to get around them. Again, as someone who only runs on my own at unsociably early hours, this was a new experience and I didn't care for it. It also meant I went out waaay too fast and had to really reel it back in. I guess some form of adrenaline or excitement kicked in. I eventually found my rhythm, even settling in with some people around the same pace as me (I assumed). One group would walk for half a k or so and then run for half a k. When they walked, they blocked the whole path and I had to run around them to get past. When they ran, they would overtake me comfortably and then spread out in front of me again when they slowed down to walk. That annoyed me a little but at one point I overtook them and they never came past me again, so I guess I won.\n\n\n\nAnother thing was how hot it was. I know other people run in hot weather but I am not used to it. Usually by the time I finish my run, it's way before the hottest part of the day. It was 22c by the time we got going, unbearably hot for me when I'm not running, never mind when I'm trying to do a 5km. I could really feel myself flagging for the last 2km and they were below my pace. Luckily, my first 3 were fast enough that I was still able to finish under 40 minutes. I don't know if this is normal for an event like this, but the run tracker I use was a little off, not showing 3k until I was about a minute after the marker. On the final stretch, the markers said 500 m to go but my tracker was saying 700 meters. Then, right at the finish line it synched up to 5km and I was so tired I didn't know what had happened (except that I had finished and hit my target). Not sure if that's normal. They also told me the course was flat but my Runkeeper told me I'd had the 3rd most elevation change of any run I'd ever done, so something's not right there ha ha\n\n\n\nSomething that was a little fun was right at the finish line, two little kids had their hands out to give 5 to the runners but no-one running past was paying them attention (at least from when I spotted them). So as I ran past, I somehow mustered the strength to stoop down and slap their palms and they seemed delighted. I have seen people do this at race events so I was glad I was able to do it, as silly as that sounds.\n\n\n\n\\### Post-race\n\nFinished the race and got my medal. Felt good. Found a patch of grass and sat down to take a selfie and show off my medal, message my wife and friends and just catch my breath. The post race zone had a water station, so I went over and had some water. Everything else was really busy (coffee place, ice cream van and a sandwich place) and I was pretty exhausted and didn't fancy standing around for much longer, so I headed off. If I was to do this again, I'd make sure I had a few people with me, even if they're not running, because it's more of a family event. I'd also probably get a bit closer to the front for the start to avoid people pushing buggies and with dogs on leads. Speaking of pushing buggies, a guy ran the whole race in front of me pushing his kid in some kind of sports buggy and when I got to the finish line, they were giving the baby a medal. I didn't see if they awarded any dogs a medal. A running club near where my dad lives is doing a 5k for the same charity in November. It's not a family friendly event so I might sign up for that to see what that kind of race is like.\n\n\n\nOverall, my first ever running event, I didn't have a bad time but I like running solo for now.\n\n\n\n\n\nMade with a new \\[race report generator\\](http://sfdavis.com/racereports/) created by u/herumph.",
      "author": "TheIrishHawk",
      "created_utc": 1756022086.0,
      "score": 15,
      "num_comments": 3,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "youtube"
  ]
}