{
  "id": "twin_TopInside709",
  "username": "TopInside709",
  "activity_count": 1,
  "interests": [
    "running",
    "this",
    "every",
    "i’ve",
    "mile"
  ],
  "post_times": [
    1744342809.0
  ],
  "history_sample": [
    {
      "id": "1jwgprb",
      "title": "I’ve run every day for the past 100 days… here’s what I’ve learned!",
      "selftext": "Today is day 100 of running 1 mile or more every day.\n\nI am gathering a few thoughts from the past 100 days and hopefully they help someone else who is new to running. \n\nFor context I am new to running. I’ve been running a little over a year. As part of my weight loss journey I made a journal entry in October of 2023, the goal: run one mile without stopping. Today I have run over 225 miles this year and completed two half marathons. Somehow I went from hating running to it being my passion. \n\nThis was not my New Year’s resolution or anything and honestly I accidentally fell into it. At the end of last year I purchased 2 pairs of running shoes and wanted to decide which was the right fit for me, I kept running a mile in one and then a mile the next day in the other. My goal was to run in each one enough to decide which to keep and which to sell (You know where this is going.. I have both pairs still.) I got about 2 weeks in and decided I would only keep it up if I didn’t get injured. I am happy to report that I am injury free! \n\nInjury prevention:\n\nAs many do, I went too hard the first few months when I started running and was injured a lot of 2024. I had a ton of feet problems, runners knee Achilles tendinitis and hip flexor issues. I spent way too much money on acupuncture, orthotics, PT, braces, pt equipment, massage guns and had whiplashes of running hard one month then being unable to run the next month. I only ran 1 mile in November due to peroneal tendinitis and physical therapy.  So how did I go from barely being able to run one time in November to running every day this year? If you sign up for my… just kidding. Being careful and building strength in my legs and feet. Strength training is easy to forego but leg days helped to give me a solid foundation to work from, specifically helped remove any knee pain. PT exercises for my feet, calves and glutes have helped tremendously as well. Most bang for your buck, toe yoga, calf raises, squats and glute bridges. A PT is going to yell at me for not including RDLs, so add those if you want. In addition to the basics for strength and conditioning one of best things I’ve found is to A. Get fitted for the right shoes and B. Use a rotation. Most runners will tell you a solid rotation consists of a daily trainer, a speed day shoe, a max cushion/recovery shoe and a race day shoe. My rotation has been focused on strengthening and protecting my legs while pushing mileage. I have focused on varying drops as well as different stack heights. This has helped strengthen different muscles in my feet and legs.. personally I fall back on high drop and stack when I’m sore and go very slow. \n\nKnowing I am going to run again the next day has helped me to not push myself to hard. I’ve been able to slow down and make so much more progress by being careful.\n\nThis has been a blast but has had plenty of challenges. First being time. Finding time to run every day means running in the rain, running at midnight, running in the snow, running on lunch breaks… time on a run takes time from the family.  My wife has had it way harder than I have. One of the biggest challenges I faced was running while sick. I’ve only run on a treadmill twice, and that was while I was traveling for a funeral while also sick. The week I was sick I did every run super slow and didn’t go over a mile. I’m not suggesting this but I was too deep into the streak to not at least try. Another challenge has been running while sore, obviously right? All of February I would wake up with my calves completely locked up and sore. I was shocked how bad they got.. pushing through that month was worth it, my legs adjusted and I only feel sore now after a long run or big workout. But for a while there I thought it was going to be that bad every day.\n\nFinal thoughts, I really hope this encourages someone else to get out and get some miles in. Would I suggest running everyday? No, it’s probably not the best idea medically but everyone is different. For me, running every day has been the most fun challenge, and has helped to prevent more injury. The steak continues tomorrow!",
      "author": "TopInside709",
      "created_utc": 1744342809.0,
      "score": 199,
      "num_comments": 51,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "tiktok",
    "instagram"
  ]
}