{
  "id": "twin_Professional_View914",
  "username": "Professional_View914",
  "activity_count": 1,
  "interests": [
    "running",
    "love",
    "then",
    "shin",
    "miles"
  ],
  "post_times": [
    1743166611.0
  ],
  "history_sample": [
    {
      "id": "1jlufhk",
      "title": "I love running, running hates me",
      "selftext": "TLDR: Seeking advice from others who love running, but their body doesn't always agree. \n\nStory version: Running was my (33F) first love. I feel like I non-stopped ran/played as a child. Then, in middle school I started running the mile and 800m competitively. I was good and I loved it. When I got to high school, I started running cross country and continued to excel. But, then, I got hurt. I ran so much that I got a stress fracture in my shin. I had an MRI and then PT, and then custom orthotic for my right shoe. I had to stop running for a bit. I came back and was never the same. I went from 6-7 minute miles to 10 minute miles. Since then, I've run on and off. I still love running, but it seems every time I get in the groove (running 3+ times/week), I get injured. I'm constantly battling the shin splints and occasionally have had other issues such as IT band and foot pain. I wear stability shoes because of my hx of problems. I do all the things - strength work, balancing work, stretching, ab work, building up, etc. I'd love to be able to run far and even train for a 5k - 10k again. Right now, I'm doing about 2.5 miles several times a week and feel the shin splints again (on both legs). \n\nI'm wondering if there are any others who've had a similar experience? Is this just the way it goes for some people? Do you just do it on and off for the rest of time? It bums me out to love something so much that doesn't love me back hahaha. ",
      "author": "Professional_View914",
      "created_utc": 1743166611.0,
      "score": 747,
      "num_comments": 269,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "instagram",
    "youtube"
  ]
}