{
  "id": "twin_CarpNY",
  "username": "CarpNY",
  "activity_count": 1,
  "interests": [
    "that",
    "from",
    "laces",
    "heel",
    "running"
  ],
  "post_times": [
    1753546849.0
  ],
  "history_sample": [
    {
      "id": "1m9xg5q",
      "title": "Lace pain from locking heel",
      "selftext": "I was recently told by my podiatrist that I need to wear a larger size shoe (in general, not just running). Basically, I was using a tight heel and toes to keep my foot from sliding in the shoe, which was bad for my nail matrices. After reading a bit, it sounded like many people like a thumb width between their toes and the end of their running shoes, so I also bought bigger running shoes (up 1 1/2 sizes, which tells you how cramped they were).\n\nEdit: to clarify, I was wearing 1 - 1 1/2 sizes below what I measured, so he was not suggesting wearing some that was 1 -1 1/2 sizes too big, just bigger.\n\nMy problem is that now, in order to keep my foot from sliding forward, I have to use the laces to lock the foot back. I've tried several ways to tie my shoes, including the traditional method, the runner's lock (creating loops in the last two eyelets that the laces then pass through), and several modified versions of the lock. Regardless of what I do, to keep my heel back, it feels painfully tight on the tendons right at the bend (under where the laces usually cross last). Even avoiding having the laces cross directly over that spot by going from the upper eyelets directly to lower ones, only helped slightly.\n\nI can run with it that way, but it is not at all comfortable, leaving that spot tender afterwords. I've experienced this in both Hoka Clifton 8's and Saucony TR17's.\n\nAm I missing something? Any suggestions? Padding?\n\nEdit: Sorry for my delayed responses.  My post was being moderated for a while, and then I went on vacation.",
      "author": "CarpNY",
      "created_utc": 1753546849.0,
      "score": 6,
      "num_comments": 29,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "instagram",
    "youtube"
  ]
}