{
  "id": "twin_GoutRunner",
  "username": "GoutRunner",
  "activity_count": 1,
  "interests": [
    "that",
    "race",
    "this",
    "marathon",
    "training"
  ],
  "post_times": [
    1746576576.0
  ],
  "history_sample": [
    {
      "id": "1kgjvb3",
      "title": "Race Report - 2025 Revel White Mountains Marathon - BQ Attempt (44M)",
      "selftext": "\n### Race Information\n\n* **Name:** REVEL White Mountains Marathon \n* **Date:** May 4, 2025\n* **Distance:** 26.2\n* **Location:** Conway, NH\n* **Website:** https://www.runrevel.com/rwm\n* **Strava:** https://www.strava.com/athletes/43172262\n* **Time:** 3:07:39\n\n### Goals\n| Goal | Description | Completed? |\n|------|-------------|------------|\n| A | Sub 3:10:00 | *Yes* |\n| B | Sub 3:15:00 | *Yes* |\n| C | Sub 3:26:00 | *Yes* |\n\n### Splits\n| Mile | Time |\n|------|------|\n| 1 | 6:54\n| 2 | 6:47\n| 3 | 6:52\n| 4 | 6:47\n| 5 | 6:52\n| 6 | 7:21\n| 7 | 7:18\n| 8 | 7:41\n| 9 | 6:43\n| 10 | 7:30\n| 11 | 7:50\n| 12 | 7:42\n| 13 | 7:12\n| 14 | 7:03\n| 15 | 7:10\n| 16 | 7:10\n| 17 | 6:52\n| 18 | 7:23\n| 19 | 7:23\n| 20 | 6:42\n| 21 | 7:12\n| 22 | 7:03\n| 23 | 7:02\n| 24 | 7:18\n| 25 | 7:05\n| 26 | 7:15\n| 26.2 | 6:20\n\n| 1st Half | 1:34:14\n| 2nd Half | 1:33:25\n\n\n### Background \n\nI am a 44 year old male (152 lbs) with several years of casual running experience. In recent years, I’ve attempted to mitigate my mid-life crisis by investing a lot of time and energy in running. Have run 8 half marathons over the course of the past 20 years. On February 8, 2025, I achieved my half marathon PR of 1:30:50. (That race report is [here](https://www.reddit.com/r/running/s/43hAAUI7gU).) \n\nI ran my first full marathon in NYC in November 2024 (3:26:31). I registered to run this White Mountains Marathon in May and the Berlin Marathon in September 2025. My goal—which felt extremely ambitious—was to qualify for Boston in one of those next two races (3:15:00).\n\n### Training\n\nI followed the Pfitz 18/55 plan for this training block. After a full week off following the NYC Marathon, I ran approximately 40 miles per week through the rest of November and December. I officially started the Pfitz plan on 12/30/2024. The Mesa Half Marathon, where I achieved my PR, marked the end of Week 6 of that 18-week marathon training plan. \n\nTraining went well for the bulk of this block. I converted one lactate threshold workout to a general aerobic run after the half marathon but otherwise completed every workout and long run as scheduled in the plan. I trained based on a goal time of 3:10:00 to account for a Boston cutoff that I hope will be 5 minutes or less.\n\nHere is a breakdown of the rough pacing I used as a guide during this training block based on my perceived level of fitness and goal time:\n\n| Pacing Category | Heart Rate | Pace Range |\n|------|-------------|------------|\n| Marathon Pace | 82-88% Max HR | 7:15/mi |\n| Lactate Threshold | 82-91%% Max HR | 8:20-9:04/mi |\n| General Aerobic | 72-81% Max HR | 8:20-9:04/mi |\n| Long Run | 75-84% Max HR | 7:59-8:42/mi |\n| Recovery | <76% Max HR | >9:26/mi |\n\nI did try to be aware of my heart rate but I was not a stickler about remaining in the recommended range, particularly for faster efforts and on long runs. If I’m honest, I still struggled to slow down as much as I should have for some of the lighter efforts. My general aerobic runs were probably closer to the 7:55-8:20/mile range. On recovery runs I would sometimes get a few miles above 9:00/mile but seldom did I average over 9:10/mile for any of those runs. \n\nThe most challenging workout during this block was about five weeks out from race day: an 18 mile long run with 14 at marathon pace. I did hit the goal pace but that run took a lot out of me and left me questioning whether I could actually hold a 7:15/mile pace on race day. Aside from the Mesa Half Marathon early in the block, I did not do any tune up races during this cycle. Instead, I incorporated two 10K runs that I ran hard—short of an all-out effort but faster than lactate threshold. Those were both great for building confidence and helping me to assess where my fitness was in the lead up to the race. I ran the first of those in 41:09 and the second one at 40:35. Both of those times represented new PRs for me at that distance.\n\nI did some hill work (uphill and downhill) throughout the course of the training block but not as much downhill as I thought I should have given the nature of this downhill course. There are a lot of rolling hills where I run so I think that even though I wasn’t doing “hill-specific” training, my legs were getting at least some of that conditioning in the course of my general training schedule.\n\nI tapered for approximately three weeks consistent with the dictates of the Pfitz plan. I was feeling pretty achy and sluggish in that final week before the race. Was definitely in my head but tried to put trust in my knowledge that I followed every step of the plan through the entire 18 weeks.\n\n### Training Conditions and Gear\n\nI live in Maine. Due to cold and icy conditions, I completed about 50% of my training runs on a treadmill. As an older runner and one who is newer to more structured training, the major challenge has been to increase mileage while keeping the risk of injury as low as possible. Have had some slight but ongoing discomfort in my right hamstring and Achilles tendon but I managed to keep those discomforts from developing into anything more debilitating in this training block. I try to do basic strength training about twice a week. (After the Mesa Half Marathon, I noted that I wanted to develop that component of my training more but I have not really done this. I am hoping I can be more structured when I transition to my training for Berlin.)\n\nI train almost exclusively in the Hoka Skyward X. I have gout and hallux rigidus (stiff big toe arthritis). The stiff plate, aggressive rocker, and cushioning have helped mitigate the symptoms of those conditions. Prior to finding this trainer, I experienced recurring and sometimes debilitating pain in each of my big toes. Because of the shoe adaptation and more careful monitoring of flareups, I made it through almost all of this training block with any significant disruptions in my training schedule due to health reasons. \n\nI did about a handful of my speed workouts in Hoka Cielo X1, which provides a plate to protect my toe along with responsiveness and bounce from the foam that helped generate some really snappy workout efforts during these months. \n\n### Pre-race\n\nArrived in New Hampshire on Saturday morning. Attended the race expo that afternoon. The expo was fairly standard. Not a lot of swag but good energy and efficient setup. I also picked up a pacing bracelet. I had spent a lot of time thinking about pacing and had a plan in mind. The bracelet was generally consistent with what I planned based on my pre-race research. \n\nWe stayed at the Hilton2Suites, which was one of several hotels affiliated with the race. (It was also dog friendly.) Cost was reasonable, the accommodations were comfortable, and the location was just minutes from where I needed to catch the shuttle to the starting line on race morning.\n\nI was fairly diligent with carb loading and hydration for the few days leading up to the race. I tend to have a sensitive stomach so I tried to keep things as simple as possible. Lots of bagels and pasta. I ate a plain pasta dinner at around 4:00 p.m. on Saturday. I was in bed by 7:30 p.m. although it took me a while to fall asleep. \n\nI woke up at 3:05 a.m. Had a few sips of coffee to get that essential plumbing moving. Success. Expecting a lot of rain, I applied more Body Glide than usual. Very glad I did! I caught the shuttle at around 3:40 a.m. It was about an hour ride from the shuttle pickup to the staging area at the start. I ate a bagel and finished my coffee during that ride. \n\nIt was a very wet morning but thankfully not too cold—low 50s F. Arrived at the staging area, used the porta potty and then did my best to hunker down, thinking about my efforts to get to that moment while sipping sports drink for the next 45 minutes. \n\nI had a disposable poncho and layers of disposable clothing to stay warm and (mostly) dry. Was happy that I wore different shoes and socks on the shuttle. It was very nice to put on dry racing shoes (Alphafly 3) and socks to have relatively dry feet at the start of the race.\n\nThere was not a ton of space for warming up but because of the wet conditions small crowds (approximately 1200 racers), my pre-race routine was not bothered or derailed. After a short delay, the race started under steady rain at around 6:15 a.m.\n\n### Race\n\nMiles 1-5\n\nThe decline in these initial miles is significant (about 1400 feet). My plan was to go out at around 7:00 pace but given the substantial decline, I was flexible about going quicker based on my perceived effort. My paces were, in fact, quicker than planned but I truly felt that my effort was well within the range that I would expect for the start of a race. \n\nThe downhill was certainly noticeable—significantly smoother (and easier) than the start of the NYC Marathon (or most of my long runs, frankly). I worked on maintaining a quick cadence with short strides to put as little pressure as possible on my quads as I navigated the downhill. That seemed to work for me. I didn’t notice any more muscular fatigue in this downhill segment (or overall on this downhill course) than I do in any other race or long run effort. \n\nMiles 6-10\n\nWhile still feeling relatively fresh and composed, these next five miles for me were about settling in. Before the race, there was quite a bit of chatter about the uphill segment coming between miles 10-12. I was a bit in my head about that incline. \n\nI didn’t know if I would use the pacing bracelet but I found it very helpful during this segment and then throughout the remainder of the race. Because the pacing band is calibrated to account for elevation changes, it was a useful tool to gauge my effort in the context of where I was “supposed” to be at each mile marker in the race. With the assistance of the bracelet I approached the uphill segment knowing that I was about one minute ahead of the prescribed pace for a 3:10:00 finish. That buffer gave me peace of mind and freedom to moderate my pace as needed to minimize exertion during the climb.\n\nMiles 10-12\n\nThe hill takes place in an up-and-back segment of an otherwise point-to-point course. It was challenging but when I got to it I felt prepared for it. Perhaps expecting something even more daunting,  I was able to lean into my experience running on rolling hills during the training cycle to navigate it fairly smoothly. It was approximately 200 feet of vertical and mostly gradual. I did allow my pace to drop significantly through this portion to prevent excessive fatigue but I did not feel at all derailed from my overall race plan and was still able to make it through this segment slightly quicker than contemplated on the pacing bracelet. \n\nThe turnaround for the descent was very motivating. It was still too early to start feeling like I was “in the clear” but having observed several runners knocked down by the hill, I was feeling relieved and confident that I still felt strong and relaxed.\n\nMiles 13-20\n\nThe field noticeably cleared after the half marathon marker. By the half marathon mark I was feeling mostly recovered from the uphill effort. My breathing was relaxed and I was settling back in around goal pace. \n\nThis chunk of the race was described as “rolling hills” but it definitely felt more flat and downhill. There were a few short blips with slight climbs but, at least based on my experience, future racers should take heart that any perceived inclining segments in the latter half of the course are short lived.\n\nI do think it is worth flagging the substantial camber in the road throughout much of the course. It wasn’t just in this segment but I think I was noticing it a bit more at this point in the race. I tried to be as strategic as possible, running at the center line of the road to minimize hip fatigue and using the camber to assist my effort to run some micro tangents and do my best to run no more than the straightest line through the course as the road weaved back and forth. \n\nI’ll also note here that my decision to stay toward the peak of the camber as much as possible also helped me avoid puddles and runoff that were present on a recurring basis on this very rainy morning. \n\nMiles 20-26.2\n\nI felt very good when I hit mile 20. I continued to feel strong and was beginning to feel more confident that I would be able to hang on to reach my “A” goal. My stride still felt smooth and my breathing remained controlled. \n\nThen, almost out of nowhere, I felt the threat of stitch coming on at mile 23. I tried not to panic. I was about to have my 5th gel but decided to forego it. I opted to suck on a salt tab and got a good sip of water at the next mile marker. (I had a few salt tabs over the course of the race. I feel like they help mitigate the sweetness from the gels and also help keep my electrolytes in check.) I slowed slightly, focused on breathing, and pushed through it. \n\nBy mile 24.5 that discomfort mostly subsided and I forged ahead to the finish, with a final 10K under 44:00. I busted through the finish line with a sense of pride, accomplishment, and euphoria that, I suppose, are what this is all about. \n\nOh, and I got that BQ!\n\n### Post-Race and Overall Impressions \n\nThe course was spacious and comfortable throughout. The immersion in nature is fantastic but beware that there are almost no spectators in this race until mile 25+. I wondered what that would be like and whether I would want headphones to help carry me through it. I decided against headphones and I don’t regret it. \n\nFor a Mainer who feels quite at home in the damp woods of New England, being able to hear the cascade of the river and streams throughout the course was very nourishing. I felt extremely focused and at peace throughout the entire run. I absolutely loved the crowds of the NYC Marathon but this race demonstrated that I can still conjure that race energy and adrenaline in the near silence of the White Mountains with nothing but the sounds of my breath, the cadence of my shoes hitting the pavement, and my own thoughts for 26.2 miles.\n\nI truly didn’t know whether a BQ was in the cards for me. I am so grateful for my health, my mobility, and the support of my incredible wife, which have all made this running journey possible for me. I feel so fortunate to have had this experience. \n\nI know that the Revel marathons are the source of all kinds of strong feelings for some runners. I tried not to engage with too much of that because I didn’t want to absorb any negativity that could impact my goals or undermine the value I place on the work I put in to get here. Qualifying for Boston has been a driving force for me during these past 2.5 years as I have built towards this. After New York, I knew that the downhill course would increase my chances of achieving that goal. But I knew it wouldn’t be easy. And it wasn’t easy! I  worked my ass off and I got the BQ. I did that with a lot of love and support from people around me and a lot of diligent commitment to myself. I am so emotional and so excited about that. But I also learned so much during this training block and in this race—about running, about myself as a runner, and about myself as a person generally—that is worth so much more than the numbers on the clock at the end of the race. \n\nWhether you seek a BQ, a PR, or you just want to tackle a different type of race where you truly have the opportunity to block out the noise in your life and do something special, I wholeheartedly recommend the White Mountains Marathon. \n\nI am very excited to continue on this journey! \n\nNext stop: Berlin! \n\n\nMade with a new [race report generator](http://sfdavis.com/racereports/) created by /u/herumph.",
      "author": "GoutRunner",
      "created_utc": 1746576576.0,
      "score": 38,
      "num_comments": 4,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "youtube"
  ]
}