{
  "id": "twin_JetMcFly",
  "username": "JetMcFly",
  "activity_count": 1,
  "interests": [
    "running",
    "your",
    "myself",
    "pregnant",
    "that"
  ],
  "post_times": [
    1750353947.0
  ],
  "history_sample": [
    {
      "id": "1lfgm3r",
      "title": "Running through pregnancy and postpartum",
      "selftext": "I want to share my experience of staying in running shape while pregnant so hopefully other pregnant runners can see that you don't have to give up on running! Disclaimer: you should always check with your OB-GYN wether running is an appropriate form of exercise for you and take it easy postpartum until you are cleared to exercise again.\n\nRunning shape before I got pregnant: ran between 1-3 times every week for years, participating in one half marathon race every spring for the past 10 years, best half marathon time is 2 hours 3 minutes, worst is 2 hours 17 minutes. I'd call myself a consistent but slow runner.\n\nAdjustments while I was pregnant to keep running:\n\n1. No morning runs before breakfast. This was a big adjustment for me, since I usually trained early in the morning. But having low blood sugar while exercising when you're pregnant is not fun (it makes morning sickness symptoms worse) and not a strain you want to put on your body.\n2. Invest in a good quality maternity belt. Think of it like a sports bra for your growing belly. It reduces the discomfort of your belly bouncing up and down on your bladder and pulling on your muscles and ligaments.\n3. Don't exceed 140 bpm heart rate. This was the recommended max heart rate from my OB Gyn, I used a smart watch to track my heart rate. Most of the time I did not have the energy to push myself harder than that rate anyways, the only exceptions were running up hill and running at a higher altitude.\n4. Find a different way to stay fit once running is no longer an option. At 7 months I had to throw in the towel because running went from uncomfortable to painful. I am lucky enough to have easy access to a pool, so I started swimming 30 minutes every day instead. This was amazing for two reasons: I stayed fit so I had the energy to go through labor (which they say is the equivalent of running a marathon) and I got all the happy effects of swimming (getting my heart rate up, feeling weightless, cooling down).\n\nActions I took postpartum:\n\n1. Walk every day until cleared for other exercise. The first six weeks are very limited in what's allowed, I was advised to only go for walks and slowly increase the distance I walked, which is what I did. I started with walks around the block and slowly increased them to walking for an hour or two each day with the baby in the stroller. Also a great way to get indirect sunlight for the baby to help them overcome their jaundice.\n2. Buy myself a new pair of running shoes with extra cushioning. I gained 40 lbs when pregnant and quickly lost about 25 lbs in the first few weeks postpartum. That still puts me at 15 lbs over my pre pregnancy weight and the extra cushioning helps my knees and ankles feel better. I also treated myself to a new pair of walking shoes to make my daily walks more comfy as well. Definitely worth the investment.\n3. Buy myself new running shorts that fit comfortably for my new body. I might lose the weight I gained, but the best way to do that is by exercising and I feel more motivated when my clothes fit well and are not too tight. Worth spending a couple of dollars on shorts I will wear constantly for the next couple of months.\n4. Stretch stretch stretch. Constant walking made my glutes and upper thigh muscles pretty tight, which is not good for my lower back. Doing a daily yoga routine of cat cow, reverse pigeon and supine twists really helped my back. I also pay more attention to the position of my pelvis and the tightening of my abs when walking and running to prevent myself from training with a hollow back (9 months of having a belly pull your spine forward requires some active focus to get your posture back).\n\nThe result: I went for a run the day I was cleared for exercise at six weeks postpartum. It was amazing. I ran for 30 minutes straight at 10:30 per mile. I felt like I was flying around the trail and I was so happy to be able to run again I kept taking little sprints. Afterwards I felt great. The next day I was a bit stiff and my next run was significantly slower at 11:30 per mile. Since I've been cleared I've ran roughly every other day and I'm fairly confident I'll be able to run a half marathon in fall.\n\n",
      "author": "JetMcFly",
      "created_utc": 1750353947.0,
      "score": 158,
      "num_comments": 26,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "youtube"
  ]
}