{
  "id": "twin_Knightbear49",
  "username": "Knightbear49",
  "activity_count": 3,
  "interests": [
    "that",
    "strava",
    "users",
    "runna",
    "will"
  ],
  "post_times": [
    1747833946.0,
    1744900309.0,
    1743074395.0
  ],
  "history_sample": [
    {
      "id": "1krxs3e",
      "title": "[TheVerge] Strava updates its AI route planning and cheater detection﻿. 4.45 million undeserving entries have already been removed from leaderboards.",
      "selftext": "\n>Strava is making it easier to plan workouts and keep activity leaderboard rankings fair. The updates rolling out over the coming weeks focus on helping users optimize their workout routes to compete against other users and their own personal bests, building on some of the [existing AI features that Strava announced last year](https://www.theverge.com/2024/5/16/24158290/strava-ai-dark-mode-night-heat-maps-family-subscription).\n\n>Anyone paying for a Strava subscription (starting at $11.99 monthly) can now access a new AI-powered routes experience under the Maps tab that should provide more intuitive suggestions based on popular routes enjoyed by other Strava users. Users can generate community-backed routes from custom starting points or their current location, pulling data from Strava’s heatmaps feature.\n\n>Other route-related updates will be rolled out to the Strava mobile app in the coming months, including changes to the tappable points of interest (POI) feature that currently enables subscribers to instantly generate routes to cafés, restrooms, viewpoints, and other locations. Starting in June, POI’s will also display elevation, distance, and estimated arrival time information, and allow users to upload photos of the location. Point-to-point routing will also launch in July, which uses heatmaps and machine learning to deliver “the most efficient, activity-specific route from A to B,” according to Strava.\n\n>Strava is also doubling the number of live segments, which allow users to view real-time performance data and achievements in sections of their route, and introducing additional data screens for subscribers.\n\n>Finally, Strava says it’s “continuing to advance” the AI-powered Leaderboard Integrity feature it launched to weed out cheaters on cycling and running paths. The company says that 4.45 million activity logs have been removed so far that carried the wrong sport type, or were recorded in vehicles — which is an easy way to fabricate scores now that e-bikes can make anyone the king of a mountain.\n\n\n\n[https://www.theverge.com/news/671452/strava-ai-routes-leaderboard-update](https://www.theverge.com/news/671452/strava-ai-routes-leaderboard-update)",
      "author": "Knightbear49",
      "created_utc": 1747833946.0,
      "score": 512,
      "num_comments": 73,
      "subreddit": "running"
    },
    {
      "id": "1k1e9da",
      "title": "Strava acquires massively popular Runna app",
      "selftext": "> Meanwhile, Runna burst onto the scene in 2021 and has quickly climbed the app charts for folks in need of 5K, 10K, or marathon training plans. Since launch, it’s secured an additional $6.3 million in funding for its AI-powered run coaching, with users spanning 180 countries. In 2024, Runna also tripled the size of its team and is currently hiring roughly 50 roles to expand the product and tech\n\n> “For a while, Strava had created static, document-based plans for runners but the reality is those were used very, very infrequently,” Strava CEO Michael Martin says. According to the company’s research, the lack of guidance was a pain point for longtime users and newcomers to the app. “We came to realize that, as it related to runners, that guidance was training plans.”\n\n> “Effectively, nothing changes for the user out of the gate. Our plan with this acquisition is to invest further into growing the Runna app, invest in the Runna team, and then continue to operate them as independent but in an integrated fashion,” Martin says, adding that once the deal is fully wrapped, users can expect to start seeing changes in the coming weeks and months.\n\n> “The ambition is to do things where it makes sense,” adds Runna cofounder and CEO Dom Maskell, who notes a more seamless integration between the two apps would help create a smoother user experience. “It’s like, the user comes on and they want to see what run they’re doing today. That sits in Runna, and then they want to go find a route for that run — that sits in Strava. Then, if they want live coaching, that’s on Runna and then Strava frankly has better tech than us for recording on your phone. At the moment, the user kind of gets passed off quite a lot of times.”\n\n> One thing that hasn’t been decided yet is how subscriptions will work. Strava has a free tier but charges $79.99 a year for premium features, while Runna costs $119.99 annually. While Runna currently uses Strava’s third-party API, until the details are hammered out, users will still need to subscribe to both services to get the full range of features.\n\n> “We’ve got quite an active Reddit community, and I know there’s probably quite a large overlap between them and the strong voices in the comment section,” says Maskell. “We try to be very transparent and open with them, and I genuinely believe this is an amazing thing for all users. I’m happy to tell everyone about it and sit on Reddit for the whole day to answer everyone’s questions.”\n\nhttps://www.theverge.com/tech/648075/strava-runna-acquisition-running-fitness-tech",
      "author": "Knightbear49",
      "created_utc": 1744900309.0,
      "score": 619,
      "num_comments": 166,
      "subreddit": "running"
    },
    {
      "id": "1jl1k38",
      "title": "Garmin adds AI and a subscription tier to its app",
      "selftext": "> It was only a matter of time. Garmin announced today it’s launching Garmin Connect Plus, a premium tier to its app that adds AI-powered insights and a few other expanded features. Existing and new Garmin users will be able to opt in to a free 30-day trial and then choose between a $6.99 monthly or $69.99 annual subscription. All existing health data and features, however, will remain free.\n\n> “Developing a premium tier enables us to extend our investment in the Garmin Connect platform, both in terms of features that carry additional cost to provide and also in scaling out our engineering teams to build and maintain these features,” says Garmin spokesperson Natalie Miller.\n\nhttps://www.theverge.com/news/636211/garmin-connect-plus-subscription-wearables",
      "author": "Knightbear49",
      "created_utc": 1743074395.0,
      "score": 407,
      "num_comments": 261,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.97,
  "channels": [
    "tiktok",
    "instagram"
  ]
}