{
  "id": "twin_schmauften",
  "username": "schmauften",
  "activity_count": 1,
  "interests": [
    "that",
    "marathon",
    "training",
    "first",
    "hours"
  ],
  "post_times": [
    1744046804.0
  ],
  "history_sample": [
    {
      "id": "1jtqx6v",
      "title": "First marathon sub 5 complete - Brighton Marathon (34F)",
      "selftext": "Hi all - I finished my first marathon in 4:50, within my goal of 5 hours, which was awesome! I thought some other first timers who are aiming for around 5 hours would be interested in my training and my experience.\n\n### Race Information\n* **Name:** Brighton Marathon\n* **Date:** 6th April 2025\n* **Distance:** 42.4km\n* **Location:** Brighton, UK\n* **Website:** https://www.londonmarathonevents.co.uk/brighton-marathon-weekend\n* **Strava:** https://www.strava.com/activities/14098582527\n* **Time:** 4:50:41\n* **Age:** 34\n* **Gender:** Woman\n\n### Goals\n| Goal | Description | Completed? |\n|------|-------------|------------|\n| A | Start & Finish | *Yes* |\n| B | Sub 5 hours | *Yes* |\n| C | Sub 7min/km (4:55) | *Yes* |\n\n### Splits\n| Kilometre | Time |\n|------|------|\n| 1 | 7:05\n| 2 | 6:26\n| 3 | 6:46\n| 4 | 6:39\n| 5 | 6:33\n| 6 | 6:27\n| 7 | 6:29\n| 8 | 6:30\n| 9 | 6:39\n| 10 | 6:34\n| 11 | 6:55\n| 12 | 6:35\n| 13 | 6:38\n| 14 | 6:56\n| 15 | 6:48\n| 16 | 6:51\n| 17 | 6:48\n| 18 | 7:02\n| 19 | 6:26\n| 20 | 6:47\n| 21 | 6:44\n| 22 | 6:33\n| 23 | 6:44\n| 24 | 6:31\n| 25 | 6:46\n| 26 | 6:51\n| 27 | 6:46\n| 28 | 6:50\n| 29 | 6:49\n| 30 | 6:53\n| 31 | 7:03\n| 32 | 7:05\n| 33 | 7:03\n| 34 | 7:10\n| 35 | 7:06\n| 36 | 7:30\n| 37 | 7:21\n| 38 | 7:07\n| 39 | 7:24\n| 40 | 7:43\n| 41 | 7:20\n| 42 | 7:01\n\n### Training\nI started a 16 week sub-5 marathon training plan from Runner's World back in November, taking a 3 week 'break' for a trip to NZ over Christmas (just continuing to run as often as I could while travelling), then repeating a couple of weeks when I got back to then catch back up with the schedule. It worked really well for me, but at one point I was unsure if I was doing enough and asked for advice on Reddit, which was a mistake. I was told I was not doing enough volume at all. Turns out that was wrong!\n\nI was doing 3 runs a week: one easy, one intervals/tempo and one long run. And then optionally a 4th run, normally a parkrun, if I was having a good week. I know the wisdome is that 4 runs should be minimum for marathon training, but this was what I was able to fit in and what I felt comfortable committing to. I maxed out at 30.5km for my long run, four weeks before the race, which took me 3 hours 40 mins. Where I live is very hilly, so I knew that my training runs were always going to be much harder than the race, which was good.\n\nI probably should have done one more long run with 3 weeks to go, but I had a niggle in my knee and was also on my feet a lot rehearsing for a show. So I decided against it in order to avoid injury. I was nervous all during taper that I'd messed things up by not doing that long run. But I had to convince myself that missing one run wasn't going to make or break the months of training before tha.\n\nOn top of the running, I did one strength training session at home per week, focusing on legs, core and ankles. Occasionally I did a yoga session too. And most weeks I went to Zumba. I was meant to swim each week as well, but basically didn't.\n\n### Pre-race\nLots of pasta and bread in the 2 days before! My husband was also racing, so we stayed in a tiny old cute hotel within 10mins walk of the park where the marathon started, and had a nice Italian meal the night before. We were able to have a relaxed morning with our start times of 9:45 and 10:28 respectively - even doing our last loo stops in the hotel! I got pretty nervous when I walked into the park and saw how huge the event was and how many people there were. But I breathed and calmed myself down before my wave was called.\n\n### Race\nI was aiming to stay between 6:45 and 7:00 min/km in order to hit my goal time. There were kms in the first half where I went faster than this, but I was using my body to tell me what was feeling good, and often these were downhill kms. So I don't think I went too fast at the start. I also knew that since this was my first marathon I was definitely going to slow down near the end whatever happened, so banking at least some time made me feel better. Essentially for the first half I was just making sure that each km felt like the same level of easy effort.\n\nI had support from my family all through the first third in the centre of town which was so nice. And then we headed out of town along the coast to the East, and, although it was uphill, it was beautiful and I was still feeling good. Turning around at 18km and seeing the cliffs and then running downhill back into Brighton was amazing. The middle section down by the sea from 24 to 28km was pretty tedious as there was minimal support. The day was also very very sunny, and there was no shade or relief from the direct heat.\n\nIt was almost comical that exactly at 30km my knee started hurting, and I definitely slowed down. But the slowdown wasn't too bad - I wouldn't say I hit 'the wall'. I stayed in the 7 mins\\km rather than ever going up to 8. After 35km things got worse and I really had to dig deep and force myself to believe I could do it, pushing through the exhaustion. But once I got to 40km it seemed doable, and I just went for it. I was SO HAPPY to come in well under 5 hours, which had been my main goal for the whole of training! And I didn't walk or stop at all either. Coming across the line I just cried - I never thought that in my life this is something that I would achieve.\n\n### Nutrition\nI took a 30g carb gel or chew every 35 minutes (Precision Fuel) and had an electrolyte/carb mix in a water bladder to drink whenever I wanted. I carried 1.5l but only drank just over 500ml, so carried an extra kg all the way round for no reason! I was also drinking every electrolyte drink they gave out round the course and mostly using the provided water to cool myself down. I didn't need the loo at all on the course and my stomach handles gels and chews just fine.\n\n### Post-race\nImmeditely after the race I staggered to get my medal, cried a bit more, found my bag and then sat down near a meeting point hoping that my family would find me. My husband had finished in an amazing 2:57 (a PB for him) and so we both crashed. We had to get a minibus back to our park and ride, but eventually drove our way to a pub, where I tried to drink half a pint, and successfully ate most of a fish and chips. My husband was not so lucky and was feeling pretty ropey - he threw up a couple of times on the course and his stomach wouldn't handle any food even a few hours after. He eventually felt better at about 9pm and ate his pub lunch leftovers.\n\nToday I am working from home on the sofa, in my dressing gown, with my medal on. As little movement as possible is happening.\n\n\nMade with a new [race report generator](http://sfdavis.com/racereports/) created by /u/herumph.",
      "author": "schmauften",
      "created_utc": 1744046804.0,
      "score": 151,
      "num_comments": 19,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "tiktok",
    "instagram"
  ]
}