{
  "id": "twin_azzwhole",
  "username": "azzwhole",
  "activity_count": 1,
  "interests": [
    "that",
    "race",
    "half",
    "plan",
    "with"
  ],
  "post_times": [
    1742237537.0
  ],
  "history_sample": [
    {
      "id": "1jdkhcw",
      "title": "Tobacco Road Half Marathon Race Report and RW 1:45 Half Plan Review (and how I did almost everything wrong)",
      "selftext": "# Race Information\n\n* Name: Tobacco Road Half Marathon\n* Date: March 16, 2025\n* Distance: 13.1\n* Location: Cary, NC\n* Time: 1:42:xx\n* Me: M/38/6'1/175lb\n\n# Goals\n\n|Goal|Description|Completed?|\n|:-|:-|:-|\n|A|1:40|No|\n|B|1:45|Yes|\n|C|1:48:50 (PR)|Yes|\n\n# Splits\n\n|Mile|Time|\n|:-|:-|\n|1|7:54|\n|2|7:19|\n|3|7:30|\n|4|7:24|\n|5|7:25|\n|6|7:45|\n|7|8:00|\n|8|7:36|\n|9|7:47|\n|10|8:16|\n|11|7:58|\n|12|7:47|\n|13|8:22|\n|14|7:38|\n\n# Background\n\nGot accidentally wrapped up in running on Thanksgiving when a family friend suggested we do a Turkey Trot 8k. I ran it in the closest thing I had to running shoes which was Altra S trail shoes (that immediately untied upon me leaving the starting line, but that's my fault not the shoes). I was pretty hung over on that race day since we had Friendsgiving at our place the night before, but I surprised myself with what I considered a solid performance averaging about 8:35/mi pace essentially off the couch. My running history at that time consisted of playing high school soccer for a couple years, then pick-up soccer here and there for some years thereafter, and running one random 5k 13 years ago. However, I am generally a pretty fit guy and have hiked a ton and played various sports throughout my life and like to stay active, so I was working with a favorable baseline.\n\nHanging out post-race, it was decided by our running friend group that the next running objective needs to be identified immediately, and Tobacco Road Half some 4 months later was deemed an appropriate target.\n\n# Training\n\nI had no idea what I was getting into, and my ego is a bit out of control, so I couldn't settle for just merely completing the race and had to find a difficult yet achievable goal. After googling various pathetic things such as \"what's a good half marathon time\" and \"how hard is x time in half marathon\", I settled on 1:45 as a reasonable goal, and picked the RW's 12-week Sub 1:45 Half-Marathon Plan (https://www.runnersworld.com/uk/training/half-marathon/a760103/rws-12-week-sub-145-half-marathon-schedules/) for no other reason than it had a suitable time frame and formatting looked neat. Now... the header for the plan says \"Target times: from 1:30 to 1:44 (race pace: sub-8:00 per mile). You should be capable of either a sub-46 10K, sub-1:18 10-miler or a sub-4:00 marathon. Training will be at least five days a week, with an average weekly mileage of 35 miles.\" I did not really meet these requirements, but ignored that part and plowed ahead anyway. I also ignored the fact that I was starting from 0, rather than 20mpw base fitness like the plan called for.\n\nWhat my actual training mileage was: 5 weeks of 10-15 MPW as I was ramping up from basically nothing... and 7 weeks of 20-33 MPW (only one week exceeded 30 miles). I dropped every single fartlek run from the training (just rested or cross-trained instead) because I didn't really understand what fartlek was and I was just not ready for that sort of mileage. So essentially the plan ended up becoming a blend of building base fitness and slowly \"meeting\" the plan around week 7 where I did almost every workout as written (except fartlek runs and dialing back long run mileage)\n\nNow here are my thoughts on this plan. I have no idea if this plan is good for getting a 1:30 Half, but for me personally it was a huge overkill for simply sub 1:45. If you're able to meet the various speed benchmarks sprinkled throughout the plan like I was, you don't need to exceed 20-25MPW at any point. 1:30-1:45 is a huge difference in running fitness, and approaches to achieving those times should be quite different. Of course I only know this now after the fact, though I intuitively began to understand that I didn't need all that mileage around week 8.\n\nMy A-B-C goals swung wildly back and forth depending on my delusion at the time or how I felt about how the training was going, but I eventually settled on 1:40 as my A-goal, and I still believe that should everything had gone right in terms of weather and pacing I am capable of this goal with no additional training.\n\n# The Course / The Event\n\nTobacco Road Half/Full is advertized as \"flat and fast\" and is a BQ race, so it's a pretty big deal around these parts.  The half course is an out and back with \\~5 miles on road and the rest on hard packed gravel lined by tall pines. The event is incredibly well-organized and generally loved by locals, so nothing negative to say in this regard.\n\n# Race Day\n\nNearly all of my training was done in 30-50 degree weather. I love running in the cold, and training over the winter really appealed to me. However, the actual race happened to be on a warm, humid, windy morning preceding a massive thunderstorm so the conditions were quite different from what I was used to, and I was genuinely concerned that my body was completely unprepared for such comfort zone deviation. Another unfortunate fact about the Tobacco Road Half/Full is that it starts at the ass early time of 7:00am and because of the complicated parking and shuttling situation, I had to wake up at 4:15am to ensure a stress free experience getting to the race site. With all of that said, I arrived at the race site fairly well-rested after a perfectly executed weekend-long nutrition/relaxation/physical-prep plan and had plenty of time for multuple porta-potty breaks, mulch naps, and taking in the pre-race atmosphere.\n\n# The Race\n\nThe race had pacers in increments of 15 minutes for the half, and so obviously I lined up with the 1:45 guys. I slurped a goo, re-tied my shoes, and excitedly waited for the gun. My plan was to follow the pacer for the first mile no matter what, and then slowly run away from them while flawlessly performing negative splitting for the rest of the race. The one problem with that plan was that I am fucking awful at pacing myself so while my first paced split was an ideal 7:56, my second (first independent) split was 7:19. The slow-motion catastrophe continued with the next three miles all clocking in under 7:30, but I have to say that the first 5 miles felt fantastic as I was finding my breath and enjoying the weather more than I thought I would. During mile 6 the nightmarish realization finally set in.... this was not my half marathon pace, this was my 10k pace, and my body was expecting this run to conclude accordingly. I began to panic. I dropped back from the highly experienced runner dude I was following and engaged in crisis management mode. I did my best to drop to a pace that felt tangibly easier yet within parameters of achieving my A goal. I rounded the halfway mark at exactly 50:00, but my body was not ready to repeat the effort it just undertook. The first half of my run can be best described as an exhilarating romp, the second half as a white-knuckling painful slog. Miles 7-10 were spent in borderline delirium as I desperately tried to cling on to runner after runner to help me pace myself just to inevitably have them leave me behind. My eyelids began to droop, breath became erratic, I felt my heartbeat in my scalp, my chin occasionally dropped to my chest. I felt like I was in the last stretch of a 5k, and had 5 miles left to go. Miles 10 and 11 were the most miserable running I ever endured. No amount of crowd encouragement, mental gymnastics, positive self-talk, or cadence reset trickery seemed to dimish the agony. One thing that seemed to help was occasionally talking to other runners, but not all were open to chatting. And yet I refused to significantly slow down. I notched two splits above 8 minutes in miles 10 and 13 (where we had to run for a mile into a ripping headwind), but the rest were under 8. I accelerated the best I could toward the finish gate and clocked a net time of just around 1:42.\n\n# Final Thoughts\n\nI think my ultimate goal was achievable with more preferable weather and better pacing, basically should everything had gone right, so it makes sense that I fell short. I am still proud of my training and performance, and will likely try to run another race soon after I've had time to process and re-evaluate my fitness goals.\n\n",
      "author": "azzwhole",
      "created_utc": 1742237537.0,
      "score": 25,
      "num_comments": 10,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "instagram",
    "youtube"
  ]
}