{
  "id": "twin_mnsotelo",
  "username": "mnsotelo",
  "activity_count": 1,
  "interests": [
    "race",
    "week",
    "runs",
    "with",
    "training"
  ],
  "post_times": [
    1746471026.0
  ],
  "history_sample": [
    {
      "id": "1kfjk5r",
      "title": "My first half marathon! Hoag OC Running Festival",
      "selftext": "### Race Information\n* **Name:** Hoag OC Half Marathon\n* **Date:** May 4, 2025\n* **Distance:** 13.1\n* **Location:** Costa Mesa, CA \n* **Website:** https://ocmarathon.com/\n* **Time:** 2:06:55\n\n### Goals\n| Goal | Description | Completed? |\n|------|-------------|------------|\n| A | 1:55 | *No* |\n| B | Sub 2 | *No* |\n| C | Finish the race | *Yes* |\n\n### Splits\n| Mile | Time |\n|------|------|\n| 1 | 9:00\n| 2 | 8:29\n| 3 | 8:37\n| 4 | 8:58\n| 5 | 8:58\n| 6 | 9:06\n| 7 | 9:21\n| 8 | 10:36\n| 9 | 9:58\n| 10 | 10:14\n| 11 | 10:19\n| 12 | 10:14\n| 13 | 10:34\n| 14 | 8:31\n\n### Training\nFor this race, I followed a 19 week training plan through Runna. My plan included interval runs, tempo runs, hill repeats, long runs, and long runs with pace targets.  I ran 4 days a week which usually consisted of two hard runs, one easy run, and one long run.  I also did running-focused strength workouts 1-2 times per week. During the weeks I had hill repeats I usually had a long run with pace targets OR one speed workout to round out the two hard runs per week.  I peaked at 30 miles per week.  Overall I had a positive experience with the app, and enjoyed the structure and variety of workouts. My inputs to the app resulted in a plan that I now realize was too aggressive for my current level of fitness. I also think I should have spent 7 weeks on a general fitness/base building plan and then a 12 week half-marathon training block immediately after.  \n\nDuring the training block, my speed improved significantly, but my endurance and stamina did not improve as much as I would have wanted.  I suspect this is largely because I ran my easy runs too fast and neglected building my base in favor of beating or achieving the pace targets in my speed workouts.  I also suspect I should have only been doing one speed workout per week and fewer long runs with pace targets.  I thought attempting a more aggressive training plan would yield better results, but my performance in the last few weeks of the block and ultimately during the race showed me how much I needed to lay off the flashier workouts and focus on building my base. By the end of my training block I felt tired, not strong, but I figured that was normal and the taper would work its magic.  The taper DID work some magic, but I think I really was just tired--not overtrained, but maybe getting close.  \n\n### Race\nDuring the first half of the race I felt pretty good.  My plan was to keep it steady during the first 6-7 miles, and then try to speed up in the second half for a negative split. Miles 1-4 felt strong, but by mile 5 I started to slow down. By miles 6 and 7 I could feel myself fading.  From mile 8 onward I felt like the tank kept draining and no matter how much I tried to dig deep, I couldn't rally.  I used the PacePro feature on my Garmin and tried to follow the suggested splits as closely as possible, especially in the first few miles of the race which had some small rolling hills. Around miles 4-5 I was still 30 seconds ahead of my predicted finish time, but beginning around mile 6 I started falling behind.  At this point, I knew 1:55 wasn't going to happen, but maybe I could pull a sub-2 finish out of my assif I could rally in the latter half and make up some of the time.  Ultimately, I couldn't rally.  By mile 10 I decided I was just going to run at whatever pace felt comfortable and try to finish strong. I took in roughly 55g of carbs per hour (plus electrolytes) during the race, and had about 400-500 grams of carbs the day before with lots of water and electrolytes.  I don't think fueling was the problem, just my fitness and lack of aerobic base.\n\nThe crowds and the energy during the race were amazing, and some folks even ran with lightsabers in jedi robes in honor of May the 4th.  Even though my performance wasn't what I hoped for, I had an amazing time and it was a great first race. \n\n### Post-race\nShould I have gone into this race without a time goal since it was my first one?  Probably, yes.  But I wanted to push myself and try to do more than just finish, and I'm glad I set lofty goals even though I didn't achieve them.  This was a great first experience, and I'm very happy with how it went.  I proved to myself that I'm capable of more than I thought--it's just a matter of getting more (easy) miles under my belt and tweaking my approach to training to be more appropriate for where I'm currently at, NOT where I want to be.\n\nI'm going to take this next week off and just go for some walks outside before getting back to running. Depending on how I feel at the end of this week, I may take a few more days off from running and maybe hop on the bike before getting back to running. I plan to increase my mileage gradually before getting back into any structured plans.  I will likely use Runna again for my next race and for general training plans in between races, but I will adjust the difficulty and format so that I only have one speed/workout session per week and rarely have long runs with pace targets (and those that do have pace targets will be much easier pace targets than previously prescribed).  I plan to gradually increase my weekly mileage by running 5 days a week instead of 4, and most importantly: I'M GOING TO SLOW THE HELL DOWN ON MY EASY RUNS.  I'll keep up with strength training at least once per week.\n\nI'm looking forward to running my next half, but I think before I do that I want to work on speed over 5k and 10k distances.  So short term goals following this race: 1) rest and recover. 2) build up easy miles. 3) improve my 5k and 10k times (and maybe sign up for races at those distances)\n\n\nMade with a new [race report generator](http://sfdavis.com/racereports/) created by /u/herumph.",
      "author": "mnsotelo",
      "created_utc": 1746471026.0,
      "score": 24,
      "num_comments": 6,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "twitter",
    "reddit"
  ]
}