{
  "id": "twin_queenofdiscs",
  "username": "queenofdiscs",
  "activity_count": 1,
  "interests": [
    "race",
    "that",
    "this",
    "miles",
    "before"
  ],
  "post_times": [
    1753568978.0
  ],
  "history_sample": [
    {
      "id": "1ma68lb",
      "title": "Race Report: Run LA \"City of Angels\" 5k/10k/13.1",
      "selftext": "# Race Information\n\n* **Name:** Run LA \"City of Angels\" 5K/10K/13.1\n* **Date:** July 26th, 2025\n* **Distance:** 10k - 6.22 miles\n* **Location:** Santa Monica, CA\n* **Website:** [The Best Races - Run LA](https://www.letsdothis.com/us/e/run-la-city-of-angels-5k10k131-summer-243386?eventId=243386&preferred=true&utm_organiser_id=156193)\n* **Time:** 1:06:02\n\n# Goals\n\n|Goal|Description|Completed?|\n|:-|:-|:-|\n|A|Sub 60 min|*No*|\n|B|Met my runna estimate|*Yes*|\n\n# Splits\n\n|Mile|Time|\n|:-|:-|\n|1|10:12|\n|2|10:31|\n|3|10:28|\n|4|10:49|\n|5|10:52|\n|6|11:08|\n\n# Training\n\nFollowed Runna's 10k plan, 3x runs / week for 8 weeks and found it very encouraging and achievable.  Mostly long runs, easy runs with at least one interval or strides run per week.  For my next race I plan to increase to 4x / week.\n\n# Pre-race\n\nThis is the first race I've signed up for in a long time and I wasn't really a runner before so it never occurred to me that there could be \"scam\" races out there. The \"we'll send out the course map a few days before the race\" description should have been a tell-tale sign and sure enough, a week before the race we get the \"course\" map: A stretch of running path that is approximately 0.7 miles long.\n\nIt wasn't until the night before the race that I realized the \"course\" was 0.7 miles, I mistakenly thought it was 1.5 so I'd only need to do two out-and-backs.  But I used a footpath app to see it would in fact be...four-ish out-and-backs.\n\nWhat's worse? There's an intersection right in the middle of this 0.7 mile stretch :facepalm: that I had to cross 8 times.\n\nAnyway, the organization consisted of: two very nice and helpful coordinators who gave out bibs, a snack station near their sign-in area, a couple traffic cones by the \"starting line\", and instructions that \"you can start whenever you like.\"  The organizing body is called \"The Best Races\" and I get the impression all of their events are like this.\n\nThere was a pretty decent turnout.  But about half of the people who showed up were wearing shirts for some charity run to fight breast cancer.  Turns out \"The Best Races\" was hosting the same run with two brands - the one I signed up for and [Run Together Against Breast Cancer](https://findarace.com/us/events/run-together-against-breast-cancer-5k-10k-13-1-los-angeles).  I would seriously question the legitimacy of the charity run.\n\nFor some reason, a week or two before the race, the organizers encouraged registrants to select a starting time but this turned out to be pointless as no one was organizing heats of runners on the day-of.\n\n# Race\n\nWhatever, I trained to crush a 10k and that's what I set out to do.  Like every rookie runner, I started too fast, even though everyone says not to start too fast, and regretted that around mile 3.\n\nOccasionally I had to sprint to make it across the intersection before the light changed (or sometimes right after) and that messed up the consistency of my pace almost every time.  Once or twice I had to stop and wait for the walk sign.\n\nAround miles 4 and 5 I saw my pace slipping but didn't feel like I had the energy to bring it back up.  But I remembered a \"secret weapon\" I discovered during training which was faster cadence - by increasing my cadence and maintaining a good posture I would run faster without feeling like I was exerting more effort.  Worked every time!  Runna didn't prepare me for this, a random coworker mentioned it, so thanks for that, Bailey.  This kept me within my goal pace the rest of the way.\n\n# Post-race\n\nGot a banana at the check in station, walked around Santa Monica's running path / pier a bit.  Street parking was free until 9am.\n\nSo I wouldn't say this race was a scam, exactly, it just had many scam-like qualities.  But they did mail me a race shirt, hand out bibs and snacks, and gave out stickers.  And parking was super easy and free.  I guess I don't mind too much that I did this instead of a legitimate race because I'm just getting started, but guaranteed I will not be doing a \"The Best Races\" run again.  Especially when the strand beach path that goes miles and miles along the beach was right that and would have been a much nicer alternative.\n\nMade with a new [race report generator](http://sfdavis.com/racereports/) created by u/herumph.",
      "author": "queenofdiscs",
      "created_utc": 1753568978.0,
      "score": 3,
      "num_comments": 4,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "twitter",
    "reddit"
  ]
}