{
  "id": "twin_infamouscamels",
  "username": "infamouscamels",
  "activity_count": 1,
  "interests": [
    "that",
    "just",
    "mile",
    "with",
    "marathon"
  ],
  "post_times": [
    1748125001.0
  ],
  "history_sample": [
    {
      "id": "1kunc4i",
      "title": "Race Report: Colfax Marathon",
      "selftext": "* **What?** Colfax Marathon\n* **How far?** 26.2 miles\n* **Where?** Denver, CO\n* **Finish time:** 3:59\n\n# Goals\n\n|Goal|Description|Completed?|\n|:-|:-|:-|\n|A|< 4 hours|*Yes*|\n|B|< 4:10 hours|*Yes*|\n|C|Finish|*Yes*|\n\nSome background because I am mostly writing this to reflect, and if it helps anyone, that’d be nice too. Without getting too deep I am just trying to have some honest thoughts about why I ran and what kept me from doing it in the past.\n\nI started running about 5 years ago a bit before turning 30 as a “pretty big guy” I was 5ft10 305-310lbs. I’m now down to 220, but to put it bluntly, still a “pretty big guy” big gut, moobs, and unflattering jiggles in race day photos galore. While I see myself as a runner, I get lots of comments about how I don’t look like a runner, how people are surprised I could finish a run, or I don’t want to finish behind you. It’s always weird to me, and people usually try to pass it off as some sort of compliment (maybe it is and I am still a bit insecure), but it’s the reality and I hear the comments a lot.\n\nI had always wanted to be a runner. Why? I don’t really know. It just appealed to me is all I can say. A combination of shame, lack of confidence, and lack of ability had always stopped me from even starting, but this time it stuck. I started off trying to run a mile in under 10 minutes, a 5k under 30 minutes, a 10k under an hour, a half under 2 hours, and finally just run a marathon. Each time I hit a goal I moved on to the next step. New starting line new distance. I never wanted to linger at the current distance or try to improve it past those times. I just had eyes for the marathon. I told everyone I’d never do it, but when I’d reflect I knew I just said that because if I failed I’d just be too ashamed to admit I couldn’t do it, and with the weight that seemed like an even more shameful failure. The first 3 years I ran anywhere from 200-600 miles a year, the 4th year I ran a bit over 1300, and now I’m currently at 850\n\n|Mile|Time|\n|:-|:-|\n|1|9:13|\n|2|8:46|\n|3|8:39|\n|4|8:33|\n|5|8:48|\n|6|8:31|\n|7|8:48|\n|8|8:46|\n|9|8:33|\n|10|8:36|\n|11|8:44|\n|12|8:39|\n|13|9:13|\n|14|9:00|\n|15|8:49|\n|16|8:43|\n|17|9:00|\n|18|8:55|\n|19|8:53|\n|20|9:15|\n|21|8:56|\n|22|8:58|\n|23|9:37|\n|24|9:31|\n|25|10:24|\n|26|8:41|\n|27|8:18|\n\n**Training**\n\nThe year I ran my first Marathon a year ago and I did an NRC training. Just with the goal to finish. I had never done anything over 13 miles and knew I just needed to be able to run the distance. I finished at 4:58, falling apart quite badly at mile 21. After that I started training using Hal Higdon’s app, but never did a marathon after that training block. For 2025 I decided I would run Chicago, and I wanted to give it an honest effort. I decided I would do the pfitz 18/55 plan, and that I’d do a practice marathon with that same training block. The goal was to finish the plan, see if I can handle the volume, and run under 4 hours at a relatively easy pace to start the next 18/55 feeling fresh. I bought the book and set up the google sheet I found on Reddit to track my runs and get my paces with a 4 hour goal. I managed to finish every run but one. A 12-mile run, I wasn’t feeling after a crummy week, I decided to be done with at mile 6. I just didn’t want to be in my head anymore that day. I hit all the goal paces, and I remember being ecstatic at completing the 18 mile with 14 miles MP exactly at 9 minutes. I negative split 2/3 of my 20-mile runs. Since I never go back to a race I PR’d all the other distances during my training runs. Nothing crazy as it was in the middle of a lot of running, but still nice to see (Mile 7:11, 5k 23:11, 10k 48:05, HM 1:54). I lost about 20 pounds over the course of those 18 weeks. I made sure to eat right and drink enough water. I maintained an emphasis on having quality runs. So I went to bed early, made sure I was hydrated, and ate right before hard sessions (I tried to do this for every run, but more focused on the hard ones). I also lifted 5 days a week with a PPL plan where I did legs only once a week. Honestly, I just followed the most repeated advice here. Did my easy runs easy, got miles on my feet, put in hard effort for hard runs, and I trusted the process.\n\n**Pre-Race/Race**\n\nI decided early on that this would not be an all out effort. I wanted it to feel easy and controlled and to get to the end in under 4 hours. I decided I’d walk through all the aid stations to grab water, I would high five anyone waiting for one, tap any signs that offered a boost, and to track down my girlfriend for a kiss at any of the points she was meeting me. There is also one big hill towards the end, I decided early on I was just walking. I told myself I’d follow the 10/10/10 rule and to also tell myself that all my training was for that last 10k. I wish I could break it down mile by mile but honestly it felt like I looked down at my watch and I was at mile 13. Made it through a little bit of a climb and a bathroom stop and all of a sudden I was at mile 19. I ran strong from there since my girlfriend called me to tell me she was adding a stop at mile 22 and I wanted to see her. After that I felt like I had it. I enjoyed the next two miles at a pretty easy pace since it was uphill and I wanted to finish strong later, I walked up that hill, and spent a few minutes fixing my bib (to be honest my nipples were bleeding pretty bad and I didn’t want it to ruin the photos). I got to mile 25 and went to cruise control from there.\n\n**Post-Race**\n\nA week has passed, and I’m proud of that run but more proud of the entire 4 month block. I took a week off, and my legs feel great. I’ll be starting the same 18/55 training block in a bit for Chicago with a goal of 3:30. Maybe a stretch, but failing is fine.",
      "author": "infamouscamels",
      "created_utc": 1748125001.0,
      "score": 43,
      "num_comments": 8,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "tiktok",
    "instagram"
  ]
}