{
  "id": "twin_Environmental_Grand9",
  "username": "Environmental_Grand9",
  "activity_count": 1,
  "interests": [
    "running",
    "travel",
    "some",
    "sometimes",
    "specific"
  ],
  "post_times": [
    1744816076.0
  ],
  "history_sample": [
    {
      "id": "1k0mq9y",
      "title": "Advice on how to find running routes when travelling to a new country / city",
      "selftext": "Hey fellow runners!\n\nI've got a bit of a recurring travel headache I wanted to ask about, hoping some of you have cracked the code.\n\nI absolutely LOVE running when I travel. It's genuinely my favourite way to explore a new city\n\nBut... actually finding a good route can be a real pain sometimes\n\nMy usual process is a bit clunky:\n\n* **Strava Heatmaps:** Great for seeing where other people run, but doesn't easily give me a specific route of a specific distance, especially a loop starting and ending at my random Airbnb.\n* **Google Maps/Street View:** So much guesswork. Is this road actually runnable? Is it safe? Is it going to be fumes-ville? Takes ages.\n* **Asking the Hotel:** Sometimes helpful, sometimes they look at me like I'm mad for wanting to run 10k before breakfast and suggest a lap around the block.\n\nWhat I really struggle with is getting a reliable loop of a specific distance (say, exactly 10k, or maybe a longer 20k for a weekend trip) that starts and finishes right back at my accommodation. I hate ending up miles away and having to navigate back tired, or doing weird out-and-backs just to hit my target mileage.\n\nI feel like this must be a common problem for runners who travel frequently. How do you all handle it? Am I missing some obvious tool or trick? Or are you secretly using some magic AI route-generating app I need to know about?!\n\nWould love to hear your strategies and any app recommendations you have!\n\nThanks in advance! Happy running!",
      "author": "Environmental_Grand9",
      "created_utc": 1744816076.0,
      "score": 79,
      "num_comments": 100,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "tiktok",
    "instagram"
  ]
}