{
  "id": "twin_spectre-uk",
  "username": "spectre-uk",
  "activity_count": 1,
  "interests": [
    "with",
    "training",
    "felt",
    "some",
    "marathon"
  ],
  "post_times": [
    1744974421.0
  ],
  "history_sample": [
    {
      "id": "1k22a67",
      "title": "Vienna City Marathon Race Report - 3rd marathon and another PR",
      "selftext": "# Race Information\n\n* Name: Vienna City Marathon\n* Date: 6th April 2025\n* Distance: 42km\n* Location: Vienna, Austria\n* Time: 3:22 (PR, 3:47 in 2024, 4:20 in 2023)\n\n# Goals\n\n|Goal|Description|Completed?|\n|:-|:-|:-|\n|A|Sub 3:30|Yes|\n|B|Do not hit the wall|Yes|\n|C|Sub 3:20|No|\n\n# Training\n\nI followed the 55-mile 12-week programme from Advanced Marathoning, starting from mid-January. It appealed to me due to the relatively high focus on mid to long-distance workouts, something that I felt was missing from my previous 2 marathon plans (also I loved the book itself). 2 years ago I opted for a basic Hal Higdon plan with no idea about training zones or workout types, and last year I used the Runna app which was unnecessarily heavy on short HIIT runs.\n\nThe plan kicked off with a 56k week and I was ready for it after consistently cycling and running since my last event in November (500-700 TSS/wk, mostly Z2). Following some customisation every week looked roughly like this:\n\n* Mon - Strength training, sometimes bike\n* Tue - Workout or base run, depending on feel/time\n* Wed - Workout or base run, depending on feel/time\n* Thu - Recovery run or bike\n* Fri - Strength (in early blocks), carb loading\n* Sat - Long run\n* Sun - Bike\n\nI did significant cross-training on the bike on top of the plan, sometimes replacing recovery runs with a ride when my legs felt particularly battered. I also did some strength training focused on core and upper body, initially 2 and later 1 session per week (30-40min). These seem to have helped with the mild lower back pain that I felt after a couple of hours during long runs, on top of some general improvements in core strength and posture. \n\nThings went well. I found the training challenging but manageable, completed all key sessions as planned whatever the weather, with particular focus on executing the long runs. Overall I trained 9-11 hours or 600-800 TSS per week and felt more fatigued than ever by the end of the peak period. Staying focused during the long runs and long interval sessions seemed to be the biggest challenge, my brain is not great at monotonous activities (one reason why I am more keen on cycling).\n\nThe taper period lasted 2 weeks. I did not reduce the intensity of training runs by that much, but dropped the volume by around 2h and spent some more time on the bike instead. Overall the weekly TSS only dropped by around 100.\n\n# Pre-race\n\nI flew to Vienna on Friday morning and spent the next couple of days exploring the city at a relaxed pace, taking every opportunity to take on some carbs (Vienna has the best cakes I ever ate) and make use of their amazing public transport. I managed to fit in a touristy 30min run on Saturday morning.\n\nSunday morning was bloody cold. The temperature dropped by more than 10C in a day, down to around freezing and with horrible wind chill. Fuelled by a supersized portion of my standard workout day breakfast (oats with yoghurt and bread with jam + sliced banana) and wrapped in 3 layers of clothing I made my way to the start line on the other side of Danube.\n\n# Race\n\nApart from the crowdy first few km and my legs gradually shutting down towards the end, I managed to maintain a very consistent pace, HR and cadence (around 4:45/km in bottom half of Z3, 174spm). I did not hit the wall or stop at any point which I am particularly proud of. Sticking to a slightly lower HR than on previous attempts probably played a big role here.\n\nIt felt like there was some energy left to speed up in the last few km but I couldn't, my legs were cooked and forcing them for the sake of gaining a few seconds seemed like a recipe for injury. It was clear that the stretch 3:20 target is out of reach at that point and I just focused on maintaining the consistent effort. Last couple of splits were still under 5:00/km.\n\nNutrition plan worked well. I took on 35-40g of carbs every 30min with a mixture of homemade energy balls, glucose/fructose gels, and simpler glucose gels later on. I also went through 1L of water with electrolytes.\n\nI was initially worried about the chilly conditions but felt surprisingly comfortable once warmed up. I opted for a base layer, heavier long sleeve shirt, leggings + shorts, and a few extras which only slightly reduced my shaking in the first couple of km (light wind breaker, neck tube, gloves).\n\nThe course was amazing overall, I found it easier and way more interesting than Manchester which I have completed twice before. It made me want to come back and explore the city properly in the near future. Running full length of the Hauptallee park for 2nd time was a bit monotonous so late in the race, but I can see why Kipchoge picked this place to run a sub-2:00 marathon (over 4km in a dead straight line).\n\n# Post-race\n\nMy joints seized after crossing the finish line, followed by burning in every leg muscle soon after which stayed with me for another 2-4 days. This was definitely the furthest I ever pushed my legs, I shuffled through the event village with great pain and even the gentles attempts to stretch resulted in a cramp. A couple of days after the event I started feeling some deep pain in my right glute and hamstring (deep gluteal syndrome?), however it began to subside before I decided to see a physio. One to watch out for in the future. \n\nI rate the event 5*, it was very well executed and felt like a big deal with generous sponsors. It was just another level compared to what I am used to running in the UK.\n\nOverall I am very happy with the result as well, despite finishing just under the stretch goal. Will I run another marathon? Yes, maybe next year. Will I try to finish under 3:00? Not saying no but that would be a massive undertaking, running at 4:15/km for 3h will need *a lot* of consistent training and it feels like the returns for my efforts have already slowed dramatically in recent months, despite being fitter than ever. Maybe this plan would need breaking down into 2 season. Or maybe I will switch to trail ultras after following the UTMB series with great interest lately? Who knows.",
      "author": "spectre-uk",
      "created_utc": 1744974421.0,
      "score": 29,
      "num_comments": 4,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "instagram",
    "youtube"
  ]
}