{
  "id": "twin_FalbWolowich",
  "username": "FalbWolowich",
  "activity_count": 2,
  "interests": [
    "that",
    "this",
    "marathon",
    "pace",
    "with"
  ],
  "post_times": [
    1748421097.0,
    1744577549.0
  ],
  "history_sample": [
    {
      "id": "1kxbxpm",
      "title": "[OC] Formula for estimating weekly distance required to achieve a given marathon time.",
      "selftext": "I ran a marathon a month ago, hoping to run it under 3h 30min, but ended up doing it in 3h 49min. Looking back, given my weekly mileage of 37.5km, 3h 30min was probably overly optimistic, but I didn't know this at the time. I wanted to see if there was an easy way to estimate the required weekly mileage for a given marathon time.\n\nA recent [study](https://www.researchgate.net/publication/386323276_The_Training_Intensity_Distribution_of_Marathon_Runners_Across_Performance_Levels) on strava runners addresses this very issue, but it's behind a paywall. Luckily, some of the [plots](https://www.researchgate.net/profile/Ben-Hunter-2/publication/386323276/figure/fig1/AS:11431281390937984@1745305521595/Training-volume-expressed-as-mean-weekly-distance-km-for-athletes-with-different_W640.jpg) can be accessed.  I recreated the plot and fitted a trendline through it. You can see it [here](https://i.imgur.com/tdfGXE7.png). \n\nThe amount of weekly mileage in km you need is given by the formula 20 + (3010 / (time (in min) - 100)). So, in my case, I was off by roughly 10km/week to get the desired 3h 30min time. According to this model, running 3h 49min requires a weekly mileage of 43km, which is about 6km more than the distance I was averaging. So, I slightly overperformed the estimated time, but this is within margin of error.\n\n**EDIT: I was not the one who did the study. I simply took one of the graphs and did one interpretation of it. This study was published in sport medicine. If you have an issue with it, maybe contact the authors or the journal that accepted it.**\n\n**EDIT2: Why is everyone so angry? Please stop PMing me. Again, I am not the author of the paper. I am not the one that made the plot. All I did was fit a trendline and write an equation. Read the full paper if you want more details about how the data was obtained and what assumptions were made.**",
      "author": "FalbWolowich",
      "created_utc": 1748421097.0,
      "score": 28,
      "num_comments": 58,
      "subreddit": "running"
    },
    {
      "id": "1jyhqv2",
      "title": "Race Report: Montpellier Marathon: Treading the Fine Line Between Determination and Meltdown",
      "selftext": "I ran my first marathon today in 3:49:59. I'm proud I got it done, but I'm also disappointed because I believed I had a sub 3:30 in me earlier this year.\n\nHere's a break down of the some of the important metrics from the race.\n\n| km | pace | elevation |\n| -- | --   | --        |\n| 01 | 5:27 | +11/-8 m  |\n| 02 | 5:10 | +0/-6 m   |\n| 03 | 5:10 | +0/-14 m  |\n| 04 | 5:13 | +0/-5 m   |\n| 05 | 5:15 | +0/-0 m   |\n| 06 | 5:11 | +5/-0 m   |\n| 07 | 5:12 | +4/-1 m   |\n| 08 | 5:13 | +9/-0 m   |\n| 09 | 5:11 | +10/-0 m  |\n| 10 | 5:03 | +4/-6 m   |\n| 11 | 5:07 | +4/-2 m   |\n| 12 | 4:53 | +2/-12 m  |\n| 13 | 5:12 | +12/-0 m  |\n| 14 | 5:03 | +0/-2 m   |\n| 15 | 5:02 | +0/-12 m  |\n| 16 | 4:47 | +4/-13 m  |\n| 17 | 5:02 | +0/-14 m  |\n| 18 | 5:09 | +1/-4 m   |\n| 19 | 5:21 | +8/-0 m   |\n| 20 | 5:40 | +18/-0 m  |\n| 21 | 5:40 | +19/-4 m  |\n| 22 | 5:24 | +12/-22 m |\n| 23 | 5:23 | +4/-3 m   |\n| 24 | 5:20 | +0/-12 m  |\n| 25 | 5:21 | +1/-4 m   |\n| 26 | 5:33 | +1/-4 m   |\n| 27 | 5:50 | +3/-0 m   |\n| 28 | 5:48 | +5/-0 m   |\n| 29 | 5:49 | +7/-0 m   |\n| 30 | 5:45 | +7/-0 m   |\n| 31 | 5:52 | +8/-2 m   |\n| 32 | 5:43 | +0/-5 m   |\n| 33 | 5:34 | +4/-14 m  |\n| 34 | 5:55 | +12/-0 m  |\n| 35 | 6:00 | +5/-0 m   |\n| 36 | 5:43 | +0/-12 m  |\n| 37 | 5:45 | +1/-12 m  |\n| 38 | 5:41 | +1/-12 m  |\n| 39 | 5:41 | +0/-1 m   |\n| 40 | 6:03 | +4/-4 m   |\n| 41 | 6:25 | +10/-0 m  |\n| 42 | 5:46 | +10/-0 m  |\n| 43 | 4:45 | +21/-0 m  |\n\n\n**Preparation**\n\nI've been a low-volume runner for years, rarely surpassing 100 km per month. Starting last August, I increased my mileage, hoping to make 30km a comfortable distance so I could participate in Montpellier Marathon in April 2025. By December, I reached a monthly peak of 240 km, and in January, I ran 30 km in under 2:30 (5:00/km pace) and felt like I could have gone further.\n\nUnbeknownst to me at the time, that was my last 30km run until today. I got caught up in traveling, attending conferences, and my mileage plummeted to about 150km a month. To make matters worse, last month was also Ramadan, the fasting month, where we abstain from drinking/eating for 18h a day. While I continued to run, most of the runs were garbage runs, around 5:50 pace. I attemped several times to go faster, but I always ended up feeling nauseated at some point. I could never go beyond 20km. For some reason, my legs always felt weak; the sort of the feeling you get when someone delivers bad news.\n\nWhen Ramadan ended, I only had two weeks left before the race; only one without fasting. My attempt at 30km at 5:00/km was a disaster; I couldn't hold the pace for more than 17 km. I considered giving it another try a few days later, but giving the proximity to the race, I decided against it.\n\nAs you can imagine, I had no idea what pace I should go for. On one hand, I haven't managed to sustain 5:00 pace for more than 18km in a long time. On the other hand, I believed I had a 3h 30min in me and it will come back at some point. Eventually, I decided to aim for a 3h 45min marathon, hoping to adapt on race day based on how I felt.\n\n**Race Day**\n\nThe marathon kicked off at 8 a.m. under a light drizzle; perfect for avoiding the usual midday heat. I rode to the marathon site and found the 3h 45min pacer. Had some chitcat with random runners to ease off the tension and the race started.\n\nI was planning to stick by the pacer for the first 10k and then assess the situation. For some reason, the pacer didn't seem to have any idea what pace he should be running and I left him. I found someone running at the desired pace and begin drifting off him.\n\nThe first 10km went really well. I was feeling better than I had felt in a long time. This obviously started giving me ideas. I started increasing the pace slightly, and by km 15, my average pace was 5:08. Excellent. I was thinking I could hold this pace until the half marathon point and then switch to a 4:45 pace until the end. That would put me just sub 3h 30min. Perfect, just what the doctor ordered. I have a 1:36 half-marathon time, so it didn't seem far-fetched.\n\nOf course, this is not how it played out. That plan fell apart so fast that I didn't realize what had hit me. At km 18, my energy vanished, and my legs turned into lead (see the table). I felt like a crash-test dummy that never got the seatbelt memo. This was so sudden. How is this possible. Oh lord, not now. At least, let me get to km 30 and then do whatever you want. But not at km 18.\n\nI kept pushing, but the realization that I'm already gassed at km 18 and I still have 24.2km crushed me completely. I considered quitting, but remembering that I've been hyping this marathon for so long that almost everyone in my lab knows I'm running it, a DNF would have been embarrassing. I was thinking of several excuses to give tomorrow, but none of them made me look good.\n\nThe determination of not failing is the only thing that kept me going. For the next 2h, with a very hilly course (see the [elevation map](https://i.imgur.com/8oyNWba.png)), it was nothing but complete torture, the kind of feeling I would never wish on my worst enemy. Then, the heavens decided to open up and turn the course into a steeplechase track. Suddenly, I am not only required to run, but jump over water puddles or risk running with wet shoes. \nJust what I have been asking for! With my tiredness, I looked like an awkward gazelle, bounding over mini-lakes I swore were installed just to watch me flail. After a few attempts, I stopped caring about the luxuries of running with dry shoes. I went right through the water puddles.\n\nI can't say much about what happened in the second half of the race because I was simply not there. Everything became a blur and I stopped seeing well at some point. My running form got so tragic that passing pigeons looked more graceful. However, I remember my brain telling me to stop and have a walk. From experience, I knew this was a trick. You simply ignore your brain when things begin going south. As soon as I stop, I would never be able to continue. So, I refused to listen to my inner mind.\n\nThe Montpellier Marathon organizers decided the best way to end the marathon is to put the finish line on top of a hill. From km 38 until the finish, the course climbed relentlessly. Even though I was just 3km away, I never believed I could finish. At that point, I would have traded anything for roller skates if it meant an easy glide to the finish. I felt like an action hero whose script forgot to include a happy ending.\n\nMy body was completely numb. I had lost sensation of my behind at some point, feeling as if my body had split into two halves. It's hard to know how I kept going, but I just kept at it. With 500m to go, and 25m of elevation, the wise words of the great philosopher Arnold Schwarzenegger suddenly popped into my head: \"If he dies, he dies\". Cheered on by spectators, I somehow mustered a 4:45/km kick, probably to the surprise of many, including myself.\n\nIt was only when I saw the finish line that I started believing that I was going to finish. Then something happened. My legs started wobbling like binary stars in a gravitational dance. Suddenly, my legs could no longer hold me,\ndeciding to stage a coup d’état in which I was just an innocent bystander. I fell right in front of the finish line with less than 1m left, then crawled across it. Highly dramatic finish for a 3h 49min 59s marathon. A friend who was in the crowd told me later on that I had had crossed the line with the fall, and the crawl wasn't necessary. But I like the cinematic version better, so I'm sticking to that in all future retelling of this race.\n\nI can't remember exactly what happened next. It felt like Daniel Craig in Casino Royale after getting tortured by Le Chiffre, hearing only whispers and seeing bright flashes of light. I remember waking up in one of those makeshift hospitals. I was giving water with sugar and got covered with a silver foil blanket and asked to rest for a while. I was let go two hours later after I was able to stand up by my own.\n\nThis is the story of my first marathon. On one hand, I missed my sub 3:30 dream, but I'm proud of my 3:49:59. Pushing through all those stop signs was reckless, yet I'm still happy I finished.\n\n**Looking Forward**\n\nIt would sound over-dramatic to say this, but I don't think marathons are for me. I don't enjoy runs beyond 20km. I feel I should just stick to blasting half marathons. I get so much joy running fast, not long.",
      "author": "FalbWolowich",
      "created_utc": 1744577549.0,
      "score": 36,
      "num_comments": 11,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.98,
  "channels": [
    "youtube"
  ]
}