{
  "id": "twin_Morvisius",
  "username": "Morvisius",
  "activity_count": 1,
  "interests": [
    "running",
    "marathon",
    "doing",
    "with",
    "week"
  ],
  "post_times": [
    1742653046.0
  ],
  "history_sample": [
    {
      "id": "1jh9f7e",
      "title": "Barcelona Marathon - First real Marathon",
      "selftext": "# Race Information\n\n* **Name:** Barcelona Marathon\n* **Date:** March 16, 2025\n* **Distance:** 42,195km\n* **Location:** Barcelona, Spain\n* **Time:** 3:55 ( 5:28min/km )\n\n# Goals\n\n|Goal|Description|Completed?|\n|:-|:-|:-|\n|A|3:45 ( 5:20min/km )|*No*|\n|B|Finishing|*Yes*|\n\n# Background\n\nThis is the third time I attempt running an standalone Marathon, the same one in fact. I tried in 2019, but I was already injured so I could only run until km 30 ( ILB injury, and also underfueled ), and tried again at 2020 but it was canceled because of COVID one week before. After training twice I said I would never prepare an standalone marathon again because the training was extremely boring for me and I also liked cycling.\n\nI already did the Ironman one in 2021, but it was more like a walkathon at 4:50 and I had several issues that day, so for me its not the same. I did 4 half ironmans before.\n\nI didnt do any sport until 2015, I was very overweight at 28years old at 150kg and I had to change my lifestyle. I learned how to swim, cycle and I eventually did triathlons. But I was never fast or anything. My 10k PB is 44min at 2020, few months before COVID kicked in.\n\nAfter the ironman, which I prepared and did without a single injury, I took a break from running for a few months to recover, and once I came back, I started feeling pain on my Aquiles, which I thought it was just cramps. By then I was at 90kg aprox and I kept it between 95-100 until last year, at 183cm height.\n\nAfter weeks/months, the pain was growing more and more, not while running, but hours and the day after. I went to several PT, doctors and podologists and they told me I had a tendinopathy. I did several treatments, tried different shoes, did rehab and spent a ton of money on ortothics for nearly 6 months and the thing only got  worse. I then decided to stop running and focusing on cycling, because it was what I liked the most. Also, it didnt matter if I ran fast or slow, 5km or 15km, the pain was the same.\n\nSo I basically didnt run at all between 2022 and 2024, but I became even stronger cycling ( I was already okish then ) and doing 6-7hrs ride at decent paces and elevation was a normal thing for me. I really liked spending the whole day outside and doing 200+km in one sitting. I also was doing 1-2 days of strength conditioning weekly.\n\nI learned a lot about pacing, fueling and all that stuff. And around july last year, to help me loose more weight I decided to try again, so I went back doing walk-running and shorter 20-30minutes. The pain was gone, at least for such short efforts. After a month or two, I could do 10-12km pain free, and I said, ok, lets sign up for a half marathon and see how it goes. I did it, pain free, and almost the same time as my PB ( 1:48 vs 1:44 ) several years ago.\n\nAs I was enjoying quite a lot running, I decided, for the last time, to try finishing a marathon.\n\nI used to run with Asics, but this time I found a pair of somewhat cheap shoes ( Nike Zoom Structure,  cheaper compared to others I used before ) that fitted me perfectly, gave me no pain and no blisters or anything. I bought 3 pairs ( two of them on a sale ) and rotated them during these last months\n\n# Training\n\nUntil then, all the competitions I did, either running, cycling or triathlons, was with the help of a coach, not always the same, and I changed a few times. This time, as I didnt really care on times or anything much, I decided to go on my own. On my mind, the only deal I had is \"Ill prepare it until I feel pain, the first moment I feel pain ill stop and not try running again\"\n\nI had some experience in long distance and I was well aware that my main issue was the risk of getting injured, so I was not really looking forward of doing intervals or anything. I prepared a plan for myself of about 16 weeks, with 3 of increasing mileage and one with less and resting. Seeing this, I committed to ONLY running three times per week ( Tuesday, Thursday, and Sat/Sun, depending on week ), but instead adding quite a lot of cycling in between, to help with aerobic fitness without injury risk, specially in the first 10-12 weeks.\n\nI found 2 half marathons that had good dates so I could test myself, specially in terms of fueling.\n\nSome friends told me that running just 3 weeks wasnt enough, that I was going to lack mileage, while others told me it was ok. But I didnt care, I knew injury risk was a thing. Same with intervals, last time I got injured while doing them so I neglected them completely.\n\nMost of my training has been at paces around 6min/km, but mostly because I was running by HR instead. I did some progressive runs until week 10-11, to simulate fatigue, and was bouncing between resting pace or tempo. The closer the last test ( the 30km long run ) my long runs were faster and approaching my target pace. On the tapering weeks I went very easy and slowed then in general on purpose.\n\nMidweek days I started doing between 8-10km per day, followed by 60-90min easy cycling right after, which I felt It helped me also to recover in terms of muscle fatigue, and a long run on the weekends. As weeks passed I increased the distance and I was doing 14/15km per run plus the longer one on the weekend.\n\nIn the end, the week I did the most mileage was 66km, while I averaged 55km more or less. The first weeks I was doing 30-35 while the last 3 were around 60-66, including the 30km long run test. In terms of cycling, I was averaging 200-250km per week on the first 10 weeks, and around 80-150km on the later. I did 2 weeks of tapering, going down from 66km to 48, 35 and 18 on race week, excluding marathon.\n\nI did a 10k race by week 4 at higher than usual bpm ( 165ish ) and I clocked 47min, while on the half marathons I did 1:48 on each one of them, at an average 150-155bpm heart rate. On the second half marathon, I went cycling for almost 3hours on the same evening, without feeling exhausted or tired.\n\nI did the 30km test at 5:10 and 150bpm heart rate, and I finished strong, so my target was a little bit slower than that.\n\nI knew strength training was very important and knowing my past injuries, I had to put a lot of care into core, glue, quads and hips, so I focused most of my routine on that, based on agiliy rather than building muscle, so lots of repetitions with mid/low weight.\n\nI had zero injuries, pain or anything. It was by far, speaking about feelings, the best marathon prep I did. Even doing way less cycling than when I prepared the Ironman, I was much stronger. On the second prep, which I had faster 10k times, I did worse on the 30km and I felt much more tired overall due to the interval sessions I was doing and running 5 days per week which much less cycling. I also was able to go down to 86ish kilos, which has been probably my lowest weight ever since I started doing sports\n\n# Race day\n\nOr better said, race week :\\_)\n\nHere in Spain we have had rain for more than a month, and its been quite a cold winter. I did the first half marathon sick with flu, cough and whatever. And unfortunately, the week before race day I got another flu, but this time without fever, just coughing and mucus.\n\nThe days were passing and I wasnt feeling any better. The same morning I spent 30 minutes coughing at home. 10 minutes before the race started, I started coughing again and I ended up puking while I went to the toilet. I had issues breathing and if I started coughing it was hard to stop.\n\nI was with some friends, and I was seriously thinking on not even starting. As the circuit was quite condensed, and I really wanted to run, I decided to start and see how it went, with the thought of stopping if I was feeling too bad. Maybe it was not a wise decision, but I knew I would stop ASAP if things went too bad, so I decided to try.\n\nAfter 3h and 55 minutes I finished, at a slightly slower pace than expected. If I tried running faster I started coughing and I didnt want to puke right in the middle, as it could be risky.\n\nI enjoyed the race a lot even at my not ideal condition, I slightly slowed down on the aid stations to grab water and a bit after km 35 because my HR started spiking and I wanted to avoid coughing.\n\nNo pain while running, and the day after I only had slight cramps, and as of today, I feel completely recovered, compared to other races I did in the past.\n\nIm very very happy, because I started all of this with zero pressure, just running for the sake of running, and I enjoyed every single run and day I went out. When I did the first two tries, I was really dreading some days. Running more days could have helped me? I think so, but as I said, my main goal was avoiding injury :)\n\nNext year Ill probably run the marathon again, hopefully with better luck!",
      "author": "Morvisius",
      "created_utc": 1742653046.0,
      "score": 25,
      "num_comments": 4,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "tiktok",
    "instagram"
  ]
}