{
  "id": "twin_Augenfeind",
  "username": "Augenfeind",
  "activity_count": 1,
  "interests": [
    "shoes",
    "injuries",
    "there",
    "there's",
    "running"
  ],
  "post_times": [
    1753729669.0
  ],
  "history_sample": [
    {
      "id": "1mbp9eb",
      "title": "According to nowadays science: bare foot vs. supportive shoes vs. cushioned shoes",
      "selftext": "There's the latest test report from your favourite running magazine. There's the store owner of your favourite running shop who's also been a runner and trainer. There's \"Born to run\". There's the community. There are doctors. Every group seems to recommend the one best shoe type to use in the long term for mid to long runs.\n\nIs there some up-to-date science that would either recommend something like \"minimal shoes will prevent most injuries in the long term\" or \"cushioned shoes will do that best\"?\n\nOr is it - like so often - rather a \"it depends\"?\n\nWhich type of shoes (or none at all) will support ones feet in the terms of least injuries if one takes the time and training required to prepare the feet and legs properly to get used to them?\n\nIs there an answer?\n\n**Edit: TL;DR: of the answers so far:**\n\n*No, there is no clear evidence of any specific shoe type reducing injuries if compared to other shoe types.*\n\nThe types of injuries one gets are specific to every person and a special shoe type might reduce injuries for one person, but not for another, let alone in general.\n\nThe best advice is to have different types of running shoes and rotating them between the runs, as they pose different forces to one's feet and legs, so different muscles will be trained by that rotation.\n\nIn the broader view, muscle training is a key ingredient to reducing injuries, not shoes. To that respect, barefoot and minimal shoes can help, but there is no advice for (or maybe rather even advice against) using barefoot/minimal shoes without long and good training and without rotation with other types of shoes (unless you grew up without wearing any shoes, then pure barefoot running might be the best choice).",
      "author": "Augenfeind",
      "created_utc": 1753729669.0,
      "score": 62,
      "num_comments": 53,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "tiktok",
    "instagram"
  ]
}