{
  "id": "twin_runner3264",
  "username": "runner3264",
  "activity_count": 1,
  "interests": [
    "race",
    "that",
    "miles",
    "about",
    "mile"
  ],
  "post_times": [
    1750097977.0
  ],
  "history_sample": [
    {
      "id": "1ld0f1w",
      "title": "Race report: OSS/CIA 50-mile night run",
      "selftext": "\\### Race Information\n\n\\* \\*\\*Name:\\*\\* OSS/CIA 50-mile night run\n\n\\* \\*\\*Date:\\*\\* June 14-15, 2025\n\n\\* \\*\\*Distance:\\*\\* 50 miles\n\n\\* \\*\\*Location:\\*\\* Prince William Forest Park\n\n\\* \\*\\*Website:\\*\\* [https://athletic-equation.com/endurance-events/the-ultrail-series/osscia-50-mile-night-run-2/](https://athletic-equation.com/endurance-events/the-ultrail-series/osscia-50-mile-night-run-2/)\n\n\\* \\*\\*Time:\\*\\* 14ish hours\n\n\n\n\\### Goals\n\n| Goal | Description | Completed? |\n\n|------|-------------|------------|\n\n| A | Finish | \\*Yes\\* |\n\n| B | Don't die | \\*Yes\\* |\n\n| C | Finish under the time cutoff | \\*Yes\\* |\n\n\n\n\n\n\n\n\\### Training\n\nI came off a spring marathon a few months ago, and mostly focused on hill training between the marathon and this event.  I did one trail 22-miler about a month before the race, and I did a couple of hilly 15-16 milers on roads.  The race only had about 6k feet of vert over the 50 miles, so it actually wasn't insane.  I turned out to be pretty prepared with minimal training outside of a good marathon block--at no point in the race was my fitness a serious problem.  \n\n\n\n\\### Pre-race\n\nMy husband drove me to the park (we live about an hour away), dropped me off with my stuff, and then went to a hotel where he would be spending the night in a moderately comfy bed while I ran around in the woods.  The race was set up as a loop of about 26 miles, which you run twice.  I had two drop bags.  One was at the start/finish area, which I passed at mile 26, and one was at the other main aid station, which I passed at miles 10, 13, 37, and 40.  I had a bunch of snacks in each bag, consisting of dried fruit, those little fruit pouch thingys that you give to toddlers, rice krispie treats, and super sour scandinavian swimmers (they're the trader joe's version of sour patch kids, they're amazing).  I also had a ton of electrolyte packs, although I ended up only using 4 of the 12 that I brought.\n\n\n\n\\### Race\n\nThe race was super well-organized, and it started just a few minutes after 6pm on Saturday.  It was pretty hot at the start, maybe low 80s and humid.  It got much cooler starting around 7:30.  The first 15 or so miles were super uneventful.  I hit the first aid station at mile 10, snarfed down a Reese's cup and some watermelon, ran the 3-mile loop and came back to the aid station and snarfed down another Reese's cup and some more watermelon, along with a couple of quesadilla wedges.  By this point the sun has gone down and I've pulled out my headlamp.\n\n\n\nAt mile 15, it starts to rain.  Torrential rain. My eyes kept stinging and my sweat rag was the only item of fabric on my person that did not have bug spray on it, so I kept using that to wipe my eyes.  My glasses had so much water on them that I couldn't see very well, and the rain was obscuring visibility as well.  Needless to say, this stretch of the race kind of sucked.\n\n\n\nIt was still raining when I rocked up to the start/finish/halfway point.  I had a full change of clothes (including socks, shoes, and underwear) in my drop bag there.  I decided to change despite the rain, on the grounds that for one brief, glorious moment, I would be dry.  As it happened, in the 7 minutes that it took me to change clothes, the rain stopped.  I have literally never been so happy in my \\*life\\* to see the weather clear up.  I hung out at the aid station for a few minutes, ate some boiled potatoes and another Reese's cup, refilled my snacks, and headed back out.  \n\n\n\nAround mile 28, I briefly got lost.  There was a stream crossing that I hadn't remembered (on rocks, no getting wet involved), and at 1am I could not for the life of me figure out where to go.  Some dude came up behind me when I'd been wandering around confused for about 5 minutes and showed me where to go.  He and I ran the entire rest of the race together, and the company was super nice.  We were moving at about the same pace, and having a little bit of conversation and navigational consulting was really really helpful.  \n\n\n\nWe hit the aid station again at mile 37.  Y'all, they had pierogis.  Hot, delicious, wonderful, magical portable potato pockets.  I had four.  Then we ran the lollipop bit, and I grabbed a couple more pierogis for the road at mile 40.  At this point, we were probably running half and walking about half.  I started getting blisters around mile 38, probably from the wet socks, and the blisters were consistently the limiting factor from there on out, rather than my fitness.  \n\n\n\nBy the watch, the race ended up being 53 miles.  I got exceedingly grouchy in the last 2 miles, because I was mentally prepared for 51.5-52 miles, but not for 53.  But we finished!  My running buddy was encouraging me and pulling me along for the last few miles, which I really appreciated.  I might have given up on making the cutoff without him.  \n\n\n\n\\### Post-race\n\nI crossed the finish line, heard tons of people cheering, and then collapsed onto a bench at a picnic table.  I caught up with all the people I'd chatted with during the race to see how they'd all done.  All of them finished!!  Including two guys doing their first ultra.  Seemed like most people had a really good night, despite the rough conditions.  I ate a couple of pancakes, and my husband picked me up from the finish area.  \n\n\n\nHe took me back to the hotel he'd stayed at so that I could shower.  Guys, I don't remember the last time a shower felt that good.  I smelled like wet feet at the end of the race, and cleaning off all the mud/sweat/bugspray felt amazing.  I made him stop at Chipotle so that I could get a 10:30am burrito, then I napped on the way home.  I napped for another couple of hours once we got home, and felt surprisingly okay afterward!  \n\n\n\nThe only serious physical consequence is that my blisters alone should really qualify me for short-term disability.  I have 12 of them, mostly big ones.  One on the bottom of each toe, and one on each heel.  I have one on each foot that goes between my big toe and the next toe, so right where flip flops sit.  I intend to whine about them extensively until they heal, because whining about minor self-inflicted injuries always makes them heal faster.\n\n\n\nOtherwise, I'm feeling great!  I'm burning some sick leave today so that I don't have to go to work, but now I can stalk ultrasignup to find my next race :) \n\n\n\n\n\nMade with a new \\[race report generator\\](http://sfdavis.com/racereports/) created by u/herumph.",
      "author": "runner3264",
      "created_utc": 1750097977.0,
      "score": 25,
      "num_comments": 5,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "youtube"
  ]
}