{
  "id": "twin_Zhirall",
  "username": "Zhirall",
  "activity_count": 1,
  "interests": [
    "that",
    "this",
    "your",
    "race",
    "like"
  ],
  "post_times": [
    1758591949.0
  ],
  "history_sample": [
    {
      "id": "1no4uy9",
      "title": "Broke runners rejoice : How to not feel like shit + tips and tricks",
      "selftext": "Hey everyone!  \n  \nFirst off, thank you for clicking on this post. Reddit can feel like a whirlwind of endless content, so the fact that you're here means a lot!\n\nI’m 21, a full-time student, and I started running back in April. Since then, I’ve completed two half marathons and a 10K, and I’ve loved every second of it. I know that’s not your average beginner’s first six months, but I came into running with a solid fitness base from hiking, skiing (I’m a ski instructor), and rock climbing. Running felt like a natural extension and best of all, it was free. As such, it was the only sport I could afford.\n\nThis spring, summer, and fall, my job’s run club covered the entry fees for three local races, which made it possible for me to participate. Without that support, I wouldn’t have been able to afford it. So yeah, I’m broke, but that’s student life, and I’m okay with it. I’ll have “adult money” one day.\n\nNow I’m looking ahead: I want to run my first full marathon next summer. The same run club will cover the entry fee for one marathon (the only one in my city), and I want to take that opportunity. But I’ve got questions and I’d love your advice.\n\nThe short form : Running on a budget, how do you do it?\n\nThe long one : \n\n* Have any of you trained for and run marathons without the fancy gear such as carbon-plated shoes, Garmin watches and custom coaching plans?\n* What are your go-to strategies for keeping this sport affordable?\n* How did you structure your training when money was tight? How do you create your training plan if you are new to the sport and can't pay for a coach or expensive subscription?\n* What gear is truly essential, and what can you skip or DIY?\n* Can you run a marathon while keeping cost low?\n\n**Beyond these questions I also want to let this be a thread for broke runners.** Whether you’re a student like me, working adult, or retiree, if you love this sport but don’t have deep pockets, I hope this post helps you feel seen and supported. Let’s share tips, hacks, and encouragement for making running accessible to everyone.\n\nSpeaking for myself, at my last race, I was the runner with the oldest shoes in the people around me, a mismatched outfit that looked thrown together 2 minutes before the race (I picked it very carefully...), and a five-year-old Apple Watch that misreads distance and pace almost every time. I only started using gels about a month before the race, trying to get used to them just in time to chase a personal best. (They’re basically miracle fuel but wow, they’re expensive.\n\nI’ll be real : I felt like shit. At my last race, I looked around and just felt completely out of place. Everyone seemed dialed in: sleek gear, matching outfits, perfect watches, confident smiles. And there I was with beat-up shoes (I have plans to buy a new pair, don't worry), a glitchy old Apple Watch, a last-minute attempt at figuring out gels, hoping I wouldn’t crash halfway through. One runner in the same corral/behind the same official race pacer as me even told me to get new shoes lmao (that hurt, even if I don't think it was meant in a bad way!)\n\nI ran hard. I showed up. And yeah, I’m proud of that. But it’s hard to shake the feeling that I didn't belong in that race\n\nI’m sharing this because I need to feel seen. If you’ve been there, if you’ve run through that same problem, I’d love to hear your story. I think it might help me fall back in love with this sport. Or at least remind me why I started.\n\nThanks again for reading. I appreciate you all!\n\nEDIT : Some people are saying my post is AI. To be transparent I used it to clean up because English isn’t my first language and it’s hard to write in it. The questions and thoughts are still real !",
      "author": "Zhirall",
      "created_utc": 1758591949.0,
      "score": 72,
      "num_comments": 111,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "tiktok",
    "instagram"
  ]
}