{
  "id": "twin_ashleynst",
  "username": "ashleynst",
  "activity_count": 1,
  "interests": [
    "race",
    "this",
    "pace",
    "which",
    "with"
  ],
  "post_times": [
    1746454293.0
  ],
  "history_sample": [
    {
      "id": "1kfclkq",
      "title": "Race Report: (my first) 2025 HOKA Runaway Sydney Half Marathon",
      "selftext": "# Race Information\n\n* **Name:** HOKA Runaway Sydney Half Marathon\n* **Date:** May 4th, 2025\n* **Distance:** 21.1 km\n* **Location:** Sydney, Australia\n* **Website:** [https://runawaysydneyhalf.com.au/](https://runawaysydneyhalf.com.au/)\n* **Time:** 2:02:45\n\n# Goals\n\n|Goal|Description|Completed?|\n|:-|:-|:-|\n|A|Sub 2 (a girl can dream :\"))|*No*|\n|B|Sub 2:06:36|*Yes*|\n|C|Don't end up at the med tent?|*Yes*|\n\n# Splits\n\n|Kilometer|Time|\n|:-|:-|\n|5|29:49|\n|10|28:49|\n|15|26:57|\n|19.6|26:55|\n|21.1|10:15|\n\n# Training\n\nSome context which will hopefully be useful: I’m 21F and went for my first run in June 2024. I signed up for this half marathon (part of the blue group 2:00-2:15 finish) at the end of December 2024, and at this point, my 5km time trial time was 29:59.\n\nFor my first ever training block, I decided to follow Runna as I had absolutely no clue what I was doing. I only started running 6 months ago, averaging one parkrun a week, and getting injured every other week. I decided to get a grip and drop the ego, going from weekly 5km time trials to planned runs which included many zone 2 easy runs, tempo and long runs. My weekly mileage ramped up to a 28 km average during the 16 week training block (peaking at 46 km), which I fortunately stuck to and came out of unscathed. For my 15km long run 2 weeks out, I ran the final 15km of the course (downloaded the app RunGo which guided me through the previous year's route) at an average pace of 6:52min/km (I bonked hard). Runna helped add great structure to my runs as I had no experience planning all that out myself. I also have a weak gut so training with gels and training to eat before runs was a must.\n\nPrior to starting the training block, I was also a gym girly, but from then I only did one full body session per week to be able to balance my computer science degree, work and life.\n\n# Race Strategy\n\nAfter spending hours and hours reading race reports and watching youtube videos about half marathons, I devised my strategy (based off my 1:57:49 Runna prediction) of going out \"slow\", a 5:50/km pace and ramp it up by 10 seconds every 7km (so 5:50/km then 5:40 then 5:30). I knew this was a bit ambitious as the elevation was concentrated in the last 5km and a 22 km training run I did a month and a half before averaged a 7:31/km pace where I bonked hard (I bonked quite a lot of my long runs by not eating/hydrating enough).\n\nI downloaded the Race Screen on my Garmin watch which is really cool as it predicts your finish time which updates based on current pace and corrects the distance between the GPS-measured distance and the actual race course distance. My strategy was to manually lap every 5km when passing the course flags, as suggested by other runners.\n\nI brought out my kitchen scale and tracked basically everything I ate for the 3 days leading to the race, ensuring I was effectively carb-loading and not eating too much fat/protein. I also ensured my hydration levels were superb and took electrolytes and magnesium supplements to help ward off the cramps.\n\nI didn't run with any music or my phone as I preferred to lock in in silence.\n\n# Pre-race\n\nThe day before the race, I went on an easy 5km run to shake out the legs and got some final words of wisdom from a friend to not go out too fast or I'll die. My very initial strategy of sticking to a 2hr pacer was thrown out the window as apparently they do even splits and I wanted to start off a bit slower. The rest of the day consisted of eating and resting at my friend’s house as she very kindly offered her spare bedroom as her and her boyfriend were running the half as well! I had a good night's sleep (just over 7 hrs and a sleep score of 80 YAY), didn't eat breakfast before the race to play it safe with my sensitive gut. We set off to the start line at 5:50am so we had plenty of time to warm up before the 7:49am start.\n\n# Race\n\nFirst 7km block- I ran past the starting line at 7:48am with my friend and a dream. The first 7km had more hills than I expected, but I conquered them well by holding back on the incline. We were hovering just above 5:50min/km pace which I was ok with as at least we didn't go out too fast. It felt like a bit of a push as there was sun and I was starting to feel the heat, but it definitely felt like a pace I could hold on to for the rest of the run.\n\nSecond 7km block- The plan was to pick up the pace to 5:40/km for the next 7km, which felt a tiny bit rougher but still ok as it was dead flat. This was the part where we ran next to the water so it was nice to look at the scenery. Suddenly, my friend tells me her wig is annoying her and I turn around to see it flinging around in her hand. She tries shoving it in her shorts but ultimately it ends up in the bin. What a sight to see if you were running behind us.\n\nI knew the 7kms after this was hilly so I tried to bank some time while on the flat, running an average 5:35/km pace on this block. This felt pretty tough but I still had something left in me and a sub 2 was still on the books.\n\nThird 7km block- I turned to my friend to let her know this was where the runners' k-hole began, as we now had to speed up to a 5:30/km pace, and face the hilly parts of this run. Unfortunately she dropped off 2km in and I had to face the hills alone. I tried not to panic when I saw the first one as I still had energy left in me to make up time on the decline, I just didn't let myself start walking. The hills felt never ending and my legs were starting to give out. I felt my inner thighs starting to chafe which was unfortunate since I've done multiple long runs in my shorts and have never had this issue. I'm assuming I went too hard on the carb load. After running up the majority of the hills, it seemed a sub 2 hr was still possible if I sprinted the last 3km (Macquarie's chair loop). I realised quickly that it was not happening, my legs started to feel really heavy and a side stitch was developing. I had to ditch my dream and settle for my B goal of a sub 6:00/km pace. I was well within so I was content and made it my mission to still finish off as strong as I could. The crowds were extremely uplifting with many cheers and people screaming out my name that they could read from the bib. My stitch disappeared and I got somewhat of a second wind for the last km. I tried smiling to delude myself into making the pain go away and finally I made it to the finish line.\n\n# Post-race\n\nI began the crawl to the end of the finishing area where I could finally sense freedom. I picked up my medal, along with a can of water and an apple and made my way around so I could watch my friend finish. My right foot started to hurt, along with my knee and unfortunately we had to start the march to the train station, approximately 20 minutes away.\n\nMy Garmin watch tracked 21.44km, very similar to my friend’s 21.42km on her AW S9.\n\n# Final thoughts\n\nUltimately, I don’t think I could’ve had a better result and had so much fun running the iconic Sydney half marathon. I wouldn’t have changed a thing except for applying chafing cream on my inner thighs.\n\nNow a day after, my legs feel pretty much completely healed and I’m ready to get running again. I’ve signed up for 3 shorter races, all in August, and have my sights set on signing up for my first marathon next year in Gold Coast!\n\nMy one tip to end off this race report - do not wear the LSKD Accelerate 3\" Running Short UNLESS you want your cheeks to be out.\n\nMade with a new [race report generator](http://sfdavis.com/racereports/) created by u/herumph.",
      "author": "ashleynst",
      "created_utc": 1746454293.0,
      "score": 31,
      "num_comments": 18,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "instagram",
    "youtube"
  ]
}