{
  "id": "twin_AnonymousFairy",
  "username": "AnonymousFairy",
  "activity_count": 1,
  "interests": [
    "training",
    "this",
    "with",
    "week",
    "time"
  ],
  "post_times": [
    1754753874.0
  ],
  "history_sample": [
    {
      "id": "1mlseeu",
      "title": "5km training plan for fit(-ish) people who aren’t necessarily runners",
      "selftext": "Hello everyone, long time lurker first time poster. This didn't feel like it fit in the training or race report threads as my aim is to share this resource to those in a similar position as I was and endorse this training plan!\n\nBriefly, I do not identify as a runner in particular, but am generally well rounded in fitness training. A few months ago I signed up to a charity race with some colleagues (several of whom very much are runners!) and we made a commitment to all try and set PBs with sub-20 minutes 5km race time, whilst raising money for a good cause.\n\nAs someone who would run every now and again as part of a training history that in particular pays more attention to strength and conditioning, I sought out a training plan to focus these efforts for someone who has some base fitness, but isn’t a particularly advanced runner. I came across \\[this article\\](https://www.mymottiv.com/5k-race/advanced-5k-training-plan) by Amanda Wendorff. I bastardised an intermediary of the 8 and 12 week plans into 10 weeks, then followed the programme damn near to a T. It took my 5km time from an (estimated) 23min down to 19m29s and I would like to share my experience here as an endorsement of this article / the training contained within.\n\n***Background***\n\nMale, mid-30s, 5’10”, military background (so on the fitter side of average but nothing special). Past few years have been strength training focused and not much intensive running since late 20-teens. Before this programme I would do the odd park-run type thing or charity race, the kind of person who would sign up to a 10 miler and without training specifically for it finish in about 80mins. At the start of this training I weighed 91kg. I have no fancy trainers or running gear and used a Garmin Instinct 2 for pacing and HR monitoring throughout training. I took no supplmentation whilst running, although from approx week 5 (as described below) did modify my diet slightly to aid weight loss as we got closer to race day, at which point I was approx 87kg. I do not smoke, I drink sporadically / socially (avg 1.2 units per day across this training period) and generally prioritise rest & sleep sufficiently to recover well.\n\n***The Programme***\n\nFollowing the above linked article, training weeks were split into 4 sessions. To fit my work schedule, I planned Mondays as the “intense” run (generally high interval and anaerobic training), Wednesdays as the “steady” run (threshold and tempo training), Saturdays as the long run and Sundays as the easy run.\n\nAll intense / steady workouts have a planned 10min warm-up (with strides) and 10min cool-downs which are supposed to be HR based – in reality, my warm up was running to my preferred running location, which included a big old hill, at a comfortable slow jog with strides down the far side of the hill. Generally this naturally kept to the HR limitation and my cool-down would involve the reverse of said hill, so no way in hell getting my HR down to the target zone, but albeit an easy(ish) jog of 9-10min/miles was typical. During the 20 training sessions, I completed at least 15 of the planned warm ups / cool downs, but a few were halved in time to fit the training in on certain days when I was forced to run during lunch breaks at work etc..\n\nPaces for easy and long runs were based on Z1 and Z2 heartrates, so realistically for me meant HR<150 bpm being the determining factor for completing these workouts.\n\nPaces for intense and steady workouts were formulated in accordance with the article and therefore based on my \\*target\\* speed of 6m27s per mile (unapologetically I work in miles, sorry!), using Z3-Z5.\n\nWith paces and zones all calculated, I created my training plan using Garmin Connect and at the start of each week deleted the previous intense / steady run plan from my watch and uploaded the 2 new ones. Simple! About an hour’s prep and then minimum fuss to follow for the 10 weeks after – I am not one who enjoys having to think about what I’m doing when running, I like the technology to be counting / timing and pacing for me.\n\n***Comments***\n\nI was very keen to keep strength training concurrently during this programme, lifting 4x / week at a low volume and predominantly upper body... but by about week 4 the cumulative fatigue was simply too much and I could feel both lifts and runs starting to suffer. As a result, I cut resistance training and had 1 full body session (low volume) once a week, usually Thursday as advised by the article but occasionally Friday.\n\nAbout this time I had noted that my weight had dropped slightly – not unexpected – and around 5 week made a concious effort to allow this to continue. The only modification to my diet was to replace my not inconsiderable work lunch (5x / week) with Huel and otherwise eat as I normally would, including snacking on various fruit across the day. That was sufficient to keep the weight loss at a steady 0.5-0.75kg/week, and although often peckish during the day, not feel like I was depriving myself at any stage or overly hungry.\n\nOtherwise I stuck religiously to the programme. I made all paces programmed with the exception of Intense 2 and Intense 7 – the intervals were too hard and I slipped out of goal paces for multiple intervals in both as the workout progressed. Having pace targets of a range was gratifying in that I could achieve the vast majority of workouts even on low energy days, if I put in a great deal of effort. And on high energy days I would be in the faster range of aim pace. So in both respects, the mental battle / post-workout euphoria was always gratifying! I did not feel myself getting faster or fitter particularly, but in hindsight progress week to week was a steady improvement that is visible over the month-to-month span. The programme ends with an intentional taper as expected before a race.\n\n***Race Day***\n\nFor the actual race, our strongest runner (who very much does identify as a runner and as has a sub-17m 5km time!) acted as our pacer and intentionally wanted to “save a little time in the bag in case we needed it” towards the end, so was pacing us to 6m18s miles – something he only told us as we started and too late to discuss! Given the programme does not really simulate a 5k well in the weeks leading up to the race, it was very hard to gauge if I would have the legs and I had to put complete faith in the training plan. And in truth, without the pacer I doubt I would have put in as strong a performance as I did on the day. Either way...\n\nIt worked. Finishing the first mile was difficult, but I wasn’t blowing as we hit our first 6m18 aim – the second mile was starting to kick in as a real mental effort to keep going as we approached 13 minutes, but knowing you’re two thirds complete is a huge boon to carrying on… as the finish came into sight with a third of a mile left to go, our pacer silently increased slightly to 6min/miles and I started struggling for breath – around 200y from the finish, I was in full tunnel vision and gasping, fell back from the main group shouting at them to carry on. Hindsight checking my garmin, they must have gone for the sprint finish we’d all joked about as my ‘falling back’ pace to the end was 5m50s/mile and we all smashed our sub-20min target by at least 30 seconds. My HR hit 194 for 30 seconds in that last stretch (it had never exceeded 190 in training), but the 40 training sessions totally approx 35hrs running did the trick and I cannot endorse \\[this training article\\](https://www.mymottiv.com/5k-race/advanced-5k-training-plan) by Amanda Wendorff strongly enough to anyone of reasonable shape who wants to chip down their 5k time relatively quickly.\n\nComments and critiques of the article welcome please.",
      "author": "AnonymousFairy",
      "created_utc": 1754753874.0,
      "score": 0,
      "num_comments": 9,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "tiktok",
    "instagram"
  ]
}