{
  "id": "twin_ma0422",
  "username": "ma0422",
  "activity_count": 1,
  "interests": [
    "with",
    "race",
    "half",
    "this",
    "\\###"
  ],
  "post_times": [
    1744834913.0
  ],
  "history_sample": [
    {
      "id": "1k0ues7",
      "title": "Race Report - Jersey City Half Marathon",
      "selftext": "\\### Race Information\n\n\\* \\*\\*Name:\\*\\* Jersey City Half Marathon\n\n\\* \\*\\*Date:\\*\\* April 13, 2025\n\n\\* \\*\\*Distance:\\*\\* 13.1 miles\n\n\\* \\*\\*Location:\\*\\* Jersey City, NJ\n\n\\* \\*\\*Time:\\*\\* 1:43:02\n\n\\### Goals\n\n| Goal | Description | Completed? |\n\n|------|-------------|------------|\n\n| A | Sub 1:45 | \\*Yes\\* |\n\n| B | PR (1:47) | \\*Yes\\* |\n\n| C | Course PR (1:49) | \\*Yes\\* |\n\n\\### Splits\n\n| Mile | Time |\n\n|------|------|\n\n| 1 | 8:14\n\n| 2 | 8:03\n\n| 3 | 7:58\n\n| 4 | 8:00\n\n| 5 | 7:59\n\n| 6 | 8:03\n\n| 7 | 7:59\n\n| 8 | 8:08\n\n| 9 | 7:58\n\n| 10 | 7:27\n\n| 11 | 7:23\n\n| 12 | 7:20\n\n| 13 | 7:09\n\n| .2 | 6:52\n\n\\### Training\n\nI've been running consistently for about 4 years now. Been working with a coach since the fall of 2022. Half marathon progression:\n\nMay 2022 - first half: 1:52\n\nSeptember 2022 - poor training, no idea what I was doing: 1:56\n\nApril 2023 - first race with my coach's help, but didn't listen properly to the pacing and went out too hard: 1:49\n\nMarch 2024 - first race post NYC marathon injury, learned how to race and pace properly: 1:52\n\nApril 2024 - decently hilly race, 2 loops of Central Park, everything clicked: 1:47\n\nMy half marathons in 2024 were pretty solid, I had pretty large negative splits that made my coach think that I probably had more to give in the half, plus I now had a whole extra year of training under my belt, and Jersey City is a flat course.\n\nMy last race was the Berlin Marathon in September of 2024, where I came away with a 36 minute PR, so I knew I had gained a considerable amount of fitness since the last time I raced a half. But this training block had a few bumps along the road. I had a minor calf strain in the beginning of February due to my own stupidity by running at a bachelorette party where I was not properly taking care of my body. Luckily, it was very short-lived and I only missed a couple of runs. At the end of March, I came down with bronchitis. Doctor said it was the very early stages, thankfully and I missed about 10 days of training, plus a 10k race that I was supposed to do leading up to the half. This ended up being the right decision, as I didn't want to jeopardize my chances of running a good half. Coming back to running took a little longer than I expected, and I'd be lying if I said I didn't get frustrated. We began to wonder if I'd even be able to run the half at all and started looking at backups for later in the month. But eventually, everything fell into place, although this definitely made me a lot more nervous for the race, knowing that I had missed a bit of training. My coach insisted that my consistency up until this point made more of a difference than missing a few training sessions, so I trusted her! I felt extra nervous, though, not having raced in about 7 months.\n\n\\### Pre-race\n\nSlept alright the night before and woke up to my alarm at 4:50 am. I had my breakfast of toast and a banana, got ready, and jogged over to the start as I live in walking distance. I got in a few strides and warmup drills and before I knew it, it was time to line up. It looked like the rain was going to hold off, which I was happy about. The weather was about 34 degrees with a bit of wind and no sun, so a little cold waiting at the start but really, near perfect race weather. I will take the cold over the heat any day! I didn't feel great for whatever reason on my jog over (maybe it was just in my head) so I started preparing for the fact that it may not be my day today, and that's ok.\n\n\\### Race\n\nThe plan was to hover around the low 8 - 8:10 range for the first 9 miles, and then for the last 4, go for it with whatever I had left - ideally, somewhere around a sub 8 pace but \"don't limit yourself to that\". This is typically how my coach paces it out for me with elapsed time at a couple of splits, and I had done pretty well executing this on my last few races (after learning my lesson from my first half working with her!). I was a couple of seconds faster than intended on some of these early miles but I trusted my gut and went with it, as it felt pretty good and I wasn't crazy off like I had been in the past. The miles were actually flying by, even during the middle of the race (6-8) where sometimes, I find it can be a bit of a mental struggle. I saw a few people say they had issues with the course being crowded but I personally didn't experience this at all, other than a little on the first half a mile or so. Anyway, the pace felt good, comfortably hard, but I grew increasingly nervous (as I always do) about mile 9 approaching. I questioned if I'd really be able to pick it up for these last 4 miles. Even though I wasn't struggling at this point, it seemed daunting.\n\nSlight incline around mile 8, nothing bad, but noticeable given how flat the rest of the course is. But I stayed on track. Before I knew it, I hit mile marker 9. Here we go! When I saw my pace in the 7:20 ish range, I thought, \"there is absolutely no way I can hold onto this for 4 miles, but let me try for as long as I can\". In the back of my mind, I worried I had pushed it too hard and was going to burn out, but at this point, I figured, let's just go with it. It was already happening! It never ceases to amaze me how your mind really, truly does give up before your body does. It sounds stupid when I say it now, but I kept reminding myself, \"it's not supposed to be easy\". By the last 2 miles, I was definitely fighting for my life but I somehow held on. Sometimes when it really gets hard, I like to break it down into time chunks. So I thought to myself, \"only 15 more minutes of running\". \"Only 7 more minutes of running. You can do that\". Finally, the home stretch was approaching. I saw my husband and parents and could barely lift up my arm to wave! I gave that final push everything I had left in me, crossed the finish line, nearly fell over, and some nice volunteer helped me up lol. I was truly shocked when I saw my finish time. I knew I was probably capable of a 1:45 on the right day, but I did not think I was anywhere near a 1:43 yet. Let alone, 3 seconds away from being in the 1:42 range!\n\n\\### Post-race\n\nI met up with my husband and parents, we had a nice breakfast, and then I celebrated with a few friends. I'm still riding the high 3 days later! I say it every time, the half marathon is my favorite distance to race. Next up, CIM in early December!\n\nMade with a new \\[race report generator\\](http://sfdavis.com/racereports/) created by u/herumph.",
      "author": "ma0422",
      "created_utc": 1744834913.0,
      "score": 16,
      "num_comments": 6,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "tiktok",
    "instagram"
  ]
}