{
  "id": "twin_pww92",
  "username": "pww92",
  "activity_count": 1,
  "interests": [
    "that",
    "with",
    "about",
    "also",
    "would"
  ],
  "post_times": [
    1744648458.0
  ],
  "history_sample": [
    {
      "id": "1jz3aiw",
      "title": "My fix for posterior shin splints in less than a month without taking time off or decreasing my training volume",
      "selftext": "I understand that posterior shin splints can have multiple causes and are quite a complex injury to treat. In my case, I'd been dealing with them for months, and they became gradually worse as I progressed through my half marathon training progression. For reference, I got into the sport about a year ago and have been running about 20-30mpw. Would also consider myself of average height/weight with above average fitness as I also cycle and weight train quite frequently. \n\n**Type of pain / what I tried**\n\nI had posterior shin splints in both legs (the pain was specifically on the inside of my leg about 3-6 inches above my ankle) but it was significantly worse in my left. At its worst, I would feel it in my day-to-day walks, and progressed to about a 6/10 pain that sharply rattled my lower leg with every stride at the start of every run (though it would subside after about 5-10 minutes). I would then take 2-3 days off, let it heal slightly, get too inpatient, start running again, and basically let the whole process cycle over. After about 2 months of frustration, I eventually started implementing the following:\n\n1. Resistance band exercises - 15-20 mins of theraband around my foot with a focus on ankle inversion (and flexion to a lesser degree). [Example](https://www.youtube.com/watch?v=bjiw7u3WlRE)\n2. Foam rolling and stretching my calves more often before and after runs\n3. Massaging my posterior tibialis daily\n4. [KT tape on my foot for long or interval runs](https://www.youtube.com/watch?v=hOzBKJy2JMA)\n\nAs mentioned, I was also strength training regularly and training legs about 1-2x week (heavy dumbbell squats, bulgarian split squats, hip thrusts, weighted calf raises, hip abduction machine, deadlifts). Would say all of the above had probably helped a bit (if anything, I did get much faster at running) but the pain never really improved or decreased in a meaningful/noticeable way. \n\n**What actually worked**\n\nI had a [mobo board](https://www.moboboard.com/) from a peroneal tendonitis injury a year prior that was collecting dust (the injury was related to my cycling and eventually went away). So I hardly used it and to be honest, didn't really love using it either because all of the workouts made me really uncomfortable and were just plain difficult. It was also hard to track improvements/progression which was pretty demotivating. After doing more research online about the injury, I eventually decided to give it another shot and decided to create and actually stick to a plan with the mobo board this time around. I used it consistently for close to 3 weeks and turns out it actually worked. If anything, I started seeing noticeable improvements after the 1st week with the following plan (did this about 3-4x a week):\n\n1. 1 set of [this exercise](https://www.youtube.com/watch?v=Lz746AklSa4), odd #s, anywhere from 10-20 reps. \n2. 1 set [banded twists](https://www.youtube.com/watch?v=p3uyQgj21j0), even #s, 10-25 reps\n3. 1 set [banded pulls](https://www.youtube.com/watch?v=tbNA_Xau6yw), even #s, 10-25 reps\n4. 1 set one-legged body weight romanian dead lifts, odd #s, 10 reps\n5. 1 set [eversion pass around](https://www.youtube.com/watch?v=yhsZkLfespc)\n\nYou'll notice the rep ranges are pretty wide. I tried to be lenient here because in my experience, fighting to a specific amount of reps was usually VERY painful and unpleasant, which meant I'd be less likely to do these exercises on a consistent basis. i.e. I'd rather do these 3-4x a week with shitty reps vs. being discouraged and stopping altogether. Also worth noting that I was also still doing all of the above. This specific mobo board routine took anywhere from 15-20 minutes. \n\n**Thoughts / Theory / Disclaimer**\n\nCan promise i'm not a shill for the board, I just think it works quite well. You can probably get by without using one and attempt to replicate the above routine on your own with just the ground or maybe a balance pad. Though I'd imagine it would be hard to do as there are few ways to effectively recreate that specific type of foot balance/activation. However, if i were to guess, this probably has less to do with the board itself and more to do with simply shifting the focus away from strengthening the tibialis and more towards increasing foot strength, balance, and coordination - this makes sense for me at least, given my history of a weak foot/ankle from repeated sprains, etc. My take is also that posterior shin splints are generally caused by training load that is either 1) excessive (too much too soon/body hasn't adapted) or 2) incorrect (poor running form, foot/arch anatomy, hip weaknesses, etc). Exercises that strengthen the tibialis/shins would probably increase one's capacity to handle the load but if the load itself is less than optimal, then the former probably won't do much. The foot exercises / mobo board would target the latter in my specific case. \n\nSharing here mainly because most advice out there recommends individuals to stop running completely (or at least significantly reduce your volume) and what I did was able to circumvent that. That said, I also acknowledge that 1) my recommendations are completely anecdotal and this won't work for everyone 2) I am NOT a medical professional 3) rest & recovery is recommended probably because it WORKS and is the right thing to do 100% of the time. However, if you're stubborn like I am, and simply can't stop running ( to be fair, my mental health also deteriorates if I do), then this is probably something worth looking into. ",
      "author": "pww92",
      "created_utc": 1744648458.0,
      "score": 92,
      "num_comments": 38,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "twitter",
    "reddit"
  ]
}