{
  "id": "twin_planinsky",
  "username": "planinsky",
  "activity_count": 1,
  "interests": [
    "/km|",
    "race",
    "that",
    "with",
    "half"
  ],
  "post_times": [
    1747661410.0
  ],
  "history_sample": [
    {
      "id": "1kqbqhb",
      "title": "HiPRO Utrecht Half Marathon 2025",
      "selftext": "# Race Information\n\n* **Name:** HiPRO Utrecht Half Marathon\n* **Date:** May 18th, 2025\n* **Distance:** Half Marathon\n* **Location:** Utrecht, The Netherlands\n* **Website:** [https://utrechtmarathon.com/en/](https://utrechtmarathon.com/en/)\n* **Time:** 1:53:23\n\n# Goals\n\n* Primary goal: Sub 2 (Achieved)\n* Stretch goal: ~~1:50:00~~  1:55:00 (Adjusted due to injuries – Achieved)\n* Real goal: Beat my colleague and earn bragging rights (Nailed it.)\n\n# Background\n\nThis was my second half marathon. I signed up for it at the end of 2024, after some friends from college (who live in Utrecht) proposed we all run it together. I’d just started getting into longer runs and thought, why not. Then I saw it would have around 15,000 participants — and since I get a bit stressed with big crowds, I figured it was a good idea to first test myself in a smaller local HM (\\~800 participants) to get used to the whole race-day thing. That was back in April, and I was in very good shape. PB’d at 1:50:13.\n\n# Training\n\nThis didn’t go as planned.\n\nFor my first HM in April I followed the \"Amy Garmin Coach HM plan\" with 4 days of trainning per week, though I started with higher milleage than the coach reccomended. In practice this consisted in a two slow runs, 1 day of series, 1 long run per week.\n\nI expected a quick recovery from the April race and a smooth transition into Utrecht… but no. I struggled more than I thought to bounce back, and then I had a fall that led to a sort of tendinitis in my hip. That kept me quiet for a few weeks, and after that, I reduced both the frequency and length of my runs to avoid a reinjury. The original plan was to keep with a \"Coach Amy\" style training, but with the injury weekly mileage dropped from \\~45 km to \\~20 km, and I only managed two long-ish runs of 17 km in the month and a half before the race. I initially aimed for a 1:50 finish, but I adjusted that to 1:55 once it was clear my legs weren’t in full form.\n\n# Pre-race\n\nThe start & finish lines are in the Utrech Science park, outside of the main city. The area is good for logistics as it has a lot of space, though it may be a bit hard to reach if you don't bike.\n\nBiked \\~8 km from where we were staying to the starting area — pretty solid warm-up, actually. But yeah, the crowd was a bit much. I’m used to running alone in the forest, with the occasional bird or roe deer as the only spectators. Here, there were thousands of people cheering, music blasting, and runners everywhere. I was in Wave 3, got into the starting box at my assigned time, but somehow ended up surrounded by Wave 4 bibs. Not sure what I messed up, but when the race started, I had to weave through a big chunk of the pack in some pretty narrow streets.\n\n# Race\n\nMy legs felt heavy at the start — not terrible, just not fresh. But after a couple of km I got into a solid rhythm, pacing right at 5:18/km like a metronome. I guess that's the nice thing of a flat race.\n\nThe initial kms were a bit stressing, too much dodging having to overtake the Wave 4 crowd. Things got a lot better after KM 5, once I managed to overtake the 2:00:00 pacers and the field opened up a bit. The crowd support was great — but at times, it was overstimulating. I honestly enjoyed most the \\~7 km in the middle of the race where we left the city, passed through nature and smaller villages, and the crowd got more sparse. That stretch felt a lot closer to my usual training runs — more peaceful, and easier to focus.\n\nThat held until about KM 17, when my dip in training started to show. So I slowed to around 5:25–5:30/km for the last few kilometers.\n\nCouple of annoyances:\n\n* At water stations, why does everyone throw their cups on the floor when there were more than enough huge trash cans *right there*? I get it if you miss, but this was just chaos.\n* “Social running groups”: I ran into several clusters of 4–5 people chatting and jogging side by side in narrow paths, going slower than the pace around them. Totally fine to run together, but when you block the whole road, there's plenty of room in front of you, and create a bottleneck, it’s a bit annoying — especially when you're starting to feel tired and just want to keep your rhythm.\n\n# Post-race\n\nFinished in 1:53:23 — 3 minutes slower than my PB, but I’ll take it. Most importantly, I beat the two colleagues I had to beat. That buys me bragging rights until the next one, which is what truly matters.\n\nThe race goodies felt a bit short for the price, compared to other races I've participated (60ish euros for the medal, a chocolate bar and the tshirt).\n\nBut seriously, the weekend with my friends was great. The race was just an excuse, and in the end, that’s the part that sticks.\n\n# Splits\n\n|Split|Pace|\n|:-|:-|\n|1|5:19 /km|\n|2|5:17 /km|\n|3|5:16 /km|\n|4|5:17 /km|\n|5|5:19 /km|\n|6|5:19 /km|\n|7|5:20 /km|\n|8|5:17 /km|\n|9|5:20 /km|\n|10|5:19 /km|\n|11|5:19 /km|\n|12|5:16 /km|\n|13|5:17 /km|\n|14|5:16 /km|\n|15|5:18 /km|\n|16|5:18 /km|\n|17|5:26 /km|\n|18|5:25 /km|\n|19|5:26 /km|\n|20|5:29 /km|\n|21|5:34 /km|\n|22|5:23 /km|",
      "author": "planinsky",
      "created_utc": 1747661410.0,
      "score": 25,
      "num_comments": 3,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "tiktok",
    "instagram"
  ]
}