{
  "id": "twin_Hungry_Opossum",
  "username": "Hungry_Opossum",
  "activity_count": 1,
  "interests": [
    "mile",
    "miles",
    "that",
    "with",
    "this"
  ],
  "post_times": [
    1744817175.0
  ],
  "history_sample": [
    {
      "id": "1k0n5vs",
      "title": "Race Report: Hogeye 2025",
      "selftext": "### Race Information\n* **Name:** Hogeye Marathon 2025\n* **Date:** April 12, 2025\n* **Distance:** 26.2 miles\n* **Location:** Springdale, AR\n* **Time:** 4:05:20\n \n### Goals\n| Goal | Description | Completed? |\n|------|-------------|------------|\n| A | 3:55 | *No* |\n| B | Sub 4:10 | *Yes* |\n| C | Don't Poop during the Run  | *No* |\n \n### Splits\n| Mile | Time |\n|------|------|\n| 1 | 9:37\n| 2 | 9:22\n| 3 | 9:28\n| 4 | 9:14\n| 5 | 9:22\n| 6 | 9:33\n| 7 | 9:40\n| 8 | 9:22\n| 9 | 9:19\n| 10 | 9:17\n| 11 | 9:01\n| 12 | 9:26\n| 13 | 9:24\n| 14 | 9:14\n| 15 | 8:47\n| 16 | 9:04\n| 17 | 9:19\n| 18 | 9:42\n| 19 | 10:00 (yikes)\n| 20 | 9:57\n| 21 | 9:30\n| 22 | 10:00\n| 23 | 10:07\n| 24 | 10:10\n| 25 | 10:05\n| 26 | 9:23\n| 27 | 8:30\n \n### Training\n \nHaving used Hal Higdon before, I wanted to change it up and use a more customized, tailored plan. After an exhaustive amount of research and hand wringing, I decided to used Hanson's basic (not beginner) plan. I personally enjoyed this plan due to the rest day between tough workouts, flexibility, and the fact that it made me run six days a week, keeping the complacency down.\n \nI was very unsure about the LR only being 16 miles, but I have two kids under three so it was appealing; several 20 milers really takes a toll on family time, and is hard to really budget time for. That said, due to the aforementioned children being breeding grounds for illness and sleepless nights, I only completed 79% of the program - not ideal, but we do what we have to. Most of the miss came from a longer-than-prescribed taper (because one of the kids got me sick) and a week long spring break trip. Luckily spring break helped me start my carb load early, 15 beers a day will do that.\n \nI definitely wish that I would have finished more of the plan, but all in all I was pretty happy with the training block. I only missed the shorter easy runs, and hit every long run and major workout, even if they took some reorganizing. I think this contributed more to my \"success\" than sticking strictly to the schedule would have - I'm happy that I made the hard workouts, and missed some easy runs, but wish I could have 100%'d it. Also, 25 weeks injury free! Woohoo!\n \n### Race\n\"F it, we'll do it live\"\n \nFeeling a little nervous from my underwhelming training block, I decided to channel my inner Bill O'Riley and send it. Breakfast was some of my wifes amazing homemade sourdough topped with PB to finish my three day carb load, and I was loaded down with Gels. The gun was scheduled to go off at 7, so I arrived promptly at 5:00 to stretch, loosen up, and try to take my morning constitutional. I did not, in fact, get to poop.\n \n##Miles 1-5\nThese went pretty well; Hogeye is a course that gets progressively more difficult as it goes, peaking at miles 12-15. I wanted to have a negative split, so I hung with the 4:15 pacer with the plan of breaking off later. I *would* have started with the 4:00 pacer, but he sprinted away at the starting line and I never saw him again, I guess he was doing his own thing. Or maybe he robbed the actual 4:00 pacer and stole his flag, the world will never know. At Mile 5 I had my first Gu and marched on.\n \n## Miles 5-10\nMy favorite part of the course, bar none. Still hanging with the 4:15 pacer, I started to pull away at mile 7. Miles 7-10 are right by my house, and I run them every single day (which seems like cheating), so I knew exactly how hard to hit the mile 7 hill and do the mile 8.5 straightaway. Also, my wife and kids were at mile 8 which always gives me a big boost.\n \n## Miles 10-15\nHere's where things start to get. . . poopy. Around mile 11 we have the honor and privilege of running next to the Tyson slaughter house, so you can understand why that mile has a much faster split than 10/12. Mile 12 is where the hills start in earnest, rolling for the next three miles or so. Not unbearable, but I live here, so I'm quite used to NWA's rolling hills. There's around 940ft of elevation gain on the Hogeye, and most of it comes on these three miles. I kept as much of a negative split as I could here, knowing that I would need to bank some time for the inevitable code brown that met me at mile 15. Luckily, this race is very generous with the porta-johns.\n \n## Miles 15-20\nNot much to report here, the five miles after running through the baseball stadium (which is awesome!) are my least favorite. One more big hill, and then a whole lot of nothing. I was alone for most of this stretch, but got to run by my church which was cool, even if the preacher didn't notice me. The back of this stretch is where I started to feel it, with my hips tightening up at mile 18. I definitely didn't hit \"the wall\", but the dramatic elevation gain finally took its toll. Mile 20 to the end is, in my opinion, where I most suffered from my under-training.\n \n## Miles 20-26.2\nBig chilling by this point. The crowd was excellent for this part of the race, which really helped to alleviate some of the boredom/fatigue that started to set in during the mile 15 block. We hit JB hunt park around mile 23, which means a very nice down hill section. Also, mile 23-26 is by far the prettiest part of the course, even if the racers had thinned out dramatically. I ran this section several times on my longest runs, and I think that really contributed to my finish.  Although I was gunning for a negative split, I didn't completely fall off the wagon, and I'll call it success enough for my first marathon. Taking recommendations for my next, which I would like to do this fall.\n \n \nMade with a new [race report generator](http://sfdavis.com/racereports/) created by /u/herumph",
      "author": "Hungry_Opossum",
      "created_utc": 1744817175.0,
      "score": 8,
      "num_comments": 3,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "instagram",
    "youtube"
  ]
}