{
  "id": "twin_Juliogol",
  "username": "Juliogol",
  "activity_count": 1,
  "interests": [
    "race",
    "that",
    "with",
    "able",
    "running"
  ],
  "post_times": [
    1742206814.0
  ],
  "history_sample": [
    {
      "id": "1jd9c92",
      "title": "Half Marathon Race Report - Everything is Possible!!",
      "selftext": "Hey guys, just wanted to share my race after what was and unforgettable pre race week and not for some fun reasons! Let me explain.\n\nRace Information\n\n* **Name:** Media Maraton Villa Carlos Paz * **Date:** MARCH 16, 2025 * **Distance:** Half Marathon * **Location:** Cordoba - Argentina. *** Shoe for the race: New Balance SC Elite V4 (first race using carbon plated shoes)\n\nAbout me: started running in 2021, at 41 YO, now I am 45 YO, running 4 times a week and going to the gym the other three days.\n\nGoals\n\nI was aiming at around 1:46:00 time, with a pace around 5:00 per KM.\n\nTraining\n\nSubscribed to Runna for this one. Been hearing  a lot of good things about the app, and since, because of my schedule, I train alone and very early in the morning (I run 4 times a week and 3 days I lift at the gym), the app helped my with structuring my plan, between easy runs and speed sessions and it pushed me hard! It was a challenge for sure, but it was a lot of fun and made me feel stronger than ever as training progressed. It was a 12 week training plan.\n\nThe Unexpected\n\nAs I've said, training was going awesome and the hype for the race was at peak level. This is a race that I wasn't able to run last year because I was dealing with peroneal problems that had me off running for almost 6 months.\n\nThing is, ten days before the race, while at the gym, I decided to not to a hard leg session that day because I wanted to start deloading the legs to be well rested for the race. Stupidly I decided to make 3 series of jump box excercise. At the last rep of the last series, I stumbled while jumping, and bang my tibia with the box HARD! It instantly swelled and blood was coming out! I thought it was the bang, so I went home and put ice on it. The thing is the bang left a scar (it was a hard hit) and that scar, once it healed, would stop more blood from coming out of the injury, so two days before, the area was incredibly swollen and it made a hematoma. I have a friend who is a doctor, and he gave me a corticosteroid injection to see if it would get better but nothing, so the decision was made to make a cut into the wound to take the coagulated blood out of there. That was last tuesday, so 5 days before the race. When I got out, and for the next three days I was having a hard time even trying to walk, so I saw myself almost 100% out of the race. I was borderline depressed after all the training I went trough.\n\nSince the race is around 50 km away from where I live, we reserved to have a four day holiday with the family, so we had to go anyway. You can imagine my mood. Having to come and having planned the holiday around the race. But the foot started to get better on saturday, I mean, the wound was giving me a lot of pain since it hasn't healed properly yet, but i was able to walk with little pain, so I asked my friend if I could run. He said to me to try runnning 3 o 4 km the day before and see how it responded. The fear was that I get a hematoma again. Went ofr it and had no pain while running.\n\nThe day of the race was key to see how I woke uo, and if there was no blood or the area was swollen I had a green light. Woke up that day and, MIRACULOUSLY it was ok. The happiness I had was hard to explain. I was able to at least try to run the race, which two days before it was impossible for me to even think of being able to run.\n\nPre-race\n\nWoke up at 5:00. Cured the wound, and prepared for the race. Breakfast was at 5:30, and i had a coffee with two toast with some butter on them. Drank half a Gatorade before leaving and had a nougat 20 minutes before the start.\n\nRace\n\nIn training, the targeted pace was 5:00 per km (8 minutes and 3 per mile), but since I wasn't able to run  at all last week, and taking into account that i had no idea how my leg was going to respond at the race, the fact that I was there at the start just made me soooo happy!\n\nWeather was great, it wasn't cold but neither hot. Started the race and gradually tried to get the pace that I've trained for, and was feeling great! No pain whatsoever. So i was able to mantain it and even get a little faster on the second half. Course had some hills on it, so it's not an easy route, but I was feeling great and couldn't stop thinking about how lucky I was to even be there running. Last meters I had a terrible cramp on my left leg, but I endured and finished strong with a time of 1:43:31 according to my watch. Official time could be a little less.\n\nNutrition wise I had two caffeinated gels, one 6 km in, and the other 12 km in, I had a third one ready but decided to skip and instead ate a banana that was given to me at around 15k.\n\nRunning is a privilege, and I always feel that way, but never more clear after the incredible journey leading up to this race!\n\nPost-race\n\nFamily was waiting at the finish line (wife and two kids, 8 and 4), and I saw them twice during the course, so it was very emotional. I cried like a baby once I crossed the finish line and even more when I saw them after finishing.\n\nSo this was and unbelievable race for me, taught me a lesson to be even more grateful to being able to do this at this age, and the privilege I have of being healthy. And also, so proud of me that even with all the setbacks of the injury, I never in my mind gave up, and was able to endure it all and be there at the start.\n\nThank you for reading, this ended up being a long race report and sorry for the grammar, I am from Argentina so english is not my first language!\n\nKEEP RUNNING!!!!!\n",
      "author": "Juliogol",
      "created_utc": 1742206814.0,
      "score": 98,
      "num_comments": 19,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "twitter",
    "reddit"
  ]
}