{
  "id": "twin_onlyconnect",
  "username": "onlyconnect",
  "activity_count": 2,
  "interests": [
    "race",
    "were",
    "that",
    "with",
    "there"
  ],
  "post_times": [
    1758471687.0,
    1750322642.0
  ],
  "history_sample": [
    {
      "id": "1nmwajr",
      "title": "Winchester Half Marathon: hilly, late starting, got my target time but missed second breakfast",
      "selftext": "### Race Information\n* **Name:** Winchester Half Marathon\n* **Date:** Sept 21 2025\n* **Distance:** 13.1 miles\n* **Location:** Winchester, UK\n* **Website:** https://challenging.events/e/winchester-half-marathon-9903\n* **Time:** 1:37:17\n\n### Goals\n| Goal | Description | Completed? |\n|------|-------------|------------|\n| A | Sub 1:40 | *Yes* |\n| B | Beat last year | *Yes* |\n\n### Splits\n| Mile | Time | Ascent (m) | Descent (m)\n|------|------|------|------|\n| 1 | 8:25 | 62 | -2\n| 2 | 7:55 | 49 | -9\n| 3 | 7:16 | 27 | -29\n| 4 | 7:00 | 5 | -35\n| 5 | 6:40 | 0 | -50\n| 6 | 7:01 | 0 | -13\n| 7 | 7:31 | 26 | -4\n| 8 | 7:34 | 21 | -2\n| 9 | 7:56 | 34 | -30\n| 10 | 7:00 | 5 | -63\n| 11 | 7:15 | 2 | -9\n| 12 | 7:20 | 14 | -3\n| 13 | 7:07 | 9 | -7\n\n### Training\nI am marathon training and this is 4 weeks out; the schedule calls for a 8-15K tune-up race so I am pushing it a bit but never mind!\n\n### Pre-race\nThose with long memories may recall that I [ran this last year](https://old.reddit.com/r/running/comments/1fmwn2r/winchester_half_marathon_22nd_sept_2024/) and was excited to beat 1:45 – my time last year was 1:40:48 and I commented that I might have been able to catch the 1:40 pacers but only with “a titanic effort.”\n\nFast forward 12 months and I think I am a bit faster; this time I want to be sub-1:40.\n\nThe course is beautiful and starts and finishes in the historic city of Winchester, adorned with a cathedral that is in parts over 900 years old. It is also hilly; the first 3K or so is all uphill, following which it is undulating but includes another steep climb in the village of Oliver’s Battery, the segment for which on Strava is named “Drained battery.”\n\nI arrived at the race village around 1 hour before the 9:00am start time; there were people around but it was strangely quiet. There had been an incident on the motorway, which was therefore closed, and the race was delayed by at least 30 minutes, in part because of delayed runners but also because key traffic marshals were stuck in the traffic and without their presence the race could not go ahead. There were even whispers that the race might be cancelled; road closures are difficult to manage at the best of times, everything has to be pre-approved by the authorities and if the race missed its time window it might have to be abandoned.\n\nThe weather was perfect, everything was set up, and runners milled around feeling a bit glum. It is odd to prepare oneself for a race, have an early breakfast and warm-up run, and then … nothing. I began to feel hungry; the plan was to do the race and have a second breakfast afterwards, but I did not want to eat again before running. \n\nAfter 45 minutes or so there was some good news. The race would go ahead, the start time would be sometime after 10:00am. I had a chat with the two 1:40 pacers; they said they would try to keep an even pace despite the hills. I would therefore fall behind initially but hoped to catch up and overtake them later.\n\nNutrition? I tend to take a half marathon in my stride as far as possible. Early breakfast. One gel before the start and then nothing, I did not stop at the water stations.\n### Race\nAt 10:15 the race began. I started just behind the 1:40 pacers and as predicted, they disappeared ahead as I laboured up the first hills. The 1:45 pacers passed me as well. Nevertheless I felt pretty good; one redeeming feature of this course is that the starting climb is the worst and there are some nice steady downhills to come. We reached the junction with Kilham Lane on the left and the famous Clarendon Way on the right, the road levels out, and I began to speed up. You need to average 7:38/mile pace for sub-1:40; mile 3 I did in 7:16, mile 4 in 7:00 and mile 5 in 6:39 (yes it is downhill!). \n\nI thanked the 1:40 pacers as I passed them and they told me that all I needed to do was to stay in front. Well I knew that; but “drained battery” was still to come.\n\nYou reach a charming village called Hursley with is the far point of the race. Next comes a relatively gentle climb up a narrow country lane, back to Oliver’s Battery which is on the outskirts of Winchester. Grind up the last major hill, and then the last 4.5 miles are easy. My time on the dreaded segment was 5:22, beating last year’s 5:39, and I was pretty sure then that I would achieve sub-1:40.\n\nThe last 4 miles have a few twists. There is an underpass where you actually have to go down steps; I tend to be cautious here for fear of falling over! Then there is a steepish descent, too steep for an ideal pace, followed by a flattish three miles or so to the finish. I tried to keep up the pace, foolishly hoping that I might win my age category. Back into the city centre, under the historic Kingsgate arch, around a few corners, then the sprint to the finish, rudely overtaken in the last stretch by a runner perhaps half my age!\n### Post-race\n1:37:17 and an improvement of over 3 minutes from last year, but also a bit of an anti-climax. I realised that the not-very-generous race organisers had 10 year age categories so I had no chance of winning (I was 4th out of 24), and also discovered that I had apparently failed to order a t-shirt. \n\nOn the plus side, Starbucks were offering a free coffee to all finishers and I wandered along to collect my tall Americano which turned out to be more tasty than expected, possibly improved by post-race thirst. It was now lunchtime and too late for a second breakfast so I wandered home instead, thanking the excellent marshals en route; a tough day for them since they had been out longer than expected and remained super cheerful and encouraging. \n\nMade with a new [race report generator](http://sfdavis.com/racereports/) created by /u/herumph.",
      "author": "onlyconnect",
      "created_utc": 1758471687.0,
      "score": 37,
      "num_comments": 12,
      "subreddit": "running"
    },
    {
      "id": "1lf5ubx",
      "title": "Broløbet: the bridge run (half marathon)",
      "selftext": "“Run across the bridge.” That was the pitch for this unusual run, the bridge in this case being the Øresund Bridge between Copenhagen, Denmark and Malmo, Sweden, on the 25th anniversary of its official dedication in summer 2000. This was the third such run, the first having 79,719 finishers on 12 June 2000, still the world’s largest half marathon; and the second with around 30,000 runners in June 2010.\n\nSomeone in our running club mentioned it early in 2024. The first adventure was signing up; tickets went on sale on 1st February 2024 and sold out 40,000 tickets in a few hours, with the web site barely functioning under the load. Nevertheless a dozen of us signed up; and 18 months later arrived in Copenhagen, city of parks and bicycles, ready to run.\n\nThe run was organized by two running clubs, Sparta Atletik in Denmark and MAI (Malmö Allmänna Idrottsförening) in Sweden. There were expos in both countries, with the Copenhagen one conveniently positioned by Fælledparken parkrun where some of us ran on the Saturday before the race. Bib pickup was as the expo, which was fun with a nameboard showing all the runners, discounted shoes and other goodies. Along with the bib, runners were given a handy folding bag which was required for bag drop.\nI had not trained specifically for this run, taking the view that I would still be fit enough following Manchester Marathon at the end of April. In fact my fitness has dropped a bit but not disastrously so. I had signed up for the 1:30 – 1:40 wave and was nervous about completing it in the time but figured this race was more about the experience than chasing a PB (personal best). This put me in the third wave (yellow), starting at 9:50, though bag was to be dropped by 8:45.\n\nBeing a get-there-early sort of person, I arrived around 8:00am at which time it was easy to use the facilities and have a wander round; not much to see other than the gathering runners and a stand from sponsor Boozt. Weather was sunny and we had been warned of a warm race so slathered myself with suncream and did my best to hydrate. Organization until this point had been fine but there were a few issues in the start area; not enough portaloos was the biggest problem.\n\nWe left the pen shortly after 9:50 as planned. This was not the start though; we were walked around some roads and waited a bit, so Garmin tells me the actual start was 10:26. The course ran through Kastrup and then down into the tunnel that precedes the bridge. It was warm until we entered the tunnel, then nice running conditions in the shade of the tunnel, busy with runners but not too congested. My first miles were the fastest, then it was a gentle uphill out of the tunnel and towards the bridge. As we emerged from the tunnel there was a noticeable headwind but the sky was overcast and it was not as warm as expected, phew!\n\nBy the time we got onto the bridge proper it was about half way through the race. Plenty of water stations with drinks in cardboard cartons; quite good for holding though I am not good at drinking much while running. The course did not allow for much in the way of spectators though stationary traffic on the other half of the bridge gave us some honks and cheers.\n\nThe nature of the course is that you have a long gentle climb until you reach the centre of the bridge, and then a long gentle downhill to the finish. I should have been able to speed up more than I did, but not being in peak condition I continued at just over 7:30 mile pace. Coming into Sweden and off the bridge there were spectators and some nice crowd support. Then into the park, past a sign that said “200m to shine”, and a little kick at the end to finish on 1:39:34, just within my start wave prediction, 2895 of 40230 runners, and 6th of 340 in my age group VM65.\n\nThe finish area at this point was busy but not too crowded. I received my medal and banana, got a free “selfie” from a Boozt stand, and wandered through the finish field looking for the bag trucks which turned out to be at the far end. Then I returned to the finish in search of friends and family.\n\nOh dear! I am not sure exactly when things started to go wrong, but the runners finishing at what should have been just under two hours, and later, were not able to run over the line because of congestion. They were forced to walk to the finish, with some complaining of 10-15 minutes wait; frustrating for those aiming to beat 2 hours. The reason was that the immediate finish area was not being cleared of runners fast enough; I remember from Manchester (a mere 30,000 runners) that this needs to be done quite aggressively by marshals otherwise you get exactly this problem.\nThe situation was worse because there was no segregation in the finish area between runners and general spectators so it was hard to move through the crowd. There should have been a sizeable runner-only area at the finish allowing a clear space to move into after completion.\n\nAnother common complaint was lack of signage, particularly to the bag collection area. Bag collection was fine for me; I was served by the same person who picked up my bag first thing in the morning. Later on though things fell apart; the trucks were apparently out of numerical order, bags were strewn around, spectators were allowed into the bag collection area and some thefts were reported.\n\nWorse still was the transport away from the finish. There were coaches both back to Copenhagen, or to the nearest train station at Hyllie. There were no organized queues but lines formed, though with no real clarity as to which line was for which coach, and some ignoring the lines and heading straight for the road side. There were not enough coaches, and it began to be whispered that a collision on the bridge had delayed the Copenhagen coaches. Mobile internet or even voice calls barely worked so communication was poor.\n\nMany of us took what seemed to be the least bad option, a 5KM walk to Hyllie, despite a friend messaging “don’t come to Hyllie” because of overcrowded platforms and lack of sufficient trains. For us, once we got to Hyllie all was well and we stepped straight onto a train to Copenhagen and even got seats.\n\nThis was not good though and many of the problems seemed to be avoidable, particularly the organization of the finish area, lack of finish area marshals, lack of communication, and shortage of food and water during the long enforced wait for transport.\n\nOf course all these problems soon fade from memory; it was a fantastic run and an unforgettable experience. Nobody knows when or if there will be another bridge run and I am glad to have been part of it.\n\n### Splits\n| Mile | Time |\n|------|------|\n| 1 | 7:11\n| 2 | 7:08\n| 3 | 7:37\n| 4 | 7:14\n| 5 | 7:18\n| 6 | 7:28\n| 7 | 7:48\n| 8 | 8:05\n| 9 | 8:10\n| 10 | 7:38\n| 11 | 7:29\n| 12 | 7:33\n| 13 | 7:24\n| 14 | 7:03 (0.22 miles)",
      "author": "onlyconnect",
      "created_utc": 1750322642.0,
      "score": 31,
      "num_comments": 31,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.98,
  "channels": [
    "instagram",
    "youtube"
  ]
}