{
  "id": "twin_Not_a_robot_101",
  "username": "Not_a_robot_101",
  "activity_count": 1,
  "interests": [
    "race",
    "with",
    "marathon",
    "coast",
    "guard"
  ],
  "post_times": [
    1741905457.0
  ],
  "history_sample": [
    {
      "id": "1jaovat",
      "title": "Coast Guard Marathon Race Report - Elizabeth City, NC.- March 9th, 2025 - First Marathon",
      "selftext": "# Race Information\n\n* **Name:** Coast Guard Marathon\n* **Date:** March 9, 2025\n* **Distance:** 26.2 miles\n* **Location:** Elizabeth City, NC\n* **Website:** [https://coastguardmarathon.com](https://coastguardmarathon.com/)\n* **Time:** 4:59:31\n\n# Goals\n\n| Goal | Description | Completed? |\n\n|------|-------------|------------|\n\n| A | Finish | **Yes** |\n\n| B | 5:30 | **Yes** |\n\n| C | 5:00 | **Yes** |\n\n# Splits\n\n| Mile | Time |\n\n|------|------|\n\n| 1 | 11:34\n\n| 2 | 11:12\n\n| 3 | 10:58\n\n| 4 | 10:57\n\n| 5 | 11:16\n\n| 6 | 11:02\n\n| 7 | 11:03\n\n| 8 | 11:15\n\n| 9 | 11:20\n\n| 10 | 11:00\n\n| 11 | 11:30\n\n| 12 | 11:31\n\n| 13 | 11:41\n\n| 14 | 11:54\n\n| 15 | 11:24\n\n| 16 | 11:19\n\n| 17 | 11:34\n\n| 18 | 11:31\n\n| 19 | 11:43\n\n| 20 | 11:38\n\n| 21 | 12:10\n\n| 22 | 11:19\n\n| 23 | 11:34\n\n| 24 | 11:25\n\n| 25 | 11:14\n\n| 26 | 11:11\n\n# Background\n\nI'm a 160lb man in his mid 40's with a background in CrossFit but nothing significant in endurance sports. In November of 2024, I completed my first Half-Marathon using the Hal Higdon Novice Half-Marathon program, finishing with a 2:29:17 and a HR avg of 158. After the race, I decided to train for a marathon, and set my eyes on the Coast Guard Marathon, as I would be in the area when the race was occurring.\n\n# Training\n\nI trained for the race at 5,000 feet elevation. I used the Hal Higdon Marathon Novice 1 program which is 18 weeks long, with 4 days of running per week and a long runs on Sunday which caps out to a single 20 miler on week 15. The program also has an optional half-marathon on week 8. Coming off of my race in November I actually skipped the first two weeks to account for the time for my Marathon in March.\n\nDuring the course of the program, I followed the plan closely, but I did deviate from the estimated run-times provided by the Higdon app, because it was pushing my HR into zones 3 and 4 to maintain pace. Instead, I focused on remaining in zones 2 and 3 by using an interval walk/run built on the Jeff Galloway system which I will get into in a moment.\n\nOn week eight I ran the Arizona Rock & Roll Half-Marathon and used the interval walk/run I had adopted a few weeks earlier. The difference between my first Half-Marathon and second was huge. I had a big PR with a 2:11:13 and a HR avg of 161. I continued to follow the plan and on week 16  I conservatively ran in the El Paso Half-Marathon with a 2:23:22 and a HR avg of 149. At the end of the taper, I felt ready for my race.\n\n# Pre-race\n\nThe Friday before the Coast Guard Marathon, I flew from El Paso to Norfolk. I carried onto the plane all of running gear because if my bags were lost, I did not want to risk missing my race. On Saturday, I focused on getting a good nap in and having some pasta. I also pre-packed my gear and collected my bib.\n\n# Race\n\nThe Coast Guard Marathon takes place in Elizabeth City, N.C. and it is part of the Armed Forces Series Challenge, along with the Air Force Marathon, Marine Corps Marathon, Army 10 Miler, and Space Force 10 Miler. The event was smaller than I was expecting, but also extremely well run. On the morning of the race, the temperature was perfect for running, with mid-30's at the start to low 50's at the end.\n\nThe course is very flat; the first bit **(miles 1-4)** runs along the Pasquotank River, and there was Coast Guard boat in the river. Afterwords, the course **(miles 5-8)** head to a Coast Guard base where planes are lined up along a runway, and another helicopter was hovering while runners ran the airstrip. Afterward, the course leads to a World War II blimp hanger **(miles 9-15)** before looping back **(miles 16-26)** to the finish line.\n\nThe race began with a presentation of the colors, an invocation by a Coast Guard chaplain and an overflight from a Coast Guard HH-60. The race had about 1,000 runners between the half and full-marathons and pacers from On Pace [https://onpacerace.com](https://onpacerace.com) in attendance to assist. Unlike my previous races, there were no corrals; I selected an 11:27 pace based on my estimated finish time.\n\nMy fear was hitting a wall so my hydration and caloric plan reflected that. Water stations were located every two miles, this was not enough for me, so I ran with a hydration vest, and had a GU every 3 miles. I also ran with a group and a pacer who was really awesome. I planned to keep to a 1:30 run / :30 walk interval, but I did not want to break away from the group, and this turned out to be the right decision.\n\nIn the end I did not hit a wall, and I ran the entire duration of the race with a single rest-room break at mile 15, and brief pause at mile 19 to refill my extra water bottle. Keeping with the group and the pacer was a huge form of encouragement and despite feeling sluggish at mile 21, I caught a second wind once I was into the final 5k of the race. Crossing the finish line, I confirmed my time at 4:59:31 and a HR avg of 148.\n\n# Post-race\n\nIncluded in the race entry was a ticket for a beer and BBQ, and the USO had a tent set up with Therabody inflatable leg compression sleeves. I grabbed my free beer, enjoyed a compression treatment and afterwards spent a bit of time at chatting with other runners before driving home, where I promptly took a long nap followed by a nice dinner with my family.\n\n# Final thoughts\n\nI have always wanted to run a marathon, and as a member of the Coast Guard, it felt fitting that this race should be my first. I learned a lot during my training and I plan to spend the next five months working towards a 4:30 finish at the Marine Corps Marathon. Ultimately, my biggest take away is the importance of running slow to race fast and emphasizing nutrition and rest for sustainable running.\n\nMade with a new [race report generator](http://sfdavis.com/racereports/) created by u/herumph.",
      "author": "Not_a_robot_101",
      "created_utc": 1741905457.0,
      "score": 23,
      "num_comments": 6,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "twitter",
    "reddit"
  ]
}