{
  "id": "twin_Bo-bo-bobr",
  "username": "Bo-bo-bobr",
  "activity_count": 1,
  "interests": [
    "running",
    "this",
    "really",
    "uneven",
    "terrain"
  ],
  "post_times": [
    1752186765.0
  ],
  "history_sample": [
    {
      "id": "1lwqced",
      "title": "Looking for advice on how to safely run on uneven terrain and hilly routes",
      "selftext": "Hi everyone,\nI’m 35, male, 171 cm tall and currently weigh 87 kg. I started running this year to improve my cardiovascular health and maintain a healthy weight (my family has some issues at this point 😅), so staying fit is a long-term goal for me.\n\nI’ve got a sedentary job and lots of stress, so running became my go-to way to reset both physically and mentally.\nNow I’m running about three times a week, carefully alternating techniques. I’ve read different articles on running form, and I try to keep my bounce low to reduce impact and avoid harsh landings. I also always do warm-up stretches before running and cooldown stretches after.\n\nMy diet is about 1500 kcal per day with balanced meals (veggies, meat, fish, etc).\nAfter a while, I really fell in love with running. I’m not chasing pace, just trying to develop solid technique. My goal now is to recover from a minor knee issue and be ready to run a 10K during the Warsaw Marathon events this autumn, and maybe a half marathon next year.\n\nThe issue I’m facing is terrain. My city is hilly, and parks have very uneven paths. Many of the paths are slightly dome-shaped across their width and keep reversing, putting alternating stress on each leg. But running on sports fields became boring almost instantly.\nDespite running carefully in road shoes (Skechers Go Run Max Road 6), the inconsistent surface caused a problem.\n\nI’ve read through many posts here, but it seems I still haven’t found quite what I’m looking for. And I’d really love to hear from others who have dealt with constantly changing terrain.\nHow did you manage to avoid injuries when running on uneven surfaces? What helped in practice?\n\nI’m really motivated to keep going, just want to do it safely and sustainably.\n\nUPD: last time I got my knee injured, so I would also be really glad to hear your advices at this point.",
      "author": "Bo-bo-bobr",
      "created_utc": 1752186765.0,
      "score": 10,
      "num_comments": 40,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "instagram",
    "youtube"
  ]
}