{
  "id": "twin_newbienewme",
  "username": "newbienewme",
  "activity_count": 1,
  "interests": [
    "that",
    "this",
    "muscles",
    "have",
    "peroneal"
  ],
  "post_times": [
    1745327598.0
  ],
  "history_sample": [
    {
      "id": "1k55zax",
      "title": "lessons about peroneal muscle pain and related arch pain",
      "selftext": "I have learned something that might benefit someone else:\n\n'I started having pains **deep in the arch** of my right foot when applying weight, and for weeks struggled to manage this issue. \n\nFinally I found a mention in a book of the **peroneal** muscles. For those that dont know, these muscles **run on the outside of your lower leg up to the knee, and attach centrally in your lower foot arch.** \n\nAnd sure enough, despite feeling the pain only in deep in my right foot arch, simply pressing on the peroneal muscles confirmed they were very tender and stiff!\n\nI found that **foam-rolling the area and stretching** by siting in half-lotus postions releived in 24 hours much of the arch-pain that I had been having for weeks!\n\nApparently, the peroneal muscle is responsible for the angle of your feet, if this muscles becomes tired it can supposedly create \"duck feet\".  \n\nThis kind of blindsided me. I have never heard of this, anddepsite religously training strength \"for runners\" twice a week for running and often stretching and foam-rolling my calves, I have probably not been adressing these muscles. \n\nNow in addition to foam rolling and stretching, I will also use a **band to move the sole of my feet sideways both inwards and outwards against load to strengthen it,** as it is apperanelty a muscle that is too weak. \n\nNote that this is an ankle that I have previously had a pretty **bad ankle sprain** on. \n\nHope someone finds this information useful. \n\n\n\n\n\n",
      "author": "newbienewme",
      "created_utc": 1745327598.0,
      "score": 29,
      "num_comments": 8,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "youtube"
  ]
}