{
  "id": "twin_icebergprofile",
  "username": "icebergprofile",
  "activity_count": 1,
  "interests": [
    "felt",
    "that",
    "running",
    "race",
    "this"
  ],
  "post_times": [
    1746088798.0
  ],
  "history_sample": [
    {
      "id": "1kc3wsj",
      "title": "TCS 10K Bengaluru 2025: My First Sub 60 10K!",
      "selftext": "# Race Information\n\n* **Name:** TCS World 10K Bengaluru\n* **Date:** April 27th, 2025\n* **Distance:** 10 kilometers\n* **Location:** Bengaluru, India\n* **Website:** [https://www.tcsworld10k.procam.in/](https://www.tcsworld10k.procam.in/)\n* **Time:** 59:42\n* **Shoes:** ASICS Novablast 4\n\n# Goals\n\n|Goal|Description|Completed?|\n|:-|:-|:-|\n|A|Sub 1:00:00|*Yes*|\n|B|Sub 1:01:30|*Yes*|\n|C|Sub 1:03:23 (previous PB)|*Yes*|\n\n# Splits\n\n|Kilometer|Pace (min/km)|Grade Adjusted Pace (min/km)|Elev. Gain (m)|Elev. Drop (m)|\n|:-|:-|:-|:-|:-|\n|1|5:55|6:03|5|17|\n|2|6:03|6:10|0|10|\n|3|6:09|6:04|7|3|\n|4|6:05|6:05|2|0|\n|5|6:22|6:06|17|0|\n|6|6:10|6:00|11|0|\n|7|5:54|5:50|6|2|\n|8|5:23|5:30|2|12|\n|9|6:08|5:55|7|3|\n|10|5:07|5:10|0|5|\n\n# Background\n\nI started running regularly in mid-2023 and clocked a personal best of 1:03:23 at the 2024 TCS 10K. That run was genuinely fun, and the surge of accomplishment I felt afterward was exhilarating. My first 10K had been back in 2016, where I finished in 1:22:48, taking plenty of walk breaks. I’d clearly come a long way—but I also knew I still had a long way to go. A time of 1:03:23 wasn’t particularly impressive and I didn’t feel anywhere close to calling myself “fit.” Still, I was proud of the progress and deeply motivated to keep going. I set my sights on a new goal: a sub-60-minute 10K at the 2025 TCS 10K. That gave me a full year to shave off those 3 minutes and 23 seconds.\n\n# Training\n\nIn May 2024, just a month after that year’s TCS 10K, I invested in a Garmin Forerunner 965. Within the first couple of months of using it, it became clear that my training approach was far from ideal—my watch frequently flagged my training status as \"Strained.\" My regimen had no structure, no training blocks, and no real plan; I just pushed myself to the limit every time, thinking that to improve, I just needed to run more and run harder. I ran countless 5K time trials, convinced they were the best way to improve. Then, in August 2024, I hit a setback: a knee injury—chondromalacia patella in my left knee—forced me to stop running altogether. During that time, I immersed myself in running videos on YouTube and scrolled through endless Reddit threads. It was probably my way of experiencing running vicariously, haha. While I was not running, I felt less energetic in general through the day and noticed that my mood wasn't as good as it used to be when I was running consistently. I really wanted to get back into it, but I wanted to do it the right way this time.\n\nAfter nearly two months without running, I eased back into it. I discovered that many people highly recommended Garmin's \"Daily Suggested Workout (DSW)\" feature, so I decided to give it a try. I gradually increased my weekly mileage by following the DSWs. Most of them were easy \"base\" runs. Doing these made me realize what people mean when they say  things like \"80% of your training volume should be easy runs\". Eventually, I switched to heart rate-based suggestions instead of pace-based ones, which I found to be much more effective. On January 27th 2025, I set the 2025 TCS 10K as a goal race event in Garmin and began the training plan tailored for it.\n\nFrom then on, I exclusively did what my watch told me to. Religiously. Every day, without fail. If I felt like running but my watch told me to rest, I rested. If I felt like taking a rest day but my watch told me to run, I ran. If I felt like running easy but the DSW was a tempo workout, I did the tempo. If I felt like running intervals but the DSW was a 45 minute base run at 153 bpm, I did the bloody 45 minute base run at 153 bpm.\n\nThe roads near where I live are in terrible condition, and the nearest parks and lakes where people go for runs are about a 15 minute bike ride away, so I was forced to do most of my training on the lone treadmill in my housing society's gym. Garmin bored me to death with those monotonous base runs at 153 bpm, but I did each and every single one of them. I listened to podcasts (mainly Andrew Huberman, Peter Attia, The World of Running, and WTF is with Nikhil Kamath) and a whole lot of music.\n\nOver 3 months, I started to notice real, tangible progress. The cardiac drift that would push me outside the base run HR range no longer did so, and the speed at which I could my base runs while staying within the recommended HR range gradually improved from 8.0 kmph to 8.6 kmph. I also ran a 5K race in February (29:24) and a 5K time trial on the treadmill in March (29:19). Both these runs felt significantly easier than the all-out 5Ks I used to run in 2024, which clocked in around 31-32 minutes and left me completely drained. This time, I felt stronger and far less exhausted. I could actually *feel* the improvement in my cardiovascular health.\n\nAs the race date approached, my confidence kept growing. I started to believe that the sub-60 goal was well within reach. Heck, on some days I thought to myself, \"Should I set a harder goal? Maybe I can go sub-59? Or maybe sub-58?\". I had seen posts and vlogs where people mentioned huge leaps like going from a 68 min 10K to a 53 min 10K in 1 year and felt like I was setting the bar too low for myself. But another part of me said I should take it one step at a time and stick to the sub-60 minute goal for now. I didn't want to push too hard and injure myself again, so I decided to not change my goal.\n\nAs April began, I started checking the event website and Instagram page daily, waiting for the course details to be released. Once they were out, I kept an eye on GeeksOnFeet—a site run by a couple of passionate, seasoned runners from Bangalore whose route previews and pacing strategies I had found incredibly helpful for the 2024 TCS 10K. Once their article dropped, I read it in detail. I made mental notes of key sections of the course and their suggested strategy. I considered creating a PacePro plan for race day on my watch and leaving my phone behind, but I knew that common advice is to not try anything new on race day. So instead, I saved a screenshot of the recommended paces for each kilometer on my phone, just in case I needed to refer to it mid-race.\n\nDuring taper week, I started sleeping earlier and waking up earlier to prepare myself to wake up at 4:30 am on race day without feeling way too sleep deprived. I made sure I was drinking at least 3 liters of water per day and upped my carb intake by eating more pasta and bread based foods. I also took one extra rest day so I rested on both Thursday and Friday before the race. On Saturday, I went for a shakeout run that my watch suggested, which had 15 second sprint intervals with 2 minute recoveries. I did this off the treadmill, running circles around my housing society—partly because it's close to impossible to execute those 15 second sprints properly on a treadmill and partly because I wanted to get accustomed to the feeling of running on the road. I felt light on my feet, my knees were feeling good, and my energy levels were high. I felt mentally and physically prepared for the race and my excitement was going higher and higher by the minute. I couldn't wait to get to the start line the next day!\n\n# Pre-race\n\nI woke up at 4:30 am, rose from the bed without pressing snooze even once (probably the first time in my life I've done that!), did a stretches and holds to wake up the quads, hamstrings, glutes and calves, ate a granola bar, and drank almost a liter of water. At 5:15 am I booked an auto-rickshaw and arrived at the venue at around 5:50 am, 20 minutes before gate closing time. I ate two small bananas on my way to the venue.\n\nThe place was packed, there seemed to be a lot more participants this time around compared to last year. I did some on-the-spot jogging and some hamstring swipes to get myself warmed up and ready. I wondered if I should've done more, but then again I didn't want to do anything new on race day :P At 6:15 am I went to the holding area for corral C; the crowd had already started walking toward the starting line so I quickly joined in. I brought up the run activity screen on my watch and readied my finger on the start button, inching closer to the start line, surrounded by a sea of people inching closer with me. I could see the dense, slow crowd of people before the start line convert to a sparser, faster mass of runners past the start line and as I moved toward it I felt quite emotional—several months of training had culminated in this moment. I did not feel nervous. I felt confident. I felt happy. I felt well.\n\n# Race\n\nThe first couple of kilometers of the race were a lot better than last year since I was in corral C which was much faster on average as compared to corral F from last year which had a bunch of participants walking and not jogging/running. I didn't have to weave through the crowd by zig-zagging like last year. In fact, a lot of people around me seemed to be running at exactly my pace.\n\nKilometers 1 and 2 flew by in a jiffy, much of it was downhill running and I was on fresh legs. I had to mindfully keep myself from running too fast. If someone had told me to run at the most \"enjoyable\" speed, I'd probably be running at 5:45 or so, but I forced myself to stay around 6:00. I knew that running fast on downhills this early in the race would be counterproductive and that \"banking time\" was never a good idea. I trusted this advice that I had heard from multiple sources, and kept myself running at a steady and comfortable pace. I saw a blind participant running at a solid pace, hand linked to his guide runner by a short tether. Just ahead, another guide runner paced them. Witnessing this was incredibly inspiring and profoundly moving. As I ran behind them and read the words \"BLIND RUNNER\" on the back of one's T-shirt and \"SUPPORT RUNNER\" on the back of the other, it made me emotional to a point where tears almost welled up in my eyes. I find it hard to explain now in words exactly what I felt in that moment. Pride, admiration, humility, awe, all mixed together. But also something much deeper, more elusive. I was reminded of the resilience of the human spirit and the quiet, simple but powerful ways people lift each other up.\n\nKilometers 3 and 4 were slightly harder than I was expecting. There were 2 U-turns and some uphill sections. Nothing too difficult, but I found myself always overshooting or being a bit under the target pace. I couldn't \"lock in\" to it. I erred on the side of being slower rather than faster, fearing that too much energy loss in this stage would make the dreaded uphill of kilometer 5—the \"mid-race challenge\" as the GeeksOnFeet race preview put it—even more challenging. I powered through these two kilometers slightly slower than my goal pace. I remember my watch telling me that my average pace was around 6:05. Not too bad, I thought to myself. Last year at the 4 kilometer mark I was perhaps doing a 6:24 average pace and feeling like crap, this year was almost 20 seconds quicker and I felt strong. I powered through until the start of kilometer 5.\n\nKilometer 5 was HARD. I remember looking at my watch, seeing that my current pace was around 6:40, thinking to myself \"aw crap, I need to speed up\", trying to speed up, panting more, feeling like I've corrected to a good pace, looking back down at my watch and still seeing like a 6:35 current pace. This sort of thing happened multiple times. It felt like I put in a lot more effort for just a minimal pace improvement. I decided to not overexert though, thinking I'll make up for the lost time in the upcoming downhill sections of the course.\n\nKilometers 6 and 7 I don't even remember running. I had my AirPods on since the beginning of the run but I hadn't been playing anything on them until kilometer 5 where I threw on a song or two to distract myself from the uphill. In kilometers 6 and 7 I relied HEAVILY on music to keep me going. My focus was constantly switching between the music, my breathing, my cadence and my watch. I don't remember what I saw along the route, I don't remember what I was thinking or feeling. I did grab a sip of water at some point during these kilometers. And I remember searching for a trash bag along the way to throw the bottle after I was done drinking. There weren't enough trash bags along the route.\n\nKilometer 8 is the downhill I was looking forward to. I threw on some up-tempo music and just floored it. I wanted to recoup the time I had lost on kilometer 5. I tried to focus on my cadence and my form as I ran, and smiled as the air felt fresh, crisp and cool as a ran slightly faster through it. I watched the average pace gradually come down from 6:08 to 6:03. At this point I knew a sub 60 minute finish was almost a certainty.\n\nKilometer 9 felt great again. There was a slight uphill but this did not bother me one bit since I knew this was the penultimate kilometer and there were plenty of sights to distract from the effort. I ran past Cubbon Park and the majestic Vidhana Soudha. That stretch, wide and grand, felt incredible. I felt energetic and pumped to crush my PB, and overtook several runners in this section of the race.\n\nKilometer 10 was the craziest part of the race. When I saw the \"800m to go\" board, I started increasing my pace. I surged, and then surged again. My face contorted in effort, like it involuntarily does when you give an all-out effort at the gym. It felt like I'm pushing for a max deadlift or pushing through failure on the last lat pulldown. I grunted involuntarily, and sometimes voluntarily as I felt it helped me push harder. I didn't care what I looked like or what I sounded like. I saw the average pace on my watch go back down to 6:00. I was bang on target now. Last year during the last kilometer I was having agonizing thoughts like \"OMG WHERE IS THE FINISH LINE ALREADY?!\" and \"I JUST WANT THIS TO END\" and \"WHY AM I DOING THIS?\" but this time around I had one singular thought on my mind: \"NOTHING CAN STOP ME.\" I overtook a bunch of runners. With 500m to go, I glanced at my watch a final time. My heart rate had climbed to 188. I held steady. At 200m to go I saw another runner overtake me, yell \"C'MON!\" and make a dash for the finish. I felt supercharged by this. With the finish line in sight, I made the dash too. I gave it *everything*. I sprinted as fast I could and before I knew it, I crossed the finish line. I pressed the stop button on my watch the moment I crossed it. I didn't even look at the time. I knew it was sub-60.\n\n# Post-race\n\nAfter crossing the finish line, I caught up with the runner who had yelled “C’MON” and sprinted ahead. I told him how that final burst of energy helped *me* push through the last 200 meters. We exchanged a few words, shared a laugh, and then went our separate ways. It felt great to connect—even briefly—with a total stranger over something as simple as running.\n\nI collected my medal and did a short cool-down routine before heading home. Once I got back, though, I felt a dull headache coming on, accompanied by a sluggish, foggy feeling. It kinda felt like a hangover. I popped a paracetamol, drank some ORS and plenty of water, and slept it off. By the evening, I felt completely fine.\n\nThe event was quite well organized—seamless registration, a well-curated expo, quick bib collection, clear course details shared well in advance, plenty of refueling points along the route (which I should’ve used better), energizing drum bands at key spots, and a route that struck the perfect balance between challenging and fun. The only negatives were the lack of enough trash bins along the route, which made disposing of water bottles tricky, and the post-race breakfast box, which included mostly unhealthy packaged snacks. Overall, the TCS 10K 2025 was an *amazing* experience. I felt proud of the discipline I’d shown over the past few months, grateful for the journey, and already excited to continue onto greater achievements. I have the Bengaluru Runners Jatre 5K coming up in June, the Bengaluru 10K Challenge in July and then the Wipro Bengaluru Half Marathon (which will be my first half marathon) in September. If all goes well, I’ll be back at the start line for TCS 10K 2026—this time in Corral B—and ready to chase a brand new PB!\n\nI would like to thank u/Main-Perception-993 for their [TCS 10K 2023 race report](https://www.reddit.com/r/running/comments/13okq4f/tcs_bengaluru_my_first_10k/), which inspired me to write this race report.\n\nMade with the [race report generator](http://sfdavis.com/racereports/) created by u/herumph.",
      "author": "icebergprofile",
      "created_utc": 1746088798.0,
      "score": 68,
      "num_comments": 7,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "twitter",
    "reddit"
  ]
}