{
  "id": "twin_lyricsandliterature",
  "username": "lyricsandliterature",
  "activity_count": 1,
  "interests": [
    "anxiety",
    "from",
    "back",
    "know",
    "running"
  ],
  "post_times": [
    1744319968.0
  ],
  "history_sample": [
    {
      "id": "1jw94fe",
      "title": "Anxiety returning to running after scary fall",
      "selftext": "Hello everyone! \n\nI (28f) am currently training for my second half in mid May — not doing anything crazy, I’m not a fast runner or training super intensely.\n\n I recently switched from Hoka Arahis to Saucony Guides and I think what’s happened is that my feet aren’t used to the thick thick soles and I’ve had two falls in the first month of the Sauconys due to clipping the pavement. The first one was okay, I got back up and ran the remaining 12kms of my 18th run. The second wasn’t quite so easy to come back from — I tripped 5.5km into my usual weekday 7km, and smacked my face off the pavement so hard I needed stitches at A&E. Mercifully the damage was all superficial and apart from a nasty facial cut that’s gonna leave a bit of a scar, I know it was lucky I wasn’t concussed or worse.\n\nI haven’t been for a run this week, mostly because the shifting of my weight tugs the stitches, and my knees are pretty grazed and bruised up. But now that I’m just about healed up, I know I need to think about getting back out there over the next couple of days, but I keep having flashbacks to the moment my face hit the kerb. I know what I have to do to make my runs safer (lift my feet a bit higher for one) but I’m struggling to get past the nerves and anxiety. Has anyone else been through anything similar? Any advice? I love running so I don’t want it tainted with anxiety. ",
      "author": "lyricsandliterature",
      "created_utc": 1744319968.0,
      "score": 12,
      "num_comments": 37,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "youtube"
  ]
}