{
  "id": "twin_BuroraAurorealis",
  "username": "BuroraAurorealis",
  "activity_count": 2,
  "interests": [
    "that",
    "training",
    "with",
    "race",
    "time"
  ],
  "post_times": [
    1755630473.0,
    1749564896.0
  ],
  "history_sample": [
    {
      "id": "1muru1h",
      "title": "2025 Edmonton Marathon. My first 42.2K: Undertrained legs, relentless sun, and the long road to the finish line",
      "selftext": "* **Name:** 2025 Edmonton Marathon\n* **Date:** August 17, 2025\n* **Distance:** 42.2 km\n* **Location:** Edmonton, AB\n* **Website:** https://www.edmontonmarathon.ca/\n* **Time:**  04:39:30\n\n### Goals\n| Goal | Description | Completed? |\n|------|-------------|------------|\n| A | Finish  | *Yes* |\n| B | Run all the way | *No* |\n| C | Sub 4:00 | *Abandoned in the training block* |\n\n### Splits\n| Kilometer | Average Split Pace | Time |\n|------|------|------|\n5 | 5:49 |29:08:00\n10 | 5:49 | 58:16:00\n15 | 5:51 | 1:27:31\n20 | 5:57 | 1:57:19\n25 | 5:58 | 2:27:13\n30 | 6:19 | 2:58:52\n35 | 7:31 | 3:36:31\n40 | 8:22 | 4:18:24\n42.73 | 7:39 | 4:39:29\n\n\n### Background\nI [M41] never intended to run a marathon this year. But I had been running consistently since 2023, had two [half marathons](https://np.reddit.com/r/running/comments/1d2i8ub/calgary_half_marathon_a_flawless_training_block_a/) under my belt, and had just wrapped up a [10K training block](https://np.reddit.com/r/running/comments/1l7ztxx/10k_time_trial_chasing_a_stretch_goal/) that ended with a result I was really happy with. So I figured I’d keep the momentum going and aim for something bigger. That \"something\" turned out to be the Edmonton Marathon.\n\nInitially, I set my sights on a sub-4:00 finish, based on my VDOT-predicted time. But I quickly revised that to something more modest: just finishing, ideally around 6:00 min/km. And I was totally fine with revising _that_ upwards if things went south [_Narrator: Oh boy, and did things go south!_]\n\n### Training\nFor training, I made what I now see as my biggest mistake: I relied on Garmin’s _Daily Suggested Workouts_. The mileage was consistently low; even lower than Hal Higdon's Novice 1 Plan. I was running five days a week, but my weekly totals hovered around 40–45 km. My longest run, in mid-July, topped out at just 17 km (1:48:00).\n\nWith just four weeks to go before race day, I realized I had plateaued far short of where I needed to be. At that point, I asked ChatGPT to sketch out a plan for me. It did; and that meant bumping up both weekly mileage and long run distance very quickly. I ran 55 km the first week, with a 25 km long run. The following week, I hit 60 km, including a 28 km long run. On both long runs, I ran the final 5 km at my target pace.\n\nI knew it was risky to ramp both weekly mileage and long run distance so quickly, but I went in prepared to pull the plug if anything felt off. Miraculously, I made it through injury-free, probably thanks to the intensity of my 10K training block and the base building I did before then. \n\nStill, it wasn’t all smooth sailing. Family and work commitments meant I was up at 4:30 am most mornings to run, before heading straight into a full day. Sleep was poor; often under six hours a night plus a 20-minute afternoon nap.\n\nA month before the race, my wife finally put her foot down and insisted I start going to bed by 10:00 pm. That one change made a huge difference. Within days, recovery improved dramatically. My runs felt fresher, and I had a lot more energy to give.\n\n### Race Day\nEdmonton is known for being a fast, flat course. Combined with how my long runs had gone, I felt cautiously optimistic. The weather, though, was a concern: 12°C at the start, climbing to 21°C by late morning.\n\nThe race started on the dot at 7:00 am, and the first half went smoothly. I cruised comfortably at 5:50–5:55/km. My heart rate stayed near the lower end of Zone 3.  Fueling was consistent: A gel every 30 minutes, and small sips of water every two km or so. Around 20 km, I felt a tiny twinge in my left hamstring, but a short walk break cleared it up and it never returned.\n\nAt the halfway mark, the course loops past the start/finish, and my family was there, cheering me on at the top of their voices. It was the perfect morale boost!\n\nThings started to shift after 25 km, when my pace drifted to 6:20, then 6:30. I wasn’t too worried. My goal pace wasn’t set in stone; I was more focused on finishing well than hitting a number. \n\nAnd then, right at 32 km, [the wheels came off](https://imgur.com/11TU34j) -- almost comically in line with what so many other race reports on this sub describe. \n\nFirst, I felt a cramp in my right shoulder, followed quickly by one in what I think was the serratus. Like the hamstring earlier, both cleared up quickly and never came back. Finally, my calves started spasming. Not really painful, but on the edge of locking up if I didn’t back off and walk. From then on, I alternated short runs with frequent walk breaks. \n\nMeanwhile, the sun was out in full force, the temperature had climbed above 20°C, and the course felt endless. Edmonton’s route isn’t exactly scenic: mostly suburban sprawl, no shade, nothing to distract from the grind except for a glimpse of downtown at the start/finish. I was miserable.\n\nI tried to set small targets -- run 1 km, then walk -- but even that became too much. At times, I could barely manage 500 m before the calves forced another break. My pace cratered to around 8:15/km. Strangely, I didn’t feel all that fatigued. Maybe the walk breaks kept my heart rate low, or maybe the calf issues just masked everything else.\n\nCrowd support kept me alive. Every cheer, every clap, helped me shuffle forward. And in the back of my mind, I kept telling myself: \"My wife, my kids, my parents are all there to watch … _no way am I DNF’ing_.\"\n\nEventually, I crossed the finish line, _running_, in 4:39:30. Way off the sub-4 dream, and far from the strong finish I imagined, but it was a finish. My family was there cheering, and that moment made every bit of suffering worth it. And to top it off, I walked away with a massive medal haul: the kids made full use of the activity stations and proudly draped their creations around my neck afterward.\n\n### Assessment\nThis not the race I dreamed of, but exactly the kind of first-marathon experience I half-expected: plenty of suffering, plenty of lessons. Here are mine:\n\n* A marathon training block is intense. 60 km/week stretches you thin when you’re juggling work and family.\n\n* I can't trust Garmin's DSW for race-specific training anymore. I’ll stick to one of the established plans next time. A longer buildup and more volume are essential to make my legs marathon-ready. Higdon's Novice Plans seem to work well for most people, and they also cut down training days to four a week. \n\t\n* ChatGPT makes for a passable interim coach, or maybe that's just my survivor's bias talking. \n\n* Summer marathons are brutal. Running in 20°C+ with no shade is not my idea of fun. I’ll stick to spring/fall races next time.\n\n* Marathon fatigue hits differently. In the final third of a 10K, I’m usually gasping for air, heart redlining, lungs burning. In the marathon, the wasn’t my heart or lungs that failed me, but pure muscular breakdown.\n\t\nDespite the blow-up, I’m glad I did it. I knew a debut could go sideways, and it did -- but I learned a lot. I stayed injury-free, gutted it out instead of stepping off the course when things fell apart, and crossed the finish line.\n\nI get to call myself a \"marathoner\" now. That is good enough. For the time being. \n\n___\nMade with a new [race report generator](http://sfdavis.com/racereports/) created by /u/herumph.",
      "author": "BuroraAurorealis",
      "created_utc": 1755630473.0,
      "score": 124,
      "num_comments": 29,
      "subreddit": "running"
    },
    {
      "id": "1l7ztxx",
      "title": "10K Time Trial: Chasing a Stretch Goal",
      "selftext": "* **Name:** 10K Time Trial\n* **Date:** June 1, 2025\n* **Distance:** 10 km\n* **Location:** Calgary, AB\n* **Website:** \n* **Time:**  48:30\n\n### Goals\n| Goal | Description | Completed? |\n|------|-------------|------------|\n| A1 | Sub 50:00  | *Yes* |\n| B | Sub 49:00 | *Yes* |\n| C | Sub 48:00 | *No* |\n\n### Splits\n| Kilometer | Split | Time |\n|------|------|------|\n| 1| 04:40 | 04:40\n| 2| 04:42 | 09:22\n| 3 | 04:42 | 14:04\n| 4 | 04:44 | 18:48\n| 5| 04:49 |  23:37\n| 6 | 05:00 | 28:37\n| 7 | 04:53 | 33:30\n| 8 | 05:08 | 38:39\n| 9 | 04:54 | 43:33\n| 10| 04:54 |  48:27\n\n\n### Background\nWhen I wrote [my last half marathon race report](https://np.reddit.com/r/running/comments/1d2i8ub/calgary_half_marathon_a_flawless_training_block_a/), I decided that a full marathon wasn’t on the cards for me. I didn’t have the time or energy to commit to that level of training, and shorter distances seemed like the more practical path.\n\nSo this year, I set my sights on the 10K at the Calgary Marathon. My primary goal was to break 50 minutes. My stretch goal was a seemingly impossible sub-48:00; a time that felt a little out of reach. To put my fitness in context at the start of this block: my personal bests were 4:21 for a kilometre, 7:45 for a mile (4:49/km pace), 24:49 for 5K, and 52:50 for 10K. The idea of holding something close to my fastest mile pace for 10 kilometres felt borderline delusional. But if I pulled it off, I’d be running at a pace I once thought was pure fantasy. And if I blew up? It would still make for one hell of a story.\n\nLife being what it is, family commitments meant I couldn’t actually race at the event, but I decided to go through a full training block and time trial it anyway.\n\n### Training\nI used the new Garmin Run Coach for this training block. I had already spent about three months training under Garmin’s Daily Suggested Workouts (without a race goal) and felt that I had built enough of a base to handle a more aggressive program.\n\nMy weekly mileage was modest—the average hovered around a 30 km, with my peak week hitting only 45. On paper, this looks a little light, but it was quite demanding in practice. I was running five times a week: two easy runs, a long run, and two quality sessions (a rotation of tempo, threshold, VO2 Max, anaerobic, and sprint workouts). The overarching theme was low mileage, high intensity. Fortunately, with decent sleep and solid nutrition, I was able to handle the grind without falling apart.\n\nThat said, Garmin’s Run Coach is a little quirky. The 15-week program was divided into Base, Build, Peak, and Taper phases — but instead of building progressively, my training load would drop at the start of each new phase before climbing again. It made for some head-scratching moments. For instance, my highest 7-day average load actually occurred at the end of the Base phase.\n\nI did catch a couple of colds and missed about a week of training twice, but even factoring that in, my training load felt suspiciously low for the goals I was chasing.\n\n### Time Trial\nWhen race day (or more accurately, _time trial day_) arrived, my confidence was not exactly overflowing. I debated between two options: either aim for a \"safe\" sub-50, or go for broke with the sub-48 attempt. Naturally, I picked the reckless one. \"Nothing ventured, nothing gained,\" I said to myself, knowing full well it could end in a spectacular blow-up.\n\nI had picked a flat, fast route (the pathway along the Bow River) to give myself the best shot. The temperature was crisp 4°C, and a helpful tailwind was an unexpected stroke of luck. I aimed for a slight positive split: start at 4:42/km, finish at 4:50/km, hanging on for dear life in the later stages.\n\nAfter a short warm-up, I took off. And immediately found myself at 4:35 pace. Rookie move! It took considerable discipline to rein it back. I knew from experience that the first few kilometres always feel suspiciously easy, but there’s hell to pay on the way back.\n\nThe first 5 km unfolded exactly as planned. Steady pace, controlled effort. My original plan was to turn back at this point and head back to the start. Half a kilometre into the return trip, the breeze that was a tailwind earlier had turned into an bothersome headwind (_Shocker, I know!_). So I turned back again, and decided to take an Uber back to my car after finishing.\n\nThis is where things began to unravel. Fatigue hit, I started to run out of breath, and I had to take brief walk breaks nearly every kilometre. The stopping and starting slowed me down. I was a few seconds ahead at the halfway point  but started hemorrhaging seconds after 6 km. Kilometres 7 and 8 were absolute misery. A 30-second walk break at the 7 km mark pretty much torpedoed any shot at breaking 48 minutes. Thankfully, sub-49 was still within reach.\n\nI summoned whatever scraps of resolve I had left, pushed through to the finish, and crossed 10K in 48:30 … half a minute shy of my stretch goal.\n\n### Assessment\nDid I nail sub-48? No. Was I thrilled? Absolutely.\n\nAt the start of the year, breaking 50 minutes felt wildly optimistic. Running 48:30 -- and hitting PBs of 7:29 for the mile and 23:37 for 5K along the way -- made this a huge personal win.\n\nOnce the high wore off, I started dissecting what I could’ve done better. The most obvious area was my training. The low mileage remained a consistent concern throughout the cycle, and I’m fairly certain that adding more volume would’ve helped me claw back those 30 seconds.\n\nNext, I turned to the race itself. Could I have paced it better? Maybe started a little slower and gone for a negative split? It’s a tactic that has worked for me in a half marathon, but a 10K is a different beast. The intensity is higher, and it’s less forgiving of mistakes.\n\nLastly, I wondered if I could’ve just toughed it out -- pushed through the pain, skipped the walk breaks, and hung onto my goal pace. It’s an easy thing to imagine in hindsight, but in the moment, it would’ve been nearly impossible. The fact that I was forced to walk, not because my legs gave out, but because I was gasping for air, told me I was already operating close to my limit.\n\nThe more I thought about it though, the more I realized how many things _had_ gone my way that day. First, I had the luxury of choosing a nice, flat course, and revising it halfway through: not at all possible in a sanctioned race. Certainly not in Calgary, where the organizers love tossing in a few hills. I also ran exactly 10 kilometers as measured by my watch. In an official race, you always end up covering a little extra distance, and those final few hundred meters eat up valuable seconds. The weather too, was close to ideal: cold, with a helpful tailwind. And, for the first time, I was wearing supershoes (Endorphin Speed 4’s). Had I run the Calgary Marathon 10K in my regular trainers, I doubt I would have gone under 49 minutes.\n\n### Closing Thoughts\nThe most meaningful takeaway has been realising how far I’ve come. [Just two years ago](https://np.reddit.com/r/running/comments/13v8fhw/race_report_2023_calgary_marathon_10k/), the idea of running a 10K in under 55 minutes felt daunting. I remember looking at those numbers and thinking, \"_how do people even do that\"_? And now, here I am---finishing six minutes faster!\n\nAnd it’s not just my race times that have improved; I have become much fitter as well. My VO2 Max has climbed from 46 to 51. My easy run pace, which used to hover around 7:30/km to 8:00/km, now sits between 6:15 and 6:30/km. I’m leaner, stronger, and just generally in a better place than I ever was.\n\nIn the end, while there’s always room to improve -- more mileage, smarter pacing, tougher mental game -- it feels like several stars aligned for me that day. And honestly, given where I started, this was probably the best result I could’ve hoped for.\n\n_____\nMade with a new [race report generator](http://sfdavis.com/racereports/) created by /u/herumph.\n\n___\nEdit: I used ChatGPT to help proofread and polish this essay, and threw a curveball at it in the end. But [it wouldn't fall for it](https://i.imgur.com/qsXTZ09.png); not one bit!",
      "author": "BuroraAurorealis",
      "created_utc": 1749564896.0,
      "score": 29,
      "num_comments": 4,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.98,
  "channels": [
    "twitter",
    "reddit"
  ]
}