{
  "id": "twin_MD_Lincoln",
  "username": "MD_Lincoln",
  "activity_count": 1,
  "interests": [
    "that",
    "with",
    "race",
    "around",
    "running"
  ],
  "post_times": [
    1745711523.0
  ],
  "history_sample": [
    {
      "id": "1k8qn6l",
      "title": "Race Report: St. Louis Half Marathon 2025 -My very first HM!",
      "selftext": "Race report:\n\nRace Information:\n* Name: Greater St. Louis Half Marathon \n* Date: April 26th, 2025\n* Time: 2:05:35\nGoals:\nA: Finish without walking - Succeeded!\nB: Sub 2:30 - Succeeded!\nC: Strech goal, Sub 2:20 - Succeeded! \n\nSplits by mile:\n1: 09:54\n2: 10:25\n3: 10:35\n4: 10:09\n5: 09:37\n6: 09:33\n7: 09:29\n8: 09:45\n9: 10:01\n10: 09:16\n11: 09:04\n12: 09:13\n13: 08:13\n.1: 01:45\n\nBackground/Training: (M30)\nI only started running last fall when I was preparing for my first 5k, and also getting back into playing soccer. I attempted to follow more traditional training routines but while I wasn’t successful in doing so, I did work hard to do at least one to two runs each week building up distance in small bits at a time. I learned a lot more about proper stretching and invested in a roller bar to deal with IT band issues (that bar is a lifesaver for that). During the winter I ran in two running series that ran every other week so I got plenty of running in and each race increased in distance as well with the Snowball and Frostbite series however the furthest we ran in those was around 5 miles or so. I decided to up the stakes by running my first 10k with the Bootlegger trail race and that really pushed me to increase my weekly running distance to around 9-10 miles a week attempting at least one long run during that week. After successfully completing that I realized that I kinda like this running thing and I was ready for the next step by signing up for the St. Louis half marathon. From here I got much more serious about how much I’d run each week, trying to run at least 3-4 days a week and pushing myself to run a longer PR  distance run once a week, my furthest run being a 9.8 mile jog around my very hilly town. The marathon was only two weeks away at that point so I started working myself down to slightly shorter distances with each run but trying to keep my total distance ran each week to around 15-20 miles. The last several days leading up to the run included a short 2.5 mile run and playing a few games of soccer, a lot of focus on stretching and getting my diet a bit better than what it had been.\n\nRace Day Morning: \nI live about an hour from the city so I had to wake up quite early at around 4am. I did a bit of stretching at home before the drive and was getting a bit of fluids down. I arrived at the race around 5:50am and did more stretching and a super short warmup run and than relaxed with some new friends I had made who offered me some rice cakes with peanut butter and honey which was hugely appreciated after they found out that I hadn’t eaten anything yet. I usually don’t eat before a race because I don’t want to deal with potential digestion issues during the run but the race cake did very well, and gave me a bit of energy later on! At 6:45am I made my way to corral G and did some more last minute stretches and jumping on my toes to stay warmed up. \n\nRace: \nI knew from the start that I wanted to hang out with the 10:30 pace runners but somehow managed to start off a bit faster than that. By mile 2 though I fell into what I thought was a good rhythm but I was doubting the time the pace team was holding because we were consistently running faster than 10:30. Thanks to my warm ups before the race, I had no issues with any early pains and my legs felt great! Around miles 3 and 4 we ran under the Arch which was incredible (I have visited it several times before but this was somehow even better). At mile 5 or so I felt comfortable speeding up just a bit and started slowly moving ahead of the pace team, and I know found myself hanging out with the 2:15 pace runners. I ran with them until around mile 10 and from here on I started passing a lot of people, and quickly passed the 2:10, and even 2:05 pace teams. At this point though I could feel my left ankle and right knee talking to me but it was fairly minor discomfort and nothing that could make me slow down. I’m amazed at this point that I have managed to run this entire distance only walking momentarily at a few of the water stations, and the thought creeps into my head that I may actually run this entire thing! This was a bit of a dangerous thought though as I was strongly considering walking for a bit, but I had already passed mile 12 and knew I was so close so I pushed on. I never saw the mile 13 marker but the finish line was now in site, and for the last quarter mile I moved into a full on sprint, and crossed the finish line. \n\nPost Race: \nI somehow managed to stop myself after the last second sprint and took in what I just went through, but I only had a moment to do so as I was quickly handed my finisher medal, and more snacks and drinks than I could almost carry! I was practically in a dazed high walking out of the finishers row and into the after party space. As I walked to started taking a mental checklist of how I was feeling, my left ankle definitely was a bit sore and I really needed to get my right leg massaged out as my knee was really talking to me now. But more than anything I could feel the weight of the medal around my neck, and just felt super proud of myself. I have never run this far, especially without stopping. \n\nMy thoughts on the race itself:\nThe course was altered due to a few sinkholes that opened up last week or so, but I was happy with the changes they made. It was incredible running though and around downtown St. Louis, and the streets south of the city. There were so many amazing people along the way cheering us on, and it was awesome reading the signs they made, and so many of the were very funny - toe nails are indeed overrated! I give virtually all credit to me running the entire thing without walking to the people along the way cheering us on. Pot holes and cracks in the road were ever present especially outside of downtown, but the people I ran with were super friendly and we worked together to make sure they were pointed out as we passed them, on that note I made so many great friends along the way and I just had such a good time, especially being my first HM. Next year? I’m aiming to run the full!",
      "author": "MD_Lincoln",
      "created_utc": 1745711523.0,
      "score": 16,
      "num_comments": 3,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "tiktok",
    "instagram"
  ]
}