{
  "id": "twin_gustakhjafri",
  "username": "gustakhjafri",
  "activity_count": 1,
  "interests": [
    "that",
    "around",
    "with",
    "which",
    "this"
  ],
  "post_times": [
    1746532736.0
  ],
  "history_sample": [
    {
      "id": "1kg2n2l",
      "title": "Göttingen Halbmarathon 2025",
      "selftext": "### Race Information\n\n* **Name:** Göttingen Halbmarathon 2025\n* **Date:** May 4, 2025\n* **Distance:** 21.1 km\n* **Location:** Göttingen, Germany\n* **Time:** 1:39:31\n\n### Goals\n\n| Goal | Description | Completed? |\n|------|-------------|------------|\n| A | Sub 1:45 | *Yes* |\n| B | Sub 1:40 | *Yes* |\n\n### Splits\n\n| Kilometres | Time |\n|------|------|\n| 0-7 | 33:14\n| 7-12.5 | 25:13\n| 12.5-17.5 | 25:26\n| 17.5-21 | 15:37\n\n### Backstory\n\nIn Jan 2024, I decided I wanted to aim for a 2-hour half marathon. In the months leading up to my decision, I had tried to run regularly, largely to lose some extra kilos I had packed after a summer of drinking all the delicious (but incredibly cheap) beer that Portugal had to offer. I hadn't been as consistent as I would have liked: I did around 230km total between August and Dec 2023, with my longest run/walk being 12.20km at 7:25/km pace. I had run a 10K event at the end of Oct 2023 at 5:57/km pace, which had been a pleasant surprise. I had previously, in 2017 and in 2019, also undergone spurts of wanting to get into running but these had meandered nowhere. My 5km pb from 2017 was 24:51, which I had run on a cold Toronto day, mostly downhill.\n\nI had two big motivations for wanting to run regularly now, in early 2024. First, regular physical recreation had always been an important part of my PhD, which was now approaching its end (aka dissertation writing was gathering steam). My preferred sport had been road cycling, but because my research involved a lot of extended travel after the first couple of years of grad school, the volume of my physical activity had dwindled substantially with each passing year. With all my data collection out of the way, and parts of the dissertation in decent shape, I felt a regular running schedule would help structure my writing and allow me to get into a good rhythm to finish the PhD. Second, in Oct 2023, my (soon to be) sister-in-law had gifted me a Garmin Forerunner 265, which was a considerable upgrade on the Garmin Forerunner 25 that I had picked up in 2017, as an incentive to start running. The 265 came with all the fancy Garmin plans that just blew my mind, so I experimented with a few, but could never be consistent until January 2024, when my better half and I returned to Coimbra, Portugal, where she was a doctoral student.\n\n### Training (the longer version)\n\nFrom Jan 2024 through to Mar 2024, training was stop-start and I only logged around 77km across the three months. But when a trip to Toronto loomed from April 2024 through to early July 2024, I committed to a Garmin training plan aimed at a 2-hour half marathon. Consistent training in April 2024 and May 2024 paid immediate dividends: on May 26, 2024, on a long training run, I ended up running my goal time (elapsed time on Strava was 2:06:xx, accounting for the different traffic lights etc. that are part and parcel of running in a city). But this effort left me exhausted, and when I tried a small recovery run two days later, my legs said no after the first 200 metres. So I took a week off running, and decided that I wanted to be able to run the same time but also have the fitness and strength to not struggle to walk up the stairs in the week after!\n\nAnd so, from April 2024 through to August 2024, I ended up logging around 640 km, which was by far my greatest volume of running. I was fairly regular, running 3-4x times a week, and did a mix of easy runs and intervals, whatever my watch suggested. In August 2024, on a long weekend run in Coimbra, I bettered my half-marathon time by recording a 1:57:57, and this time, I was able to go on my recovery run when the week started. In September 2024, I moved to Göttingen, Germany, where I continued running regularly. I did a super easy 30km run on a beautiful Saturday in September and then, on Nov 1, 2024 I ran a 1:45:46 half-marathon on my own, enjoying the pace, and was able to do an easier 10km run the next day with my partner.\n\n### Training (the more immediate version)\n\nIn Jan 2025, I signed up for the Göttingen Halbmarathon, scheduled for May 4, 2025. My goal was to break 1:40:00, and I was fairly confident that I could do so with the right amount of training. But this, dear reader, is where the upward and the always improving trajectory of my running adventures came to a grinding halt. In early Jan 2025, I was invited to interview for a tenure-track position in the US. This job process is super gruelling, and I spent much of my time in Jan and Feb preparing for the campus visit. I ran a fair bit in Jan 2025, logging around 72km of easy runs, but in February, I traveled to Portugal where the weather was not co-operating (it rained, a fair bit) and I decided to prioritize my professional life, thinking I'd return to training in March. I only logged 35km in all of Feb. Sadly, my prioritizing of the job opportunity did not pay dividends, and I spent much of March depressed and sad about what could have been. It continued to rain in Portugal, and with each day I dread the upcoming race for which I had signed up. \n\nAt the end of Mar 2025, my partner and I moved to Berlin (where we are for the next few months) and I decided that this was now or never. My lofty goal of 1:40:00 was nowhere in my mind: I just wanted to first, finish, and second, if possible, get a 1:50:00 and some race experience under my belt. I managed to log 125km in April, and focused mostly on time-training. I ran a couple of 1:15 runs at a tempo pace (running 13.9km and 14.3km), one run at around the one and a half hour mark (16.45km), and then a final long run at just under 1:40:00 (19.45km). I felt comfortable that I could finish, if all went well, and that I might even push my personal best, and squeeze in just under 1:45:46.\n\n### Pre-race\n\nBut, on Tuesday, April 29, with the race on Sunday, I went for my final hard effort run. I ran around 9km, at 4:30/km and suddenly, my mind starting doing mental math on the possibility of 1:40:00, which had been my original goal all along. The temptation was too much to ignore, and I decided to play it be feel on race day. I did a couple of super easy runs, one on Thursday, and one on Saturday, and we traveled to Göttingen on Saturday to pick up my number and to check-in at the hotel for our stay.\n\nOther than just distances and times, I had been careful with my diet in April. After the first week of April, I stopped drinking alcohol to help with getting in good shape (even if this was a placebo thing on my part!). I had pasta for dinner the two nights before the race, and I snacked and hydrated a lot in the two days before Sunday. My body was fine: I had a blister on my 19.45km long run, which was a first, but I had drained it and it hadn't flared up since. I had experienced some chafing on my 16.45km run, which was also a first, but this hadn't reoccurred either. My only risky thing for the race was a new short that I picked up from Decathlon on Friday, just so I could have a zipped pocket for my gels!\n\nI got a good 8 hour sleep before the race, and my partner and I grabbed some porridge for breakfast from the train-station which was close to our hotel (and also the university housing in which we had lived when we were in Göttingen). I spent an hour on the pot in the hotel, which I was very happy about, and then we waited for a local bus to take us to the event start, and I began to see other runners also arriving at the train and bus station where we were. The bus dropped us off around a 20-min walk from the event, and I joined the hundred or so runners walking the same way to the event. This area was all familiar to me, as I had spent my fall and winter running on these roads! My partner and reminisced about some of our runs together that had gone through this neighbourhood, which was quite lovely.\n\nWe arrived at the venue at 9:45am, and it was drizzling ever so slightly. The temperature was around 8 or 9 degrees, so I was bit worried that my shorts and my t-shirt might be insufficient. I used the restroom quickly, drank a gel (this had not been part of my original plan for the day, but I went with gut instinct) and did my stretches and, before you know it, it was time to line-up for the scheduled start at 10:00! I had decided, in the days prior, to line up in Block A, which the organizers had advised should be used by runners aiming for a sub 1:45. Even as I stood in Block A, my mind was still torn about playing it safe and running with the 1:45 time marker or with having confidence in myself and seeing what I could do on my own. The start was ever so slightly delayed: my partner told me after the event its because the organizers couldn't get the gun working and I joked that this was a very European problem (in the best way possible) since, if this was the US, half the crowd would have their guns ready to go in lieu of the start gun.\n\n### Race\n\nAnd just like that, there was an announcement for runners to be ready, and then there was a countdown! For one last time, I went over my race plan. My strategy was based on the out and back course that I was running. I knew that there was a slight uphill until the 2.5km mark, then a gradual downhill until the 8.5km, and then a short but noticeable climb would follow before a rolling terrain. All of this would take place mostly along the river, and then we'd enter the rolling fields towards the 12.5km mark (which was also the turnaround point). At around the 17km mark, we'd be back along the river, this time heading gradually uphill until the finish. My goal was to be near the halfway mark at the hour mark, and use that to calibrate my pace and target. \n\nBut when the gun went off, the excitement of the race, the energy of the crowd, and the effect of being in a fast corral meant the start was pacey. I spent the first hundred meters trying to stay within the 4:40-4:50/km pace, as many runners zoomed by from behind me. I tried to keep an ear out for the 1:45 pacer, just in case I needed to slow. But, as the first and then the second km wound down, and I was overtaken by a few more people who huffed and puffed, I settled into a nice rhythm. I had run the first two kms at 4:46 and 4:44, faster than my 4:50 ideal pace, and faster still than my 5:00 safe pace. Over the next 6km of overall gradual downhill, I held between 4:35 and 4:40, taking care to not go faster. After the 2.5km mark, I also begun reeling in some of the runners who had overtaken me in the first couple of kms-- this would become a theme as I slowly overtook a few runners, of all ages and sizes, who had started a bit too strongly and were now paying the price. The first hydrating station came at the 5km mark, and I eyeballed it to see how it was working and what they had. When the next hydrating station came at the 7km mark, I grabbed some water and fiddled with my shorts and zipper to take out my first gel.\n\nAs we left the river and turned inward, I overtook some more people, especially on the short climb, and made a mental note to slow down. But my body was not quite in the mood to listen to my brain, so I hovered around the 4:40/km mark. The wind was noticeable in the fields, and around the 10km mark is also where, if I remember correctly, the leaders were already heading back. As I approached the 12.5km turnaround point, I was aware that I was just slightly ahead of my 1:40:00 pace. When I turned around, I grabbed some water, and started counting down the minutes to 1:05, when I would have my second gel. I ended up eating a bit later, at the 1:10, because I felt I was fine. The main benefit of turning around on this course was being able to see the entire field of runners, and I crossed the 1:45, 2:00, 2:15, and the 2:30 pacers before I hit the river again. I was able to slow down, and ran around 4:45/km for around three km. \n\nWhen I was back out on the river, it was a slight uphill all the way to the end, and a couple of runners who had saved their strength and stamina, went zooming past me. I was tempted to follow, but I reminded myself that a short burst now could mean suffering later, so I focused on just increasing my pace ever so slightly, hovering around 4:30 mark. Some more runners came storming by and I, in turn, also ran past many people (some who were doing a 10k, others who here in the half with me). Knowing the course well came in handy in these last kilometres, and though I was able to maintain around 4:35 here, I could do so only because I knew exactly how far out I was. \n\nAs I rounded the road to enter the track where the finish line was, I tried to scope out the big clock next to the finish line. But I had some trouble seeing the time since some spectators were blocking my view. However, as I turned on the track and was around a 100m from the finish line, I saw the 1:39:xx on the clock and that was enough to know that I had made it! \n\n### Post-race\n\nI crossed the finish line, grabbed an apple and some water, and went outside the runner's area to meet, kiss, and hug my partner. I shared the race with her (as I would, over the rest of the day, and in the days since...), and she had already scoped out the entire stadium with respect to what I had to do next. She guided me to the showers, and then we walked back to the city centre since our bus back to Berlin was only leaving in the early evening. As the day wore on, I did feel the race in my body: I am not surprised, since I definitely went hard at a level that was just under my limit, and on a fairly insubstantial training volume. But the experience was good because now I officially have a baseline around which to train and on which to improve. As well, small things like packing a towel for the showers or having different clothing options ready are things I have now realized are pivotal to race prep.\n\nI cannot say enough good things about the Göttingen Halbmarathon. If you're in the area or in Europe, its a wonderful race to participate in, especially if you want to make a small trip out of it. The starting field was around 1400 people, which was a great size, and the support was wonderful. I am very glad this this was my first half marathon experience!\n\nMade with a new [race report generator](http://sfdavis.com/racereports/) created by /u/herumph.",
      "author": "gustakhjafri",
      "created_utc": 1746532736.0,
      "score": 10,
      "num_comments": 2,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "tiktok",
    "instagram"
  ]
}