{
  "id": "twin_silly-goosing",
  "username": "silly-goosing",
  "activity_count": 1,
  "interests": [
    "that",
    "with",
    "this",
    "were",
    "training"
  ],
  "post_times": [
    1746207391.0
  ],
  "history_sample": [
    {
      "id": "1kd6wri",
      "title": "First Marathon Race Report: Big Sur International Marathon",
      "selftext": "# Race Information\n\n* **Name:** Big Sur Marathon\n* **Date:** 4/27/25\n* **Distance:** 26.2 miles\n* **Location:** Big Sur, CA\n* **Time:** 3:42:56\n\n# Goals\n\n|Goal|Description|Completed?|\n|:-|:-|:-|\n||||\n|A|Complete the marathon without walking|*Yes*|\n|B|Sub 4:00|*Yes*|\n|C|Sub 3:45|*Yes*|\n\n# Splits\n\n|Mile|Time|\n|:-|:-|\n|||\n|1|9:23|\n|2|9:25|\n|3|8:37|\n|4|8:26|\n|5|8:37|\n|6|8:24|\n|7|8:44|\n|8|8:41|\n|9|8:39|\n|10|7:48|\n|11|9:25|\n|12|9:02|\n|13|7:41|\n|14|7:56|\n|15|8:41|\n|16|8:08|\n|17|7:55|\n|18|8:48|\n|19|7:55|\n|20|8:26|\n|21|7:56|\n|22|8:12|\n|23|8:00|\n|24|8:03|\n|25|7:06|\n|26|7:25|\n|0.2|6:44|\n|Average Pace|8:31|\n\nTLDR at the bottom cause this a long one\n\n**Background**\n\nThis was the first marathon, I live in Monterey Country so I took my chances for the lottery and got in. I am a 24F and I've been an avid runner for about a decade, not consistently more on and off. It started when I first did cross country in high school, I was a decent runner and I broke 20s for a 5k once on a course I was very familiar with. After high school, I stopped running consistently, would go on short runs (>4 miles) very rarely. I did get more into weight training, I've been going to the gym mostly consistently for almost 4 years now. In 2023 I did a half marathon I signed up for pretty last minute. I did a long run barefoot ( I now know that was not a smart choice ), got injured, and was only able to train for about 2-3 weeks but I had been running a little more consistently at that time so I think I did well with a time of around 1:45:00. I really enjoyed it and decided I wanted to do a marathon next. Since Big Sur was the local big marathon in my area, I chose that one.\n\n**Plan**\n\nAfter doing some research on what plan would be best for me, I settled on this one based on my goals:\n\n[https://marathonhandbook.com/4-hour-marathon-pace/](https://marathonhandbook.com/4-hour-marathon-pace/)\n\nI knew just finishing the race would be my most important goal because I really did want to focus on having fun rather than a time. However, I think given my background, I felt confident that I could do sub 4 and chose this plan. I made some minor adjustments, most notably, I had to cut it down to 16 weeks from 20 weeks. I would also do 2 days of strength (upper and lower) so I replaced one rest day to focus on strength training, and the other I would do on a recovery run day.\n\n**Training**\n\nI started training on the second week of January (Week of 1/06). My plan consisted of was split into base, hills, interval, tempo, peak, and taper. I knew that I would have to train on hills so I did do most of my long runs on hilly terrain throughout the whole training period where I would get in between 1000-2000 ft of elevation on runs longer than 10 miles. The base period was a little rocky, I had to get used to running consistently again, though I admit I did miss a run here or there or would cut it short because of time constraints. I had to get used to double days of strength training and running because those took a toll on me. I started off with doing strength in the morning and runs in the evening but switched when I realized it was affecting my runs more than I'd like. Running in the morning before the sun would be scary and cold, it was harder to convince myself to get up than when I go to the gym because of the dark and cold. I admit I didn't really get used to it, I learned to tolerate it tho, especially after getting gloves!\n\nAbout a month into my training, I started training with a high school track team I coach for. However, I would not do my workouts with them because we obviously have different goals, but long runs and recovery runs I would do with them. Training while coaching was great to take advantage of my time but reflecting on it now, it wasn't a very good idea. I mostly ran with the varsity distance boys because they would run milage similar to mine but they definitely go faster than the RPE that I was supposed to be hitting and I would go along with them. For example, I did a 13 mi long run at 7:40/mi pace just to keep up with them. Also, my race pace runs would start of race pace but would end closer to low 8 min pace so I did go a little hard at some points. I stopped doing long runs with them after that because I did want to focus on recovery during my long runs and that helped. Even when not going some runs with them, I did notice I was going a little more than I should have since my race pace goal was my go to pace for a lot of runs that weren't workout. Throughout this time, with working, training, going to the gym, and coaching, I was tired all of the time so be prepared for that part.\n\n**Injury**\n\nSo my training was going great, I was feeling good during my runs, tired outside of that but I was being consistent. So on my 10th week of training (week of 3/10), I went for my long run. I was feeling great that week, very energized that day. I ended up pushing myself quite a bit during my 16 mi long run, and ended up doing 2000+ ft of elevation at an average race pace. I did stop a few times to figure out music and take gels and pictures but nothing longer than a minute or two. I was feeling great after this run, nothing hurt in the moment. However, the following week, during my tempo workout, I felt a sharp stinging pain down my outer right shin. I had been feeling some discomfort the past few weeks but nothing that got in the way of my running until now. I couldn't even do 3 miles so I cut it short. I definitely think that long run was the last straw my leg had before telling me I need to relax. I was originally planning on only taking a week off because I these were the weeks leading up to my peak which i felt were crucial but I realized  that was not a wise option. I ended up taking 2 full weeks off and on the third week easing back into it with low milage. During my time off, I focused on RICE. I would ice once a day for 10-20 minutes on an elevated surface. I would do some cardio on the elliptical, but it was hard to keep up the volume it. I tried biking my long run in the area where I do my hilly runs but I almost fell and cut it short 3 miles in. I also focused more on strength training again. It felt nice to be resting given that my body was tired almost constantly before this but I was getting bummed out knowing I was missing out on my top milage weeks and long runs where I wanted to practice race day practices (gels, gear, hydration, nutrition). I had been training in Saucony Endrophin Speed 3 shoes but got a new pair of Saucony Kinvara 14 (shoes I've owned before) shoes as I felt the lower drop could help out with my shins as well as interchanging between two different shoes. I also got compression sleeves that helped out tremendously. Once I was ready to get back on the program, I was able to squeeze in one week before starting the taper. My official taper was 2 weeks including race week.\n\n**Pre Race**\n\nI attended the expo after work on Friday and it got me feeling so excited for the run. I bought some last minute gels and chatted with the pacer organization. Everyone was really excited for me when I told them this was my first one. Throughout the week I was really nervous about the weather. I live in the area so I know Big Sur is breathtaking on sunny days and I was really looking forward to that but the weather had other plans. Week of was cloudy and colder than usual which really bummed be out after the past week had been gorgeous. I did do a rain dance a few times hoping I encourage the clouds to make it pour on Saturday so the forecast would move up a day but it didn't work :,(. Regardless I was really excited. Day before, I did an easy 3 mi shakeout run in the morning. The track team I coach had championships that day so I ended up sprinting back and forth during the meet to cheer and give my athletes their splits and that was not a good idea but that race did help get me more excited for my own race. For breakfast I ate a chorizo burrito and sweet bread. Lunch I had 2 slices of Costco lasagna. Dinner I had a Dominos Chicken Alfredo Pasta Bread Bowl (highly recommend!!!). I also dank 2 electrolyte drinks and stayed hydrated with water throughout the day. I wanted to go to bed by 7, but didn't end up falling asleep until around 8:30pm.\n\nDay of, I woke up around 2:20 am, got dressed and ate a bagel with peanut  butter and half a banana. I wore Lululemon leggings and align top, calf compression sleeves, a race belt,  Saucony Endorphin Speed 3 shoes, a hat, a thin throw away long sleeve and a pair of sweats with a jacket. I also put on race glitter on my face and wrote my mantras on each forearm. On the bus ride down I did get a bit car sick, likely a mix of nerves and the turns without being able to look outside because of the dark. Once we got there it was sprinkling so they gave us emergency plastic blankets while we waited. I drank a Guayaki Yerba Mate at about 5:40 am (has 150 mg of caffeine). There were plenty of porta potties, I went twice. First time I only waited about 7 minutes, second time I did wait about 15 minutes and I was getting nervous because corral A start was getting announced (I was corral B).I took a liquid GU (no caff) right as they were announcing my corral.  I was barley able to go and get my bag checked in on time so I wasn't able to warm up whatsoever. I wanted to join the 3:50 group but I started way in the back of corral B so I didn't end up finding them at the start. Race started at 6:52.\n\n**Pre Race**\n\nMile 1 -2: The race started in a wooded area. One of my goals was also to get a negative split so I didn't want to go too fast at the start. Since I started towards the back of the corral, most people were going a more relaxed pace but a mile in I looked at my watch and I realized I was going a bit slower than I wanted to so I decided to pick it up just a bit. It was difficult weaving through people at this point, especially after they close the second lane. I did do a lot of zig zagging to get past people and I was a little shy hoping I didn't look like a noob that was going out too fast at the start.\n\nMiles 3-5: At some point here, I noticed my apple watch was acting weird. I was using the fitness app tracking to track my run and during the  run, my watch stopped the run and said I was doing function stregth training. The rain droplets must've messed with it and I tried fixing it but from past experience, you cant go back to a previously started activity if you start a new activity. I'd have to start a new one so instead I pulled out my phone and started strava on there. The watch distracted me for a while and bummed me out but I tried not focusing on that. We were still in the woods and it looked  gorgeous with the fog and drizzling. There were minor rolling hills but very gradual that my legs didn't really feel them. It was still decently packed and difficult to get past people.  I took my second GU gel at station 4.8(no caff), I tried to stay running but almost chocked on the gel and felt i couldn't breathe for a few seconds there.\n\nMiles 6- 10: You come out to an open area with hills and ocean view. The headwind was a bit stronger here because of the openness, I tried running behind people to take on the wind but the runners started separating a bit more now that there was more space and I ended up ditching that strategy because I didn't want to get too close to peoples person space for an extended period of time. The winds weren't too strong though and this was a flat area. I noticed Strava wasn't giving me any of my splits (I realized later I set my activity to cycling not running) so I was really just guessing my pace here. I tried calculating it at each mile marker and felt I was doing a good pace. I took my second GU gel at station 10.4 (25mg caffeine), this time I stopped to drink my water.\n\nMile 11-13: I would see the hill from a distance and it got me nervous and excited.I ditched my top layer right before the hill started to give me an extra mental boost and queued some of my favorite songs. The hills were long but the incline was gradual so they didn't tire me out.  My pace slowed down just a bit but I was feeling good. My thighs had been feeling heavy already for a little while but nothing too bad that was getting affected by the hills.  When I say long hills I mean it, there were at least 2 points when I thought the hills were over but oh no, its still going. I wasn't dying to get them over with I was just suprised how long they were, \n\nBut when you got to the top and saw Bixby Bridge, it looked beautiful and made me excited to keep going. You could hear the piano from the last hill too before you turn the corner. I let the downhills take me so I could relax my body while letting gravity do the work. I grabbed a lemon GU at station 12.2 but didnt take it yet.\n\nMile 14- 16: At station 14.7, I took my GU and then I stopped for a quick bathroom break. I had been needing to go for a while now but this was the first one that didn't have a line. My knees started aching a bit and my legs were feeling tired but overall, I felt good. There was people giving tequila shots at some point and I was so tempted to take one for the fun of it but it was too early in that I wasn't ready to take that risk.\n\nMile 17-19: These were my hardest miles mentally. While training, the max milage I had gotten to was 16 miles and my body felt better then than it did in this moment. My mantras were smudged cause of the rain and sweat but I kept looking to them to remind me to keep it up. I didn't feel horrible but these miles did feel longer than the rest for me. I felt a blister starting to form on my right foot arch, my sock kept falling down and one of my toenails was in pain. Someone complimented my glitter at this point and that got me happy. I was also happy knowing each step I took was a new personal record for how much I've ran.\n\nMiles 20-24: I took a lil selfie at the 20 mile marker. The mental boost when reaching the 20s is real, my mind felt great at this point and got my body to not focus so much on how heavy my legs felt. I did want to cry a little bit at this point because I was so happy but so tired ad so excited, just a mix of emotions going on. I wanted to pick up the pace because of this and I did but also listened to my body to not go to crazy yet. I took my last GU (caffeinated) at station 21.2. There were some rolling hills but nothing too bad. I was excited for the strawberries but wasn't used to eating solid food while running so I had to force myself to swallow the one bite I took.\n\nMiles 25-26: When I saw the the 25 mile marker, I decided to pick up the pace. I was feeling great and was excited with the increasing number of spectators cheering us on. There was one last hill and it was a bit tough but I was so excited that it also didn't feel horrible. I took of my headphone during the hill so I could see if I could hear my family at the finish line. Once I passed the 26 mile marker and I could see the finish line, I booked it and kicked at the end. During my training, I practiced a 0.2 mile kick at the end of my runs for this moment. The announcer even gave me a little shoutout for my \"burst of speed\" which made me really happy! There were multiple mats at the finish line so I didn't stop until I crossed the last one just in case.\n\n**Post-race**\n\nMy family met me at the finishers village and I did shed a few tears from happiness and exhaustion when they hugged me. They were also excited that they saw me finish so strong. I was honestly very surprised I didn't see more people kicking at the end because it was something I thought was typical from my racing days in high school but I also realized most people were very tired. I grabbed my complimentary beer and had breakfast with my family and friends that came out to visit me. I felt so fortunate being able to bring together so many of my loved ones to celebrate this moment with me.\n\n**Recovery**\n\nThat night I used a massage gun on my legs and it really helped out with soreness. I was sore for the next two days but if you do strength training, it's milder than that type of soreness. My joints did hurt though and I'm not used to that. I felt fine while waking but the aching was there. I'm taking this full week of from any strenuous physical activity, I've been going on walks and doing some yoga to stay active.\n\nI absolutely loved this race and recommend it to anyone willing to put in the work. I was very nervous about the hills but I practiced on some steeper hilly terrain  and that prepared me so well that the hills were not bad at all so that is my recommendation!!! I ended up with a negative 8 minute split! Starting slow and picking it up until the end was a great strategy for conserving energy for those last few miles cause I needed it.  Can't wait for the next one!\n\n**TL;DR**:  \nRan my first marathon at Big Sur as a 24F who’s been an on-and-off runner for about a decade. Used a modified 16 week sub-4 training plan with added strength training and coached high school track during training (which led to pushing too hard at times). Training included some focus on hills with most long runs being on hilly terrain. Got shin splints in week 10 after a tough long run, took about 3 weeks off, and resumed one week before taper. Pre-race weather was colder and cloudier than I’d hoped, and my watch stopped working during the race but despite setbacks, I stayed excited and focused on having fun and finishing strong. The hills weren't as bad as I expected because they were gradual, and the views were still gorgeous in the rainy conditions. Late teens miles were the hardest, last 10k was tiring but very exciting! Overall great experience and hit A,B,C goal and a negative split!   Big Sur is beautiful and I very much recommend this!",
      "author": "silly-goosing",
      "created_utc": 1746207391.0,
      "score": 44,
      "num_comments": 10,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "twitter",
    "reddit"
  ]
}