{
  "id": "twin_shmajent",
  "username": "shmajent",
  "activity_count": 1,
  "interests": [
    "with",
    "before",
    "race",
    "this",
    "time"
  ],
  "post_times": [
    1744025445.0
  ],
  "history_sample": [
    {
      "id": "1jtj04g",
      "title": "Cheap Marathon, Huge Value",
      "selftext": "### Race information\n* **What?** 2025 Cheap Marathon\n* **When?** April 5, 2025\n* **How far?** 26.2 miles\n* **Where?** Derry, NH\n* **Website:** [https://www.millenniumrunning.com/cheapmarathon/](https://www.millenniumrunning.com/cheapmarathon/)\n* **Strava activity:** [https://www.strava.com/activities/14088815423](https://www.strava.com/activities/14088815423)\n* **Finish time:** 3:22:35\n\n### Goals\n| Goal | Description | Completed? |\n|------|-------------|------------|\n| A | Redeem Tokyo (3h 39m 25s) | *Yes* |\n| B | Set/Match PR (3h 25m 00s) | *Yes* |\n\n\n### Splits\n| Mile | Time |\n|------|------|\n| 1 | 7m 24s |\n| 2 | 7m 33s |\n| 3 | 7m 26s |\n| 4 | 7m 20s |\n| 5 | 7m 33s |\n| 6 | 7m 20s |\n| 7 | 7m 20s |\n| 8 | 7m 34s |\n| 9 | 7m 28s |\n| 10 | 7m 33s |\n| 11 | 7m 32s |\n| 12 | 7m 25s |\n| 13 | 7m 32s |\n| 14 | 7m 42s |\n| 15 | 7m 48s |\n| 16 | 7m 46s |\n| 17 | 7m 34s |\n| 18 | 7m 42s |\n| 19 | 7m 42s |\n| 20 | 7m 54s |\n| 21 | 8m 00s |\n| 22 | 8m 06s |\n| 23 | 8m 27s |\n| 24 | 8m 18s |\n| 25 | 8m 25s |\n| 26 | 8m 05s |\n| 27 | 2m 06s |\n\n### Training\nI registered for this in ’24, and had my “standard” training before then. Over twelve weeks or so, I tried to make my longest run in a week go farther than the one two weeks before. Then I would “hold” for four weeks alternating at 18mi and 14mi before tapering from 22mi to 10mi in the last four weeks before. Other runs would be mostly casual, attempting to go distances and times without looking too much on milage. I averaged about 40mi/wk. Unfortunately, *last* year they postponed for two weeks for a freak blizzard, *then* I suffered a fall in the gym earning a rib contusion. I deferred to this year. For this year, after registering, I learned I got into Tokyo, which ended up sorta becoming my long-run in the taper down as mentioned. (Note: I did not perform well in Tokyo, a developing cold and dehydration from poor nutrition on vacation may have been the culprit for a my time.) I clocked 3h39m in Tokyo this March, hit a 1h32m at the NYC Half two weeks later, then suffered food poisoning a week after that.\n\n### Pre-race\nAbout two days before, organizers published a livestream explaining the race and unique start procedure. The bib number and my precise start time – 7:46:08AM – was also revealed, more on this later. Millennium Running in Bedford, NH, played host to the packet pickup. Everything was quite smooth, no additional tools nor ID’s needed for pickup. To quote the organizer, “if we have people stealing bib numbers for this race, we got larger problems in society.” It was easy to pick up the bib and I bought some swag, at a reasonable US$20. Nutrition-wise, it’s a carbohydrate heavy two days before the race, with lighter portions the day before to prevent bloat. Bagels, coffee, whey, yogurt, bananas, chicken parm, jelly beans (tons)…\n\nFor some reason, last night’s chicken parm decided to have a little revenge. I added Pepto to my pre-race nutrition (two bagels, one banana, 3Tbsp peanut butter; 4 Gu for the course, 4 electrolyte tabs, 20fl oz H2O).\n\nThey do have bag check at this race, though since you’re parking relatively close to the starting area anyway, you don’t need to check much if anything. I arrived to the area at 6:40AM or so, and found street parking easy (for *that* time of day).\n\n### Race\nThe start procedure is \"time trial inspired.\" Everyone is seeded based on what time they input as a predicted finish time during registration. (Launching separated pairs of runners with near-enough pace expectations prevents dodging, weaving, and crowding on the course’s narrow bike path.)  The last two digits of your bib are your \"cone number,” the first two digits are your group. The first pair of the first group (e.g. bibs #101 and #102) start at the same time, seven seconds later the next pair (#103, #104) go, and so forth, hence the specific start – be in your group ten minutes before and get to your cone when they call your group up! Seconds before you're up, your name shows up first as “on deck,” then on the LED board with huge letters and countdown timer. 3..2..1.. go, drag race style.\n\nThis made it really easy for me to get into the race groove, as I had someone next to me already with a  relatively identical pace. It also meant there was a little bit of a gap to the people ahead, and virtually no clumping on a narrow rail-trail course.  I was jiving along, running at about 7:30/mi (4:40/km).\n\nThe course was a paved out and back rail trail, with four police-protected road crossings. Marathoners traverse it twice. While the trail was indeed narrow, it was still easy to get around. Mind the rare small cracks and divots in the pavement, which could trip you up. Scenery was woods-like, as one could expect for New England, which even in the budding of springtime with brown trees and patches of ice on rocks was still a spectacle to behold. There is a hairpin turn around mile 6.1 into the lap, there was no congestion for me, yet I fear I tripped the person next to me? No one fell? The path undulated slightly, with sensations of going “uphill both ways/.” Certainly not “pancake flat” – [Jim Thorpe Area Running Festival Marathon](https://www.reddit.com/r/running/comments/135h5ym/jim_thorpe_area_running_festival_marathon_2023/) holds that record!\n\nWater stops were about 3-ish miles apart, and the cold weather (30’s F with wind chill) and gray skies did not dehydrate me as I was sapped in Tokyo. Still having the extra water with me did help. (Unlike Tokyo, runner-carried hydration is allowed alongside nutrition, just make sure to throw away your trash in the appropriate bins on course.) They supplied both water and Gatorade at all stops, with Gu chews also available at about miles 3/9/15/21. By this point, I took my own Gu gels at miles 3, and 8. At mile 12, I was feeling good, my hamstrings were getting a good burn. The only sizable hill occurred on the northbound side of that turnaround. \n\nFull marathoners exited right from the trail at mile 12.5 to complete a street loop and go south through the course again. Half-marathoners were launching at this time, now 14-seconds apart. (The pace of those runners was timed to approximate the pace of the marathoners starting their second loop. Again, masterclass in coordination.) My third Gu went down easy at mile 13.5. Around mile 15/16 I felt some cramping wanting to start, and had two electrolyte tabs. My fourth Gu – chocolate coconut! – came around mile 18 or so. My pace started to slip since the start of lap 2, and only dropped 20s/mi (12s/km) by the end. The gradual hills bit me. \n\nAt the end of loop 2, marathoners turned right to finish the course. That hill somehow did not feel as steep as on loop one, and I dumped what I had in the final 200m.\n\n### Post-race\nThe announcers were energetic and appropriately funny, for example referring to a runner’s home state of Ohio as “national champion Buckeye’s home.” After crossing the line, you get your ribbon – no medals here, but it’s still highly unique. They offer bananas, yogurt packs, pretzels, and so forth. Aid is immediately available (as it was on course), as were post-race photo ops in front of “I BQ’d” signs and a PR bell to ring. I finished with a personal best, shaving 2m 25s off my previous mark. \n\nFrom there, I lingered around for a half hour to do some shopping at the vendors there before headed back home. I realized that I felt *really* good. My hydration may have been on point, my nutrition was likely spot on. No cramping, no headache, no nausea. Credit may go to a high high protein diet for the two weeks before and focusing on simple carbs. The lesson learned from Tokyo is to force and monitor water intake the week prior to a race.\n\n### TL;DNR?\nGreat organized race with time trial start, be sure to watch the livestream/replay the days beforehand to get an understanding of start procedure. Expect cool weather, great support, and an exceeds-expectations on value for dollar. Plus, there are a few of local diners and coffeeshops at which to buy yourself treats afterwards.\n\n\n*Edit: Clarified grammar in some parts.*",
      "author": "shmajent",
      "created_utc": 1744025445.0,
      "score": 69,
      "num_comments": 21,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "instagram",
    "youtube"
  ]
}