{
  "id": "twin_bachfanwpb",
  "username": "bachfanwpb",
  "activity_count": 1,
  "interests": [
    "other",
    "it’s",
    "even",
    "cars",
    "like"
  ],
  "post_times": [
    1756040075.0
  ],
  "history_sample": [
    {
      "id": "1myutub",
      "title": "What’s the culture on the roads like where you live?",
      "selftext": "I do most of my running in 2 places: South Florida and Cape Cod, Massachusetts. The way I’m treated as a runner on the roads in these places is wildly different, and was wondering what it’s like in other areas.\n\nFlorida: Even at a crosswalk, cars don’t yield. People with dogs on leashes do not shorten the leash or move so they aren’t taking up the entire sidewalk and I’ve been clotheslined more than once. Dogs off leashes can’t be trusted not to chase you. People walking or standing around chatting, even when they see you coming, do not shift over to let you pass. Cars don’t give you any extra room even if the other lane is empty. Cyclists are hit or miss. Some yield to you, some force you to pull a Homer Simpson in the bushes kind of move to avoid being hit. Other runners wave or nod maybe 1/4 of the time. In short, every person for him or herself. And I hate it.\n\nMassachusetts: Entirely different story. People in cars stop to let me cross even if there isn’t a crosswalk. The cars wait for the other lane to open up so they can give me more room. So much more awareness and consideration to others sharing the road, sidewalk, or trail. Rules generally followed about which side to bike or walk on, and cyclists yield to runners. Eye contact when we pass and some kind of acknowledgement.\n\nI often say we have a culture problem here in Florida, and it transfers into so many aspects of life. It’s very me, not we.\n\nIt’s just such a drastic difference. So I’m curious what it’s like in other states and countries.",
      "author": "bachfanwpb",
      "created_utc": 1756040075.0,
      "score": 563,
      "num_comments": 259,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "tiktok",
    "instagram"
  ]
}