{
  "id": "twin_Sacamato",
  "username": "Sacamato",
  "activity_count": 1,
  "interests": [
    "that",
    "race",
    "half",
    "mile",
    "with"
  ],
  "post_times": [
    1746467019.0
  ],
  "history_sample": [
    {
      "id": "1kfhvd1",
      "title": "The Frederick Half Marathon: Let's actually train for a race and see what happens!",
      "selftext": "### Race Information\n* **Name:** Frederick Half Marathon\n* **Date:** May 4, 2025\n* **Distance:** 13.1 miles\n* **Location:** Frederick, MD\n* **Strava:** https://www.strava.com/activities/14374981308\n* **Time:** 1:29:03\n\n### Goals\n| Goal | Description | Completed? |\n|------|-------------|------------|\n| A | Sub 1:30 | *Yes* |\n| B | PR (<1:36:57) | *Yes* |\n\n### Splits\n| Mile | Time |\n|------|------|\n| 1 | 6:47\n| 2 | 6:48\n| 3 | 6:38\n| 4 | 6:53\n| 5 | 6:39\n| 6 | 6:53\n| 7 | 6:45\n| 8 | 6:54\n| 9 | 6:52\n| 10 | 6:46\n| 11 | 6:56\n| 12 | 6:49\n| 13 | 6:49\n| 13.1 | 0:29 (6:04)\n\n### The Why\n\nAfter an epic 2024, during which I ran almost every race distance imaginable between a beer mile and a couple 100 milers, and during which I set new PRs at the beer mile, 1 mile, 5k, 10k, [marathon](https://www.reddit.com/r/running/comments/1fcxyh3/the_lock_2_lock_marathon_what_happens_when_things/), 50 mile, 100k, and [100 mile](https://www.reddit.com/r/running/comments/1cg4exm/co_canal_100_miler_the_manidokan_factor/) (so, uh... most of the distances I raced), and after winning our running club's highly coveted (by me) Ironman award, I decided I needed a new goal for 2025. One of the distances that I had not set a new PR in during 2024 (because I set it in December 2023) was my half marathon.\n\nThe Frederick Half Marathon is in my hometown of Frederick, Maryland. Motto: Please don't move here, it's terrible (I love living here). I'd run the race itself 6 times prior to yesterday, and I regularly run almost every part of the course. While I am not a fan of the company that organizes the race, it's my hometown race, and I hadn't run it since 2019. It was my [first half marathon in 2012](https://www.reddit.com/r/running/comments/t9wdy/nut_job_5k_first_half_marathon_race_report/) (and my first race report!), so I thought it would be fun to go back and conquer the old stomping grounds.\n\n### Training\n\nSince I pay for Strava premium, I thought why not try out one of their coaching plans? Before their recent acquisition of Runna, Strava had (and may still have, for all I know) training plans based on McMillan's training plans. I entered some data: a recent race time (my December 2024 marathon PR of 3:24:23), my goal time for the half (1:29:59), and the date of my goal race (5/4/2025). Then it spit out a 10 week training program for me. This worked out well, because a local 50k that I like to do every year would be the Saturday before the training plan started, so I could focus on the 50k, then switch right over to half marathon training a few days later.\n\nPrior to this, I had not followed an actual training plan since 2015, and I had never followed a training plan that included speed work. The plans I followed always just had mileage. Which, for the ultra-heavy schedule I usually run, is probably fine. But if I wanted to shave 7 minutes off of what was already a pretty decent half PR for a 48 year old (1:36:57), I was going to need to do the tough stuff.\n\nI work with a personal trainer at the gym on Mondays and Wednesdays, and the plan had me doing workout runs on Tuesdays and Thursdays, with an easy run on Saturday, and a Sunday long run. Friday was a total rest day. I would sometimes add a short or medium run on Wednesday as well. I did all but 1 of the workouts, and pretty much nailed the rest. I used the Garmin app on my phone to build the workouts from the plan, and transferred the workouts to my watch, with all the intervals and a desired pace range built in. I think this was incredibly beneficial to my training. Sometimes it's more mental focus than physical ability that prevents me from holding a fast pace, and having my watch alert me if I got out of that pace range was a game-changer. Some might find that annoying, but it worked for me.\n\nI usually love to run all the races all the time, but during the 10 weeks of training, I only ran one race - a 10k on some very hilly terrain two weeks before my goal race. I ran that race at exactly the pace I needed to run the half, and felt like I still had something left at the end. This was a good sign. It was also nice to walk away from that 10k with 5th overall and 1st in my age group! So I thought I was ready.\n\n### Pre-race\n\nRight after Christmas, during which my family engorges ourselves for a 4 day bacchanal, I ran, without really trying, my 4th fastest half marathon ever, just as a training run on my own. I decided that I did so well because I had eaten so much fudge and cookies in the 4 days leading up to that run. To duplicate that Christmas indulgence, on May 1, I ate some leftover peanut butter fudge that I made for an aid station for the C&O 100 miler on April 26, then baked a batch of cookies on May 2, ate half the batch that day, and the other half on May 3. This was in addition to my regular, marginally more healthy, meals. Did I succeed in my goals in spite of, or because of, my carb loading strategy? Either way, I got to eat cookies and fudge.\n\nFor the record, I usually have a lot to drink at Christmas as well, and I abstained from alcohol entirely in the week leading up to this race. So I didn't follow along *exactly*.\n\nOn race morning, I had my usual breakfast, but added on a second cup of coffee and a donut. I arrived 1 hour early, as per usual, dropped off some stuff with the running club volunteers, went for a cursory 0.25 mile warm up, and got in the starting corral to talk with my friends and trade sandbagging lies. \"I'd be surprised if I can get under 1:30,\" said one friend, who went on to beat me by two minutes. I found out later that she's pregnant again.\n\nAnd then we were off.\n\n### Race\n\nI programmed the race into my watch as a workout - a single 13.1 mile interval with a goal pace between 6:37 and 6:50 per mile. 6:52 per mile is good enough to get under 1:30 for a half, but I wanted to build in a little wiggle room, in case the course ended up being long. I, of course, started off too fast (around 6:15), but with the watch pestering me, I quickly settled into my goal pace. I received no alerts about my pace after the first quarter mile. Once I dialed in, I was good.\n\nThe weather kind of sucked. It was a little chilly at the start, which would ordinarily be perfect, but it was very humid and spitting rain. I was soaked for most of the race, but didn't have any chafing problems. Over the years, I have learned how to avoid and manage most chafing issues before they become a serious problem. The temperature didn't really become a factor either. Maybe for a longer race, the humidity and warmth might have taken their toll, but this race was over quickly enough.\n\nI brought 3 Huma gels with me, and took them at miles 3, 7, and 10. I like Humas because I can eat them without needing to wash them down with any water. And this meant I wouldn't have to bring water with me. I've run a hundred miler with my handheld Nathan bottle, but at this quick pace, an extra pound on one arm and the sloshing water could have been really annoying. I did take water from every aid station and did my best to get the cups in the trash cans. I think I was about 50% on that. I was really proud of the fact that I didn't splash a single volunteer. The hand-offs were perfect. And that's a team effort. Thanks, volunteers!\n\nAround mile 8.5, I was thinking the pace was unsustainable, and that I wasn't going to be able to make my sub-1:30 goal. But just about at that moment, the 7 mile gel kicked in. It was the only one of the three that I actually felt, but I suspect that's because it was the only one that was caffeinated. I'm sure the other 2 had their benefits, but I actually felt that 7 mile gel.\n\nAt mile 10, I passed by the street that a friend of mine lives on. I had told her before the race that I would be passing by, and she could come out and cheer me. She asked what time, and I said 8:08. Damned if I didn't run right by her at 8:07:40. Probably my proudest accomplishment of the day.\n\nThe last 3 miles were just gutting it out. I kept looking at my watch, and saw the average pace tick down from 6:48 to 6:49. I did the math, and realized that gave me about 39 seconds of wiggle room, and I just needed to hold on going up the last hill. Once I was up the hill, it was just a little farther to the horse track. Yeah, the race ends on a horse track. No, it sucks to run on. Horses leave some pretty big holes in the ground as they go over it. Fortunately, because it was raining, the holes weren't that bad. But the track was soft and yielding. It was hard to build up a kick on that terrain. But I did, and finished in 1:29:03, slicing almost 8 minutes off a PR that I set less than a year and a half ago.\n\n### Post-race\nI had a mild case of exercise-induced asthma after I greeted my friends who were volunteering at the finish line, but that cleared up. That's a weird thing, and it's only the second time it's happened. I changed into dry clothes, rang the PR bell, and celebrated with my friends. A very nice surprise was that I got 3rd in my age group, which I have never done at a race this big! M45-49 is not an easy age group to place in.\n\n### The Takeaway\n\nThis was the first time I ran the Frederick Half since joining the Steeplechasers, the local running club, in 2019. In addition to the great benefits of being part of such a great running club, and having so many people to run with, it was really nice to be cheered on by different friends along the course. It felt like I had at least one or two people calling out my name every mile, and that really helped.\n\nI have been running since 2011, and I have been on a generally upward trajectory since then, although there have been ups, downs, and plateaus. But most of my improvement has come since joining the running club. I'm 48 years old and still setting PRs. There will come a time when I don't set any new PRs, but that time hasn't come yet!\n\nMade with a new [race report generator](http://sfdavis.com/racereports/) created by /u/herumph.",
      "author": "Sacamato",
      "created_utc": 1746467019.0,
      "score": 83,
      "num_comments": 11,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "tiktok",
    "instagram"
  ]
}