{
  "id": "twin_idwbas",
  "username": "idwbas",
  "activity_count": 2,
  "interests": [
    "race",
    "that",
    "this",
    "with",
    "miles"
  ],
  "post_times": [
    1748874393.0,
    1744573934.0
  ],
  "history_sample": [
    {
      "id": "1l1jevd",
      "title": "Race Report: Dexter-Ann Arbor Run (DXA2)",
      "selftext": "Race Report: Dexter-Ann Arbor Run (DXA2)\n\n### Race Information\n* **Name:** Dexter-Ann Arbor Run\n* **Date:** June 1, 2025\n* **Distance:** 6.2 miles (10K)\n* **Location:** Ann Arbor, MI\n* **Website:** https://dxa2.com/\n* **Time:** 42:19\n\n### Goals\n| Goal | Description | Completed? |\n|------|-------------|------------|\n| A | Sub-45 | *Yes* |\n| B | Top 5 Gender Finish | *Yes* |\n\n### Splits\n| Mile | Time |\n|------|------|\n| 1 | 6:45\n| 2 | 6:48\n| 3 | 6:56\n| 4 | 6:37\n| 5 | 6:44\n| 6 | 6:49\n| 0.2 | 1:45\n\n### Training\nI must admit, I’m guilty of being the half-marathoner who got a bit injured and switched to race the 10K a couple days pre-race. On Monday, my last strength session, I decided to do split squats after I hadn’t in months (why?) I thought I was keeping them light, but I wasn’t, and I tweaked my tibialis posterior when I overloaded my left leg. I thought it was fine…until Tuesday morning.\n\nI had a pretty bad posterior tibial strain six months ago post-marathon, so I had an idea of how severe my issue was this time around. It certainly wasn’t as bad, but the half marathon was not happening. So, 10K it is!\n\nTraining for this race was all half-marathon training since that was my original plan. My original goal was sub-1:45 for an April half marathon. I began training for this race in mid-February after running all easy + low-volume (0-20mpw) due to injury and illness for two months prior. (I used the elliptical to replace runs). I did Wednesday (total 11-12mi) and Saturday workouts (total 14-16mi) with longer intervals (1200m-2 miles) and easy 4mi runs or elliptical the other days of the week. I ran 30-45mpw. I got 01:37 on race day and I was thrilled.\n\n2 weeks after the April half, I went for a 5K PR (goal sub-22). I only did one workout for this race since it took awhile to recover from the half. I ran just under 20 on race day. For fun, I ran another half a week later and ran 01:46 with moderate effort. I fit a couple long run workouts in between that half and this past weekend’s race but mostly just tried to hold fitness. \n\n### Pre-race\nI had pre-race jitters, so I got 5 hours of sleep the night before. Woke up bright and early and did my 3mi warm-up run to the start line. I always find it hilarious how slow my pre-race warm ups are. Cannot figure out how I go from slogging it at 10min pace to 7min pace. Then, I people-watched at the start line for 10min before the gun went off. \n\n### Race\n\n**Mile 1-2:** I went out at just above my half-marathon RPE. Never truly raced a 10K before but assumed this would be an appropriate effort level. I was near the front of the pack, so we got in our groups of 3-4 pretty quickly and broke away from the rest of the racers so it felt pretty empty. \n\n**Mile 3-4:** I was mostly feeling fine and settled in and kept my RPE steady. I was super excited to start watching the elites double back, and it was honestly pretty fun to double back myself and have people cheering me on, especially all of the women who were cheering on the top ladies. I remember being amazed by watching the fastest women speed back on the loop when I ran this race 3 years ago, and now being one of those women was super cool.\n\n**Mile 5:** This was the start of the last third, and I was beginning to get cooked pretty fast. The nausea was here and I knew if I didn’t check myself I would indeed wreck myself. I slowed down a bit and felt better. \n\n**Mile 6-end:** I read on Reddit how it’s okay to go into the pain cave the last 1-2K of a 10K, so I figured it was okay to just die starting now. The 1.2 miles is one big uphill which is the worst race design ever but I full-sent it up the whole way and found that it was my heart, not my legs, that was holding me back. I heard a woman yell “42!” when I was a bit away from the finish so I knew I wasn’t making it sub-42 but I was happier it was over.\n\n### Post-race\nI walked back to my car with my family and we got halfway home (home is only 10 minutes drive) before I realized I had won a prize (3rd woman!) and we speed-walked back to the finish line tent and made it in time for the awards ceremony. I got my moment of local racer glory with my plaque and 50$ check 😂 and I’m still feeling pretty chuffed about that. So, although my half marathon plans got cancelled, I’m pretty happy. And…my tibialis posterior feels better after the race???",
      "author": "idwbas",
      "created_utc": 1748874393.0,
      "score": 29,
      "num_comments": 1,
      "subreddit": "running"
    },
    {
      "id": "1jygde7",
      "title": "Race Report - Fort Hill Brewery Half Marathon (Easthampton, MA)",
      "selftext": "# Race Information\n\n- **Name**: Fort Hill Brewery Half Marathon\n\n- **Date**: April 13, 2025\n\n- **Distance**: 13.1 miles\n\n- **Location**: Easthampton, MA\n\n- **Website**: [link](https://www.impactracingevents.com/fort-hill-brewery-half-marathon)\n\n- **Time**: 01:37:47\n\n\n# Goals\n\n| Goal | Description   | Achieved? |\n|:-----|--------------:|:---------:|\n| A    | PR (Sub-1:47) | Yes       |\n| B    | Sub-1:45      | YES!      |\n| C    | Sub 1:50      | Yes.      |\n\n# Splits\n\n| Mile  | Time |\n|:-----:|-----:|\n| 1     | 7:51 |\n| 2     | 7:36 |\n| 3     | 7:30 |\n| 4     | 7:26 |\n| 5     | 7:55 |\n| 6     | 7:16 |\n| 7     | 7:18 |\n| 8     | 7:23 |\n| 9     | 7:29 |\n| 10    | 7:08 |\n| 11    | 7:22 |\n| 12    | 7:05 |\n| 13    | 7:21 |\n| 0.1   | 0:41 |\n\n# Background\n\nI'm 23F. I started running in summer of 2021 and have taken it up as a serious hobby over the years. I ran my most recent half-marathon PR of 01:47 in October 2023 and had zero racing strategy for that one and just full-sent it the last 6 miles. I trained for my first marathon in summer of 2024 and ran 03:49:00 after a mostly-terrific training block where I was on target for 03:30:00 but had a total crash-out a month out (I had RED-S). Took off running from December-January 2025 due to shin splints + recovery but got back to it in February!\n\n# Training\n\nI didn't want to commit to a true training block for this race due to lingering uncertainties around my shin splints and because I was not mentally ready to lock in that much. I also really like lifting and wanted to keep it up 5x a week, which meant my running training wasn't as optimal as it could've been,  but I was happy. This was a typical week:\n\n| Day       | Workout                                              |\n|:----------|-----------------------------------------------------:|\n| Monday    | AM Lift + 4mi easy                                   |\n| Tuesday   | AM Lift + 4mi easy                                   |\n| Wednesday | 10–11mi with quality miles + PM Lift                 |\n| Thursday  | AM Lift + 4mi easy / elliptical                      |\n| Friday    | AM Lift + 4mi easy / 5–6mi tempo                     |\n| Saturday  | 14–16mi long run workout / easy if Friday tempo      |\n| Sunday    | 1 hr elliptical                                      |\n\nMy Wednesday runs were sometimes just steady + progression 5K at the end, or sometimes they were pyramid workouts, actual tempo runs in the middle, but whatever they were, they had some type of quality.\n\nMy LR workouts were my favorite. I didn't have a set structure to these either. All of them started with a mandatory 3mi WU and ended with a 1-2mi CD (as part of total mileage). They would often be 2mi@HM Pace repeats or 1mi@Bit Faster than HM Pace. Sometimes I would mix in HM Pace and Marathon pace, or 10K Pace for shorter intervals. Whatever the workout was, they were always intervals of some sort and I never did steady HM Pace for several miles. That wasn't intentional, but I guess it just wasn't what I was drawn to?\n\nThe flexibility of my 4x a week 4 mi easy runs was great. I never freaked out if I needed to change them to 45min ellipticals or if I had to shorten/skip them for whatever reason.\n\n# Pre-Race\n\nI took the bus to the neighboring town and then ran 1.5mi to the race start location as my warm-up shakeout. Unfortunately, I showed up 2 hours early, so I picked up my bib and then took a walk for an hour on the bike trail and tried to shake off some more anxiety. After milling around the parking lot another 20 minutes, I took off my sweatshirt and sweatpants and got ready to warm-up. I headed out for a 2mi warm-up, 1 mile slow and the other mile gradually speeding up and slowing down to my goal race effort. Things felt pretty normal. I still had more time to people watch after that haha. I lined up 10min from the scheduled start time and then I was off!\n\n# Race\n\nI envisioned being able to to give some detailed mile-by-mile breakdown when I wrote most of this report before my race, but alas, I was rather head-empty during the actual race.\n\nTrue to what other people had told me, this course was relatively flat. There was only one noticeable hill and besides that, just a lot of smaller ups and downs. I was told that there was a “beautiful downhill” from Miles 11-12 by a friend and they must have remembered wrong because there was no such downhill. Luckily, I was familiar with about 1/3 of the course as it was on familiar bike trails, so that gave me some comfort.\n\nI went into the race with the intention of racing by feel only. I ended up doing a mix of both, checking my watching about three times during the race to see if my perceived effort matched with my goal time. \n\nOriginally, as a racing strategy, I had the following plan:\n\n- Miles 0-4: Head out at 8:15-8:30 (comfortable work pace)\n\n- Miles 4-9: Get a little quicker every mile down to 7:45\n\n- Miles 9-13.1: Push each mile more and go all out near the end ranging from 7:30-7:00\n\nAs my times show, I ended up racing pretty steady instead. That’s not surprising considering that I am a consistent, steady runner and person in general. Not sure why I thought racing this race would be different haha, and it turned out not to be!\n\nAs I got to mile 4 and remembered my plan to pick up the pace, I checked in with myself about my RPE and decided to stay steady with the effort level I had and I’m glad I did. That is why I am very glad I train largely by feel, so that I could adjust my plan during the race based on how my body was feeling. \n\nThe race itself wasn’t super big so the whole way, I was running by myself with maybe a person/two people in view running ahead. It was enough to have people to pass but not too many to feel super crowded. Not going to lie there was a 15 year old boy who was with me the first 10K and I was not about to be overtaken by him😂  I passed him at mile 7 and never looked back. \n\nAnother thing that kept me going was “She’s flyin’!” that was uttered by one of the volunteers as I passed by the aid station at mile 9.\n\nI was not feeling fabulous in the last 5K but I knew from race videos of pros that I had watched that that was okay and I should still be able to hold out, so I didn't freak out. It helped being able to know how to feel at different parts of the race so I knew I wasn't pushing too hard/too little. I looked down at my watch after I passed the 12.5 mile marker to see if I had made it under 1:45 and when I saw 1:36:xx I freaked out with joy and that was the last push I needed to get over the finish.\n\n# Post-Race\n\nSo proud of this result! This was my first race where I went in with the intention of being serious about pushing my pace and giving it my all. I knew I could get the sub-1:45 if I didn't give up, as I had gotten a 1:44 on my flat training run a couple weeks before. And I was shocked that I rolled in under 1:40, too! This training block was DEFINITELY not everything I envisioned (had to juggle illness, school and job-interviewing stress) but I got my workouts in and I did it! After my marathon debacle, I felt like I lost confidence in my ability to run fast, but this block and race showed me that I still have it and I WILL achieve a goal so long as I tell myself I will. It was also great to see that I don't have to be on some big official plan to reach my goals and I can make running work for me. Now....onto my sub-22:00 5K in a couple weeks! Not as attached to that goal as this was my big one, but it'd be another thing off my list!",
      "author": "idwbas",
      "created_utc": 1744573934.0,
      "score": 11,
      "num_comments": 8,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.98,
  "channels": [
    "twitter",
    "reddit"
  ]
}