{
  "id": "twin_Educational_Word_647",
  "username": "Educational_Word_647",
  "activity_count": 1,
  "interests": [
    "that",
    "with",
    "mile",
    "this",
    "group"
  ],
  "post_times": [
    1742351041.0
  ],
  "history_sample": [
    {
      "id": "1jemsye",
      "title": "Los Angeles Marathon Race Report - Going from Obese to Running A Marathon",
      "selftext": "### Race Information\n* **Name:** Los Angeles Marathon\n* **Date:** March 16, 2025\n* **Distance:** 26.2 miles\n* **Location:** Los Angeles, CA\n* **Time:** 4:57:13\n* **Strava:** https://www.strava.com/athletes/9352796\n\n\n### Goals\n| Goal | Description | Completed? |\n|------|-------------|------------|\n| A | Complete Marathon? | *Yes* |\n| B | Sub 5 | *Yes* |\n| C | Sub 4:48 | *No* |\n\n### Splits\n| Mile | Time |\n|------|------|\n| 1 | 11:10\n| 2 | 10:12\n| 3 | 10:14\n| 4 | 10:16\n| 5 | 11:06\n| 6 | 11:22\n| 7 | 10:26\n| 8 | 10:37\n| 9 | 10:55\n| 10 | 10:27\n| 11 | 10:41\n| 12 | 10:43\n| 13 | 11:10\n| 14 | 11:35\n| 15 | 11:01\n| 16 | 11:12\n| 17 | 12:11\n| 18 | 11:32\n| 19 | 11:47\n| 20 | 11:41\n| 21 | 12:19\n| 22 | 12:36\n| 23 | 11:52\n| 24 | 11:47\n| 25 | 11:20\n| 26 | 11:53\n| 27 | 5:10\n\n### Training\nI (29M) ran the LA Big 5K last year (day before the marathon). At the time I weighed 250 pounds, and my 5K time was 46:31. I had done cross country in high school, and after the 5K I felt jealous of seeing people picking up their bibs for the LA Marathon. At that time I made two goals: 1) that I wanted to beat my 5K time from high school (27:44), and 2) I wanted to run a marathon. Initially I did run for the rest of that first week in March 2024, and then it basically dropped off. \n\nAround July, I remembered my goals and decided to join the LA Running Club (LARC). I went to one of their track nights and struggled through it. Later that week I went to one of their Saturday runs. I started out with a run-walk group where they’d run two minutes and walk one minute. I found this to be a good group for me, where it was a moderate workout, with the walks being welcome breaks. The group I was running with was great, and the people were as nice as could be. They gave me so much advice and so many pointers. Before joining I had so much apprehension about being judged for being overweight and slow, but this group of folks put that all to rest. At this point the first milestone for me came: the Santa Monica Classic 10K. I ran the race in 1:18:11 (12:59 pace, since it was actually about 6 miles only). After completing this race I finally made the plunge and registered for the LA Marathon (LAM) as well as LA Road Runners (LARR).\n\nThe training plan that LARR uses has the long runs on Saturdays and slowly works its way up from 2 miles till 20 miles, with some taper weeks thrown in about once a month. Here, I started out with the Run Walk 4/1 group, with a projected 5:30 finish time. About a month later (October 2024) during one of the taper weeks I moved up to the 5 hour groups which was an all run group. That month I also ran a half marathon: Malibu Moves. Before the half, my longest run was 7 miles, so I was worried about the half. I had made the goal of doing 2:33 or less (this was an hour less than my college time for a half). I ended up running 2:32:29, so just barely made my goal.\n\nI kept training with LARR (albeit I did a lot of long runs on my own in November/December just because of travel/going home for the holidays). I kept up with the training schedule for the most part (except for a stray week here and there around November). I kept participating in races: 5Ks, 10Ks, trail runs, half marathons, and my weight kept going down. I was happy to see my speed progressively get faster. Around January I was hit with two roadblocks: 1) I got COVID which stopped me from training for about a week, and 2) the wildfires here in LA. I hate running on the treadmill, so I ended up taking another week or so off from running. When things finally started back up in mid-January, I struggled to run our 13 mile workout in 2:42. At this point I was feeling pretty dejected, I had been continually improving and had hoped for sub 4:30, but that was seeming to be more out of grasp.\n\nAfter a few intense weeks of high mileage and getting back on track, I finally came to terms that a better goal for myself would be sub 5. I made peace with that decision, and told myself that improvements happen slowly and to be happy with all that I had already accomplished. I continued training with the 5 hour group. I did the 15 miler with them, and maybe trailed one minute behind. I did an 18 miler with them a few weeks later, and ended up trailing behind by about 10 minutes. I took a long look at the run that day to see what went wrong. The next week for the 20 miler I made a number of changes: found a different gel brand, packed salt tablets, drank more water at stations, didn’t wear a long sleeve shirt. The 20 miler went as well as I could’ve hoped, I kept up with the group the entire time, and in the final mile I sped up to the 4:50 group. \n\nWith all of this, I decided that I’d run the marathon with the 4:50 group. Since I have a tendency to positive split/trail behind the group, this would give me some leeway to keep it under 5. Two weeks before the marathon I ran in the Screenland 5K and got a time of 25:47, this was one goal I was able to scratch off from my two goals.\n\n\n### Pre-race\nThe night before the race I went to bed at 6:30 pm and planned to wake up around 2:30 am. In reality I only ended sleeping from 8:15 pm till 11:15 pm. Pre-race jitters and excitement got the best of me. I spent the early morning hours thinking about my previous running journey. Finally around 3:15 am I headed over to the finish line, parked the car and took the shuttle at 3:50 to Dodgers Stadium. We got to Dodgers around 4:20, and I went inside the stadium where the rest of the LARR folk hang out. The first hour or so was pretty mellow, just waiting around. At around 5 a lot of my friends started to show up and I started to get a lot more energy/excitement in me for the race. At 5:50 I forced myself to go the bathroom just so I wouldn’t have to during the race. I drank two Electrolit bottles and ate one banana. I didn’t bring anything to gear check/didn’t have a phone so I had nothing to fuss with. The next five hours were just going to be me and my senses. Getting into the corral was a nightmare, our pace group went to get in around 6:20 (with corrals supposedly closing at 6:30). It was as if we were getting onto a lifeboat off the Titanic, there was so much pushing and shoving. Even as the corral security was saying that they’d let people in till 6:50 and there was no need to hurry, people were still pushing a ton. Once I got in the corral everything was pretty peaceful, and I took off my pre-race clothes that I was going to donate.\n\n### Race\nThe start of the race was much more crowded than I expected. Our group (4:50) started in Corral E, which is the last of the seeded corrals. Right at the start we have a slight uphill, and I could see the pace leader start to drift off. I found myself doing a good chunk of weaving just to keep up, and I looked at my watch and noticed the pace was 12:30, which was a far cry from the 11:04 we were supposed to be doing. I told myself I needed to stop weaving and not be worried about the time, we had 26 miles to make up any lost time and I needed to conserve my energy. Once we got out of Dodgers stadium and down the hill it started to thin out a bit. The first 4 miles I was keeping up with the group but my heart rate (HR) was higher than I wanted in the 160s. At the mile 2 mark they have the first water station, and that was my first taste of really struggling with the traffic of so many people trying to get water and stopping. I took one cup, and half went on my shirt, a quarter on my face, and the other quarter cup actually made it in my mouth. We reached the first big uphill at about mile 4.5. There are drum players who are playing up that hill, and it was something I was looking forward to. Unfortunately, we were also greeted with the people yelling at us to convert to Christianity and telling us that all runners go to hell if they do not accept Jesus and repent our sins. Aside from that, going up the hill I began to trail from the group, but I usually like taking hills slower and I told myself I’d catch up with the group on the flats/downhills. After the first 6 miles, I did finally get into a groove with the more flat stretch. My heart came down to the 150-155 range, and I was doing generally well. I had gotten a hang of going to the water station and grabbing two cups. I had also come to a natural ebb and flow with the group, where I wouldn’t always be strictly with the group, but I would catch up to them every couple of miles or so.\n\nThe group was running in the 10’s to 11’s for the first 16 miles or so (our half marathon time was 2:22), and at this point I was thinking maybe I should try to push for sub 4:40. Around mile 17 I noticed the pace leader slowed down to about 13-14 minute pace, and initially I slowed down with her. I did the math in my head, and calculated that I’d need to do roughly 12/mile to get to sub 5. I decided to speed up ahead of the group to 11:30 or so pace. My thinking was maybe the pace leader is doing an easy mile, but if I slow down, I’ll just stay slow for the rest, so it’s best for me to keep chugging along. About ten minutes later, I turned around to see where the group was, but they were out of sight. At this point I realized that I had to set the timing myself. \n\nAt the mile 18 mark, true hell began. At this point I was beginning to feel exhausted. I knew that this commenced a 4 mile out and back, and I was just wishing it was just 4 and done. I saw my parents around mile 19 and this gave me a well needed boost. Once mile 20 arrived I was feeling okay too, but once we made the right turn off Santa Monica Blvd onto Sepulveda (maybe mile 20.5) I began to really hate it. Maybe it’s the fact that that street was pretty desolate or that the sun was beaming down. I could feel so much sweat on my face. I was drinking water and electrolytes (I got lucky someone handed me a bottle of Electrolit, thank you kind stranger). For a short moment I began to feel dizzy. I wanted to walk so badly, and I asked myself if this was what it meant to hit the wall. I saw a bunch of people around me stop running and start walking. I told myself, to just keep running no matter how slow. I was worried if I started walking, I would never start running again.  Finally at mile 21 I just told myself, I need to put up with one more hour of hell and I can walk away with no regrets and feel accomplished.\n\nAt mile 22 I saw the LARC tent and they gave me some ice (which helped cool me down), and it was a humongous boost to see some familiar faces, and one of my running friends ran with me for a few minutes. Once I hit the turn around at mile 23, I did the math that I needed to punch in roughly 12:30 splits to get to my goal. I was feeling confident at this point and I knew that I just needed to continue. At around 24.5 or so we turn back onto Santa Monica Blvd. I passed the 25 mile mark, and I saw that my time was 4:42 or so. I had 18 minutes to complete 1.2 miles, I knew that barring something going wrong I would do it. That last mile went so slowly, I literally just counted the minutes. The crowd was really closed in on the streets, there was only space for people to run 2-3 wide. Though it was annoying to weave through runners at this point, I did appreciate having the crowd and the energy (as opposed to the empty previous stretched). Once I hit mile 26 I saw that I would make my goal, even if I walked the rest. I decided I would sprint the last 0.2 miles, and focused on crossing the finish line with a smile (and not touching the stop button on my watch in the finishing pics). In that final stretch my family was there cheering me on, something I barely noticed since I had basically tuned everything out. I turned around and waved at them, and kept charging on.\n\n\n### Post-race\nOnce I crossed the finish line, all I wanted to do was sit. I expected that I’d have a bigger feeling of accomplishment, this was a goal I had for a year now, and something I had worked so hard for. But when the moment came, I was just like “okay it’s done.” I went to the medical tent real quick to grab a bandaid (as my nipple began to bleeding around mile 13). I basically limped around the entire secure zone (which was easily a half a mile long). I finally met up with my family and friends in the mall, took photos with them, and subsequently got lunch with them.  I am happy to say I achieved both of my goals, and lost 80 pounds in the process. \n\nAs I reflected on the marathon, a few things I thought of:\n- I am struck by the compassion of others. I have never been to an LA Marathon as a spectator, despite living here for three years. Seeing all the spectators with signs, and the spectators handing out fruits, water, sodas — I am truly amazed. Even if I never run a marathon again, I will go every year to help support others. I could not have done this without the help from the people who came out. The random person who gave me a water bottle at mile 18 and an Electrolit at mile 20 truly saved me.\n\n- LA Marathon really needs to change the out and back stretch, it is by far the worst part. It’s as if they did not think of runners at all when making this change. I am not saying it needs to end in Santa Monica — they could elongate the course at some other point to make up those miles without having us go out and back in what is easily the most boring part of the course.\n\n- Finally, I achieved my goals and now I am not sure what to do. I know that next year I want to run a sub 4, but it is weird that the marathon is over. It is something that has been on my mind for months and occupied so much of my brain space. For me this was such a milestone accomplishment and it is bittersweet that it is over. I am happy that I accomplished what I set out to, but I am sad that the experience has come to an end. Though sub 4 would be an accomplishment of its own, I don’t think it will be the same milestone as this first marathon was for me.\n\nThank you to all the folks who read the post, my apologies it was so long.\n\nTLDR: I ran a marathon, met my goal, lost 80 pounds along the way, made friends, and was amazed by the compassion of others.\n\n\nMade with a new [race report generator](http://sfdavis.com/racereports/) created by /u/herumph.",
      "author": "Educational_Word_647",
      "created_utc": 1742351041.0,
      "score": 191,
      "num_comments": 12,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "youtube"
  ]
}