{
  "id": "twin_mosaiccbrokenhearts",
  "username": "mosaiccbrokenhearts",
  "activity_count": 1,
  "interests": [
    "with",
    "marathon",
    "that",
    "felt",
    "from"
  ],
  "post_times": [
    1745999281.0
  ],
  "history_sample": [
    {
      "id": "1kbaxp6",
      "title": "Race report: Manchester, UK - first marathon and sub-4",
      "selftext": "### Race Information\n* **Name:** Manchester Marathon\n* **Date:** April 27, 2025\n* **Distance:** 26.2 miles\n* **Location:** Manchester, United Kingdom\n* **Time:** 3:59:XX\n\n### Goals\n| Goal | Description | Completed? |\n|------|-------------|------------|\n| A | 3:55 | *No* |\n| B | Sub 4 | *Yes* |\n| C | Enjoy and finish | *Yes* |\n\n### Splits\n| Kilometer | Time |\n|------|------|\n| 1 | 5:49\n| 2 | 5:42\n| 3 | 5:38\n| 4 | 5:43\n| 5 | 5:36\n| 6 | 5:36\n| 7 | 5:33\n| 8 | 5:37\n| 9 | 5:32\n| 10 | 5:30\n| 11 | 5:29\n| 12 | 5:31\n| 13 | 5:34\n| 14 | 5:40\n| 15 | 5:36\n| 16 | 5:37\n| 17 | 5:35\n| 18 | 5:36\n| 19 | 5:33\n| 20 | 5:36\n| 21 | 5:40\n| 22 | 5:31\n| 23 | 5:36\n| 24 | 5:33\n| 25 | 5:38\n| 26 | 5:33\n| 27 | 5:37\n| 28 | 5:29\n| 29 | 5:38\n| 30 | 5:39\n| 31 | 5:35\n| 32 | 5:33\n| 33 | 5:34\n| 34 | 5:45\n| 35 | 5:39\n| 36 | 5:40\n| 37 | 5:41\n| 38 | 6:00\n| 39 | 6:17\n| 40 | 6:01\n| 41 | 5:44\n| 42 | 5:30\n| 43 | 4:38\n\n### About me\nI'm 29F and one of the many people that picked up running during covid lockdowns but it was never anything very long or intense. I did my first half marathon 3 years ago and have done 4 halfs in total now. I started doing long gentle runs beyond the half marathon distance at the end of 2023. I enjoyed these and found them a fun and relaxing weekend activity, which made me think I could try a marathon one day, hence signing up for Manchester the following year.\n\n### Training\nI followed the Pfitz 18/55 plan for this marathon. In spring 2024 I worked up to a base of around 60-70km per week, all mostly gentle steady runs. I was hoping to work on this more and increase mileage/add some speed workouts but sadly got ill with a never ending chest infection over summer and did zero to minimal running for over 3 months. Picked it back up around September 2024 to run a half marathon in October after which I built my base back up to 60-70ish km a week to get ready for the marathon training block. \n\nI personally loved the structure of Pfitz and enjoyed knowing exactly what to do on each run. I would say the ramp up was intense and in retrospect I could've prepped better with higher base mileage. I flirted with some overuse injuries (plantar fasciitis, shin and knee niggles) but got to the physio quickly when these cropped up and started a strength routine. This seemed to help, but most of my other hobbies fell to the wayside in between all of the running, strength and stretching to be honest.\n\nI did almost all of the mileage in the plan, barring half a week out with a cold, but not quite all of the intensity due to the aforementioned niggles. I didn’t love the VO2 max work at the end, it made me a bit nervy and worried that I’d get injured from pushing the faster speeds, whether from tripping or pulling a muscle. \n\nNevertheless I felt well prepared and the most running-fit that I have ever been. I got an unofficial, just on my watch rather than raced, 10k (46 mins) and 5k (22mins) pb during the plan as part of the workout runs. Marathon pace long runs all went well. I considered going for a more ambitious first marathon goal, maybe 3:52 or even 3:50 but very glad I didn't in the end. \n\n### Pre-race\nI started my carb load on the Thursday and tried to get in 8 grams carbs per kg body weight over 3 days. SIS carb drinks helped massively with this. \n\nI sadly fell and bashed my knee on the stairs at home on the Thursday. It swelled up, was not too painful to move but quite sore to touch. Panic ensued. The physio was not keen to say either way whether I should do the race, but confirmed it didn't seem too serious. As it didn't hurt too much while moving/walking (1-2 out of 10) the night before the race, I decided to run. Thankfully it is not any worse post-race.\n\nWent up to Manchester from London on the Saturday. Chomped on some bagels on the train, had pasta for lunch and pasta for dinner.\n\nPfitz had me down to run Thursday and do a shake-out on Saturday - I skipped both of these in favour of resting the bruised knee. \n\nAnxiety and nerves meant my resting heart rate was very high on the day pre-race and I felt wired so I decided to take some melatonin to sleep the night before the race. Fell asleep quickly but still woke up at 2am feeling nervous. Managed to fall asleep again at some point and woke up at 6:15.\n\nPre-race I had my usual porridge and a coffee. Kind friends that I was staying with dropped me and my partner off a few mins walk from the pre-race area at Old Trafford. Went straight to queue for a portaloo which took upwards of 40 minutes. \n\nThis is when I knew it was going to be a tough day as I started to feel very warm in the sun, even just from standing around in the queue for the loos. The cloud cover I'd hoped for was nowhere in sight. I really don’t enjoy hot weather, even when I’m not running a marathon! I told my partner then that I was going to sack off 3:55 and aim for just sub-4 instead, I think adjusting hopes/expectations early was a good call for me.  \n\n### Race\n\nI felt good easing into the run and not going out too fast with the adrenaline and excitement. Luckily where I was in the corral (grey wave) it didn't feel like other people were going out super fast either, which helped. I also hadn’t run since the Wednesday and didn’t even do a warm up so that might’ve kept me slower at the start too. I didn't see a single pacer from where I was though so knew that I'd be pacing myself through it. \n\nI had a minor stitch from around 2k in until somewhere between 5 and 10k, this stressed me out because I worried it was there to stay for the whole run but I breathed through it and eventually it went away. Had my first gel around 5k, after the first water stop along with a salt stick chew. I should, in retrospect, maybe have had more to drink at the 5 and 10k water stops. I just had a few sips at those as the worry about the stitch was still in the back of my mind. At 10k I was already feeling very hot. \n\n10k to half marathon all felt okay, but not as amazing as I hoped to feel post-taper. My training runs with marathon pace were slightly quicker and also felt easier than race day despite being with fatigued legs, I think it was mainly from, again, just being so so hot, but I also wonder if I over or under-tapered? After 10k I started carrying the water with me and drinking the whole entire bottle between water stops. \n\nThe hill at Altrincham a bit before the halfway point was nothing too scary and I managed to keep good pace. The support around there was amazing and a massive boost.\n\nHalf marathon to around 30k is a bit of a blur, I feel like nothing of note happened in this bit, either good or bad - just tried to keep a steadyish pace, kept running and tried to not think too much about how hot I was feeling. \n\nI really should’ve poured some water on myself to keep the body temp down but I tried once down my front but my suncream ran into my eyes and impacted my vision. I couldn’t wet my back as my phone was in the back pocket of my vest and I was worried about it breaking - something I’ll bear in mind and avoid for any hot races in the future.\n\n32k mark I still felt pretty good and was quite buoyed at the thought of just over 10k to go. But then I had my sixth (and what ended up being my final) gel around 34k which I really struggled to keep down. From that point onwards it was survival mode - the nausea, the heat, the extreme thirst all caught up with me. Seeing a discarded half-drunk lucozade on the floor and thinking that it looked quite tempting was a bit of a low point. A kind spectator giving out ice to runners was a high point. And so, I kept running. \n\nAt 38k things got particularly hard. I thought that telling myself 'just a park run to go' would be a comforting thought, but sadly (on this occasion) it was not! I was probably checking my watch far too often around here and the distance seemed to be ticking by excruciatingly slowly. I would feel like I must've run close to a km but when I checked my watch it had only been 300 metres or so. \n\nThe next 3 splits (38,39,40km) were considerably slower than all the rest at 6mins+ per km. I felt sub-4 slipping away from me and honestly was happy to give up on the goal and just focus on getting over the finish line. I knew I had a bit of buffer but as my watch was about 300-400m ahead of the course markers I wasn't sure how big the buffer was - my brain was not able to do the maths with everything else going on. I was wondering if this was The Wall: my legs felt like they couldn't move faster, my stomach was sloshing horribly from all the water, I was fighting extreme nausea, my body felt like it was on fire and all my mental energy was going towards not stopping. \n\nBUT, I had something of a mini second wind. Realising I had 2km or so to go felt much more bearable mentally and I suddenly felt like I could pick up the pace again, joy! Taller buildings providing some shade in the city centre also helped, some of the promised cloud cover also appeared and took the edge off the heat. I got back to goal pace (or close enough) for the last 2k, and finished in what felt like a sprint (in reality it was more like tempo run pace) down the finishing straight with about 40 seconds to spare.\n\n### Post-race\nFelt pretty emotional to finish, it was physically and mentally tough in that final stretch of 5k or so. I wanted to cry but was too dehydrated. And I sadly threw up quite soon after as all the water I'd consumed just didn't feel great in my stomach. My left calf cramped up not far from the finish line (after the water and protein bars but before the alcohol free beer). I’d never experienced cramp before so that was a bit scary but sitting and stretching eased it.\n\nManaged to have some water, ribena and crisps in the city centre. Headed back to the friends I was staying with to have a glorious shower, then back into the city centre for a Mc Donalds and the slog back to London. Was extremely tired but the post-run endorphins were great and I was buzzing.\n\nI know this result is nothing crazy, but I'm so happy to have finished in one piece. I still have an appetite and enthusiasm to keep running, train more and to do another full marathon sometime in the not so distant future (i.e. maybe next year) - I consider that a win for my first foray into this distance! \n\nApols for the length and thanks for reading!\n\nMade with a new [race report generator](http://sfdavis.com/racereports/) created by /u/herumph.",
      "author": "mosaiccbrokenhearts",
      "created_utc": 1745999281.0,
      "score": 81,
      "num_comments": 15,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "twitter",
    "reddit"
  ]
}