{
  "id": "twin_Hopeful_Stay_5276",
  "username": "Hopeful_Stay_5276",
  "activity_count": 1,
  "interests": [
    "with",
    "were",
    "race",
    "that",
    "peru"
  ],
  "post_times": [
    1748731220.0
  ],
  "history_sample": [
    {
      "id": "1l09nn8",
      "title": "Ultra Cataratas, Amazonas, Peru",
      "selftext": "Ultra Catarata, Amazonas, Peru\n\n### Race Information\n* **Name:** Ultra Cataratas (Waterfalls Ultra), Peru\n* **Date:** 31 May 2025\n* **Distance:** 25km\n* **Location:** Suyubamba, Amazonas, Peru\n* **Website:** https://ultratayta.com/\n* **Time:** 5:28:17\n\n### Goals\n| Goal | Description | Completed? |\n|------|-------------|------------|\n| A | Finish within cutoff | *Yes* |\n| B | Just Finish | *Yes* |\n| C | SURVIVE! | *Yes* |\n\n### Splits\n| Kilometer | Time |\n|------|------|\n| 1 | 7:25\n| 2 | 9:17\n| 3 | 7:35\n| 4 | 6:28\n| 5 | 10:07\n| 6 | 10:00\n| 7 | 14:08\n| 8 | 22:13\n| 9 | 14:34\n| 10 | 18:15\n| 11 | 10:44\n| 12 | 19:20\n| 13 | 15:28\n| 14 | 19:44\n| 15 | 13:05\n| 16 | 12:38\n| 17 | 12:08\n| 18 | 11:35\n| 19 | 9:49\n| 20 | 9:50\n| 21 | 7:29\n| 22 | 9:29\n| 23 | 25:21\n| 24 | 16:37\n| 25 | 14:25\n\n### Training\nHaving initially entered the 50km version of this event, I began training by building distance up from prior marathon training.\n\nSadly, where I live is both flat and at sea level, so not the greatest training for an ultramarathon through the edges of the Amazon Rainforest in the middle of the Andes. But it had to do.\n\nWorst still, I picked up a bad ankle injury thanks to a few selfish path users. This put paid to the idea of completing 50km, so I dropped to what was officially 22km.\n\n### Pre-race\nHaving arrived by overnight bus (15 hours!) from a Peruvian coastal city, I rested up in the Andean city of Chachapoyas (altitude 2,300m above sea level) and performed a few acclimatisation runs in the local area, before moving base to the town of Pedro Ruiz Gallo - within a tuk-tuk ride of the start line.\n\nThe people running the hotel were incredible. They went out of their way to get me to the kit collection the day before the race and the start line on the day of the race itself. They even waited for me and gave me a lift back to the hotel post-event, then prepared a special lunch for us all to share!\n\n### Race\nArriving in the very small town of Suyubamba, the  Peruvians were already in full party mood at 0630. We lined up and, surprisingly for Peru, actually start bang on time at 0700!\n\nThe first part of the race was along a gravel track with some minor undulations. Due to the training problems, I had already decided I was walking up all uphill sections and going steady on flats and downhills, but by the end of the track I had identified a big issue...\n\nThe track eventually became a trail, narrow in places but with almost non-stop climbing! Through farmland, mountainous trails and jungle we just kept climbing! I remember looking at my watch and wondering how the hell we were still climbing after 14km! I kept thinking \"it must go downhill soon!\" but was always surprised. In the end, we climbed over 1,200m.\n\nThe route involved 2 river crossing whilst climbing uphill, and took in 3 large waterfalls - including crossing the pool at the bottom of one and then not being able to get uphill through a small muddy section that followed!\n\nEventually we summited, and started our downhill descent on a wide but unpaved track. My legs were utterly shot, however, so the running was a little sporadic.\n\nWith just over 4km to go we went through the village of Cuispis and I finally felt like I might be able to run consistently - only to be met by 2km of a steep downhill trail section that was purely calf-deep mud. It was like ice! It's the wet season here now and that trail was determined to show it. The butterflies in this section were plentiful and stunning, but I could barely look at them as I was too busy trying to very slowly place my feet on the very few rocks that I could find within this quagmire.\n\nThe path levelled out with only a few hundred metres to go, and I was welcomed back to civilisation by the National Police, who were concerned about how many people were still out on a very tough course. I had to tell them not to take their motorbike up the section I had just come down as it would end up buried!\n\nA couple of turns later on the paved main road through the Amazon and I arrived back into Suyubamba to be greeted by a roaring cheer from all the other finishers and the finish line itself.\n\n### Post-race\nImmediately after crossing the line I fell to my knees with exhaustion - the terrain had taken its toll and was harsher than I had imagined it would be. The hotel owners rushed over, gave me my medal and a drink, and then I was mobbed by local Peruvian women all wanting a photo with the gringo (I was 1 of 4, but didn't know the others before the kit collection). That last part is fairly commonplace here - but they never send me the pics!\n\nThere was a little shop/stall selling banana cake and electrolyte drinks, which both went down a treat. The family that runs the hotel then gave me a ride back, kindly preparing a delicious lunch of beef, rice and yellow potatoes, with cooked bananas for desert and freshly picked tea, whilst we watched the Champions League final together.\n\n\nMade with a new [race report generator](http://sfdavis.com/racereports/) created by /u/herumph",
      "author": "Hopeful_Stay_5276",
      "created_utc": 1748731220.0,
      "score": 8,
      "num_comments": 6,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "youtube"
  ]
}