{
  "id": "twin_SaurumanTheSilly",
  "username": "SaurumanTheSilly",
  "activity_count": 1,
  "interests": [
    "training",
    "some",
    "race",
    "miles",
    "time"
  ],
  "post_times": [
    1758402579.0
  ],
  "history_sample": [
    {
      "id": "1nm9nxz",
      "title": "Spooky Sprint 2025: The Mystery of having Preemie Twins.",
      "selftext": "\n(I tried to make the title sound like a Scooby Doo episode… I’m sorry)\n\n### Race Information\n* **Name:** Spooky Sprint 2025\n* **Date:** September 20 205\n* **Distance:** 13.1 Miles\n* **Location:** Wichita, KS\n* **Time:** 2:03:32\n\n### Goals\n| Goal | Description | Completed? |\n|------|-------------|------------|\n| A | Sub 2 | *No* |\n| B | Sub 2:05 | *Yes* |\n| C | Finish | *Yes* |\n\n### Splits\n| Mile | Time |\n|------|------|\n| 1 | 9:06\n| 2 | 8:59\n| 3 | 8:58\n| 4 | 8:56\n| 5 | 8:58\n| 6 | 9:02\n| 7 | 9:06\n| 8 | 9:07\n| 9 | 9:10\n| 10 | 9:16\n| 11 | 10:08\n| 12 | 9:59\n| 13 | 11:44\n| 14 | 0:51\n\n### Training\nMy [M33] training began somewhat around 13 months ago. I had not run more than maybe 1.5 miles since I graduated college. I decided I needed to get healthy and began running and taking my diet more seriously. I was briefly interrupted due to having my tonsils removed but kept going after. \n\nMy more structured training began 26 weeks before the race. I used Runna as I do well with structured training plans like that. I know it isn’t the best training plan or generator but I really felt myself progressing each week.\n\nThen came the major interruption to training. My wife and I welcomed our twins 6 weeks early and had a 2 week NICU stay. On top of that we faced some major colic and digestive issues once we finally got them home. I was not able to run for almost 10 weeks straight. \n\nAround 10 weeks before the race I finally got back to being able to run. I restarted my plan and prayed for the best. It was a rough 10 weeks but we made it. All in all, I lost around 45 pounds through training. 65 over all since I started running. \n\n### Pre-race\nPre-Race was pretty much the same as pre long run. Toast with some peanut butter(I usually have jelly.), a granola bar and some electrolytes. It was a rainy morning but luckily was down to a drizzle by the time I was leaving. \n\n### Race\nThe course was a double out and back. That made it a little bit hard to estimate other runners as I wasn’t sure if they were shooting for a 10K or half. I felt decent to start despite getting some lack luster sleep. \n\nThe first time out was pretty good. There were some really slick spots from the rain. Both myself and some other runners almost fell a few times. By the time I was heading back at around 5 miles the humidity was getting to me. I was sweating much harder than normal. \n\nBetween miles 9 and 10 I really hit a wall. I had to stop and walk for a second for the first time. I was starting to get pretty achey and felt like my right leg was cramping. As I got to about 1.5 miles left my right calf was really cramping. Walks became more common. As soon as I realized I wouldn’t hit sub 2 hours I was pretty bummed but I knew I could still hit a PR. \n\nThe twins greeted me at the finish line which really helped!\n\n### Post-race\nMy legs were toasted. I cramped hard as hell as I waited to grab my medal and see where I placed in my age group. I crushed some chocolate milk they had.\n\nNow I’m gonna crush a pint of Ben and Jerry’s tonight. \n\n\nMade with a new [race report generator](http://sfdavis.com/racereports/) created by /u/herumph.",
      "author": "SaurumanTheSilly",
      "created_utc": 1758402579.0,
      "score": 14,
      "num_comments": 5,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "tiktok",
    "instagram"
  ]
}