{
  "id": "twin_MarathonAccount",
  "username": "MarathonAccount",
  "activity_count": 1,
  "interests": [
    "race",
    "marathon",
    "through",
    "training",
    "plan"
  ],
  "post_times": [
    1741949127.0
  ],
  "history_sample": [
    {
      "id": "1jb10ag",
      "title": "Coast Guard Marathon - Race Report",
      "selftext": "### Race Information\n* **Name:** Coast Guard Marathon \n* **Date:** March 9, 2025\n* **Distance:** 26.2 miles\n* **Location:** Elizabeth City, NC\n* **Website:** https://coastguardmarathon.com/\n* **Time:** 2:46:58\n\n### Goals\n| Goal | Description | Completed? |\n|------|-------------|------------|\n| A | Sub 2:50:00 | *Yes* |\n| B | Don't bonk | *Yes* |\n\n### 3 Mile Splits\n| Mile | Average Time |\n|------|------|\n| 3 | 6:15\n| 6 | 6:23\n| 9 | 6:29\n| 12 | 6:26\n| 15 | 6:18\n| 18 | 6:25\n| 21 | 6:21\n| 24 | 6:24\n| 26.2 | 6:09\n\n### I (29m) grew up a runner, cross country and track through highschool. I slowly got back into running in graduate school. I raced a few trail runs, and one ½ marathon in 2021. I ran my first marthon in August, 2024. I didn't use a training plan for my first marathon, I just went on feel, my local group long runs and group track days. For this marathon I trained using Hal Higdon's book and his Advanced 1 and 2 training plans. The HH plan was a lot more intense than my \"feeling\" plan, but I didn't feel too over exerted. I did recouporate from a touch of the tendonitis and a winter cold midway through the training plan. Nothing too detrimental. One oversight I made when signing up for this March race was all the training takes place in November, December, January, and February! And it was a cold, and snowy winter in Michigan! I am excited for my upcoming fall marathon!\n\n\n\n### Pre-race went smoothly, Elizabeth City and the race in general is small. Quick parking, race prep, bathroom! The CG band played the national anthem, and a CG helicopter flew over right before the starting bell rang!\n\n\n\n### The race went off without a hitch! friendly spectators and volunteers on the road, front porches, and at the water stations. After about 5 miles you enter the CG base, we run down a long, straight, and flat runway, with C-130 airplanes, helicopters, fire engines, and cheering Coast Guardsmen. 26.2 runners exit the rear of the CG base and run through neighborhoods, farm roads, around a WWII era blimp hanger,  then back through the CG base. The course finishes through the streets of Elizabeth City and along the water. At the finish line a Coasty give your your medal.\n\n\n\n### All in all, the race was well organized. There was plenty of water, nutrition, volunteers, staff and law enforcement. The post race and finish line area had food trucks, face painting, and inflatable play areas for kids, it was a very happy and enjoyable environment.\n\n\n\n### I recommend the event to anyone who wants a very flat, small race. Bonus points if you geek out about aircraft, or fast boats!\n\n\n\n### I'm happy with how I performed, and how the race unfolded.\n\n\n\n\nMade with a new [race report generator](http://sfdavis.com/racereports/) created by /u/herumph.",
      "author": "MarathonAccount",
      "created_utc": 1741949127.0,
      "score": 16,
      "num_comments": 0,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "instagram",
    "youtube"
  ]
}