{
  "id": "twin_No_Significance571",
  "username": "No_Significance571",
  "activity_count": 1,
  "interests": [
    "marathon",
    "with",
    "that",
    "training",
    "race"
  ],
  "post_times": [
    1745017091.0
  ],
  "history_sample": [
    {
      "id": "1k2i2wf",
      "title": "Race Report: Zurich Marathon – Sub 3 in my First Marathon",
      "selftext": "**Race Information**\n\n* **Name**: Ochnser Sport Zürich Marathon ([Website](https://www.zuerichmarathon.ch/?gad_source=1&gbraid=0AAAAAo5XxveISCsoSJ3srZ7z8CACtoc0T&gclid=EAIaIQobChMI6Zjt7q_hjAMVx5SDBx0_bzOuEAAYASAAEgK6xPD_BwE))\n* **Date**: 13 April 2025\n* **Weather**: 12°C (54 °F), cloudy with light drizzle\n* **Chip time**: 02:57:24\n\n**Background**\n\n* **Age:** 27 years\n* **Weight**: 60 kg (132 pounds)\n* **Height**: 175 cm (5' 9'')\n* **Race Shoe**: Saucony Endorphin Pro 4\n\nI ran casually throughout my teens but never trained consistently or in a structured way. When I finished my studies in August 2023, I decided to commit to running properly. Already then, I had in mind to eventually run a marathon, but wanted to do a half marathon first to figure out whether I enjoyed the process. I ended up running a 01:32:12 at the Zurich Half Marathon in April 2024. Finishing feeling like I still had something in the tank, I got hooked – and immediately registered for the the Zurich Marathon in April 2025.\n\n**Preparation**  \nTraining officially kicked off in mid-October after a summer spent mostly on the road bike. The first month was all about rebuilding my running base with lots of easy Zone 2 miles.\n\nThe \"proper\" training started with 21 weeks to go. I used a training plan out of the book *Science of Running* ([link](https://www.amazon.com/Science-Running-Technique-Revolutionize-Training/dp/1465489576)). The plan itself was quite standard with three main sessions per week: one interval, one tempo, one long run. I filled the days between those sessions with Zone 2 runs. Thus, I ran 4 to 5 times in most weeks with an average weekly mileage of 61 km (38 mi) and a peak of 85 km (53 mi).\n\nOriginally, based on my half marathon time, I aimed for a 3:20:00 marathon. But my Garmin race predictor kept trending lower, eventually dipping under 3 hours. Well knowing this is more of a guesstimate than an exact science, it still got me thinking. Eight weeks out, I decided to pivot toward sub-3 training, adjusting the training paces accordingly. To get a second opinion on the feasibility of this goal, I also started using ChatGPT in a very similar manner as suggested by another user on r/Marathon_Training in a recent post ([link](https://www.reddit.com/r/Marathon_Training/s/EORfOfPHji)).\n\n**Taper**  \nMy two-week taper was tough. I felt gassed out the first  week. Anxious I would not be fully recovered by race day, I decided to only do two runs. In the last week before the race, I felt slow, heavy, and sluggish during every run. My confidence took a big hit – I was doubtful whether the taper was actually working and my goal remained feasible.\n\nCarb loading in particular was challenging. I started out three days before the race with the goal of getting in 10-12 g carbs/kg. Next to rice, pasta, and potatoes, I relied on sports drinks, gels, smoothies, juice, soda pops, rice cakes. Eating that much just contributed to the general feeling of sluggishness. In hindsight, I should have taken in more carbs through drinks instead of solid food.\n\n**Pre-race**  \nThe night before the race was rough: I managed to fall asleep at 11:30 pm and got up at 05:00 am to have some pasta and a sports beverage for breakfast. I arrived at the start line at 07:00 am. At 07:30 am, I took one last gel and a caffeine shot of 200mg. At 08:00 am, I was ready at the start line.\n\n**Race**  \nMy race plan was to run a negative split using Garmin’s PacePro: starting at 4:24 min/km (7:05 min/mi) and finishing around 4:01 min/km (6:28 min/mi). I intentionally started behind the 3:00 pacer for space — hoping to reel them in later.\n\nThe **first few kilometres** went smoothly, although my right tibialis was cranky early on. Luckily, it settled down once I got into rhythm. My heart rate was high from the start (caffeine + adrenaline), but it dropped slightly later even as I sped up.\n\nThe **first half** flew by. Between managing pace, weaving through groups, and executing my fueling plan, I stayed busy. Nutrition-wise, I stuck to one cup (200-250 ml) of the sports beverage offered at the overall 12 aid stations. In doing so, I could make sure I got in the recommended 1-1.5 g carbs/kg/h and hydrate at the same time, without having to take a gel AND water at every station. I had already practiced similar carb intakes during my training, where I once had also hit the wall – so I knew what I had to avoid at all costs.\n\nAt **28 km** (17 mi), things started to bite. I could still hold my paces, but my quads started hurting. When I passed **30 km** (18.6 mi), holding my pace targets became difficult and I slowly started eating into the buffer I had built. With **35 km** (21.7 mi) to go, it became a mental game. The kilometres seemed to tick down slower and I felt that the paces I wanted to hit were just a tit out of reach. Therefore, I started to be unsure about my goal time. To aid with the discomfort in my quads, I took a caffeinated gel at an aid station.\n\nIn my head though, I started to visualise how crossing the finish line would feel like – just how I had done many times before during training. I told myself that I had come so far, had dedicated so much time and effort to this goal, that I would not just relinquish. I focused on keeping the pace I was at, without trying to think too much about the planned paces – in the end, I was not that far off. Around this point, I also caught up with the 3h pacer, which gave me a boost, just as coming back into the city with the crowd cheering – including my girlfriend and mom.\n\nWhen I reached **38 km** (23.6 mi), I knew that sub 3 would be possible. For the final kilometres, I ran by feeling, just trying to push as much as was still possible. When I crossed the finish line, I could not believe what had just happened: in the end, six months of training came down to not even 3 hours.\n\n**Aftermath**  \nThe moment I stopped running, my legs were jelly. I managed to find my mom and girlfriend before sitting down – a wise move, because after that, I physically couldn’t get up without help!\n\nAfter getting home, taking a hot bath and applying some cooling gel, things were already going better. However, for the rest of the day as well as the next, I could only go down stairs backwards. I felt like I was 80 years old, having to hold onto things to get up and get down. Recovery went fairly well tough, and by the third day, I could already run a little bit to at least catch the bus.\n\n**Final thoughts**  \nI am really happy I could follow through with my training and the race itself, especially without injuries. Pushing for sub 3 in my first marathon definitely was not the smartest move: apart from the lack of experience of what it is actually like to pace and race a marathon, adapting my training plan that far into the block should, by itself, be a no-no. In addition, my weekly mileage was on the lower end of what one would expect for such a goal time.\n\nThat being said, I am still glad I pushed myself to go for it. In the end, this is exactly what fascinates me about endurance sports: pushing yourself over the limits you thought you were bound by. I feel like there is not much that I left on track, and this is exactly how I wanted to finish my marathon. I am absolutely certain that this will not have been my last, and I am already eyeing one next year.",
      "author": "No_Significance571",
      "created_utc": 1745017091.0,
      "score": 59,
      "num_comments": 6,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "youtube"
  ]
}