{
  "id": "twin_barn-whiskey",
  "username": "barn-whiskey",
  "activity_count": 1,
  "interests": [
    "that",
    "this",
    "just",
    "like",
    "trail"
  ],
  "post_times": [
    1744086031.0
  ],
  "history_sample": [
    {
      "id": "1ju53gv",
      "title": "Diablo 50K (April 5, 2025) - My First Long Trail Run, Race Recap",
      "selftext": "**Before the Race**\n\nHaving done numerous half marathons over the years - both road and trail - I started to lose interest in the road ones. Trails were different. The scenery changed, the climbs made you earn the views, and the people felt like my kind of people: offbeat, friendly, quick to chat on the uphills, supportive without making a big deal of it. Trail runners, in their quiet weirdness, made the miles go by easier.\n\nEach year, I trained hard through the late spring, summer, and fall. But once winter hit, I always backed off -January to April became my off-season. And for the last three years, like clockwork, I would see races pop up in March and April that I wanted to do. Races that sparked something. But I'd always say, 'Next year.'\n\nBecause I wasn't in race shape. Because I hadn't trained enough. Because work was busy. Always a reason.\n\nThis year was no different - at least, at first. I'd been logging 8 to 12 treadmill miles a week, just enough to stay lightly active but nowhere near race-ready. Then, about three weeks before race day, I saw it again: the Diablo Trails Challenge 50K. The race I always wanted to do. The one I always told myself I'd be ready for 'next year.' Despite best intentions, life (and work) didn't give me space for a structured training block. Still, I kept wondering: Could I do this anyway? Even untrained? Just to see what I had in me?\n\nAs race day got closer, my thoughts bounced between:\n\n\\- I really want to do this.\n\n\\- I've passed on it for years - what if next year I have a kid, get injured, get sick? There might never be a perfect time.\n\n\\- But I'm dead after a 30K when I'm trained. How can I possibly finish a 50K like this?\n\n\\- What if I get hurt? What if I have to pull out mid-race? What if I wreck myself and can't work next week?\n\nThat back-and-forth continued right up until the night before. Finally, after some intense internal dialogue and a whole lot of pacing in my kitchen, I signed up. I figured if I finished, great. If I didn't, I'd at least find out where my limit was. But I didn't want to spend another year watching this race pass by and wondering what if.\n\n**Race Morning**\n\nAfter a last-minute dash to stock up on electrolytes and trail snacks, check my gear, and hunt down clean running clothes, I received one final curveball: an email from the race organizers. 'Expect to run through 12 creeks in the first 3 miles,' it said. Great. Nothing like a surprise foot soak to kick off the day.\n\nI barely slept the night before. My brain was on a loop: Am I making a huge mistake? Will I even make it back home tonight? What if I fall and get hurt? What if I emotionally wreck myself by dropping out early? I'd never even run a flat marathon. And here I was, about to attempt a 50K with massive elevation.\n\nI decided to lean fully into ignorance. Just get to the start line, stand at the back, and go. That was the whole plan. No expectations. No pressure.\n\nRemember the game plan, I told myself:\n\n\\- Start slow - slower than slow.\n\n\\- Don't get pulled into half marathon mode.\n\n\\- Don't let the start-line energy trick you into chasing people.\n\n\\- You're not racing anyone. You're here to finish.\n\nThe gun went off. Everyone took off down the trail, charging ahead. I started running... and found myself dead last. Perfect.\n\n**The First 10 Miles**\n\nThe first 10 miles were surprisingly okay. I'd run these trails before during the half marathon, so I knew what was coming - at least in theory. I kept my heart rate under 150, walked the uphills like I promised myself I would, and made sure to take in plenty of fluids. Around mile 3, I started snacking - nothing fancy, just easing my stomach into the routine.\n\nEverything still felt under control. My heart rate was steady, the slow pace was working, and the snacks were going down well. I started to think: This might be okay. Maybe I can actually do this. Maybe all this talk about undertraining was just noise. The gear, the food, the heart rate - it was all working.\n\nPoor fool. I had no idea what was coming.\n\n**Miles 10-13: The Slide into Curry Canyon**\n\nAround mile 10, the course veered off the main trail onto an out-and-back stretch down Curry Canyon Road. I'd seen this turn on the map beforehand and didn't give it much thought. The view of Mt. Diablo loomed ahead - the main assault on that monster was coming soon, and I felt strangely confident.\n\nAs I made the turn onto the Curry Canyon spur, I passed a steady stream of runners emerging from it, and thought, Okay, I'm not that far behind everyone. I'm still in the mix.\n\nThen the downhill started. Steep. Long. And it kept going. And going. And going. 1.5 miles of downhill, one direction - and somewhere around the halfway point, the creeping realization hit: I have to climb all the way back up this before I even start climbing Diablo.\n\nA knot formed in my chest. I was in the shit now.\n\nThis was the first moment when my spirit really began to waver. The sun was out now and starting to cook the trail, the shade becoming patchy and unreliable. I tried to play music - a playlist I'd made just for this moment - hoping to lift my mood and distract myself from the climb. But like always, music jacked my heart rate up 15-20 BPM. I couldn't afford that kind of spike. I ditched the plan and climbed in silence.\n\nWhen I finally emerged from Curry Canyon and rejoined the main trail, I felt... nervous. Half a mile later, I passed the turnoff point for the half marathon - a turn I knew well from past races. I glanced down at my Garmin. 13 miles done. A half marathon. And yet I hadn't even begun the true climb.\n\nMt. Diablo still lay ahead, and with it, 19 more miles and thousands of feet of climbing.\n\nI stood there in the heat, legs already aching, and thought: Can I really continue? My own ego, my own hubris, has landed me here... and now the climb begins.\n\n**The Climb to the Summit**\n\nAt the aid station, I refilled my hydration pack, dumped in the last of my electrolytes, and inhaled a Clif bar.\n\nTime to fill the tank - I knew what was ahead. Having fueled up, I felt a bit better. Regained my composure. This is no time to give into doubt and fear, my man, I told myself.\n\nI'd done this climb before. I knew what was coming.\n\nAs I started moving again, I pulled out a peanut butter pouch - thinking it'd be a nice protein hit. Big mistake. It was like inhaling dry insulation or powdered glue. The label said \"dry roasted peanut butter with palm oil\" and it lived up to every word. It took three huge gulps of water just to choke down the first bite. Rookie mistake.\n\nThe climb was long. Grinding. But... not as bad as I feared. I think those hours on the stairmaster actually paid off. I kept it slow and steady, heart rate low, and focused on the views: green hills, wildflowers, the sweep of the East Bay softened by spring. I reminded myself how lucky I was to be out here at all - uninjured, healthy, and able to attempt something like this.\n\nIt was hot, but not scorching. The miles ticked by, and somehow, I arrived - weary but in good spirits - at the summit aid station. A volunteer gave me an ice-water sponge bath over my head and shoulders, and it was glorious.\n\nMy legs were tired, but not wrecked. The worst is over, I thought. Maybe I can actually do this.\n\nOne of the volunteers smiled and said, \"You've made it up - now you just need to go down.\" And I thought: He's right. I made it up here. I can make it down. Yes!\n\nThe real hell was about to start.\n\nIf I knew what was coming, I never would have signed up for this.\n\n**North Peak - The Breaking Point**\n\nFrom the summit of Mt. Diablo, the trail dropped into a long, 3-mile downhill stretch. The breeze cooled me down, the path was runnable, and for the first time all day, I truly believed everything is going to be okay.\n\nSure, I still had 13 miles to go - a full half marathon - but it was mostly downhill or flat. I told myself I could hike the descents, jog the flats, and cruise into the finish. A quiet confidence settled in.\n\nThat all ended - fast.\n\nThe climb to North Peak is only 0.7 miles. But the final section is a soul-crushing, spirit-destroying monster - a 16% grade trail covered in loose rock, gravel, and what might as well be marbles.\n\nAs I started the climb, my legs were already shredded. Every step felt like I was dragging dead weight uphill. I was stunned that the course would include something this steep, this poorly maintained, this late in the race.\n\nGoing up the trail, I saw another runner inching downward, sitting on the ground, using her hands and feet to brace herself. She was stuck - too afraid to move.\n\nAnother woman passed me in tears, trying to keep moving but barely holding it together. And that's when the anger set in.\n\nI questioned everything. Why would they put this in the race? If I'm going to get hurt, it'll be here. I can't break bones - I have work on Monday. What are they thinking?\n\nMy mind screamed: \"This risk isn't worth it. This is just some dumb Saturday race - turn around. Go no further.\"\n\nI stood there, exhausted, furious, watching the trail get steeper ahead. For the first time, I genuinely wondered if I should quit.\n\n**The Mind Split**\n\nAt a certain point in races like this, I know I can't trust my mind. My rational, risk-averse subconscious - the version of me that keeps me safe in everyday life - starts to creep in and take over.\n\nThe longer a run drags on, the harder it becomes, the more it turns into a battle between two voices:\n\n\\- The ambitious one - the version of me that signed up, full of hope and excitement, asking \"What if?\"\n\n\\- And the other one - the safety-first, back-out-now voice that just wants this to end.\n\nBy the time I was partway up North Peak, that battle was at 50/50. Fear and exhaustion were gaining the upper hand.\n\nFor a moment, a thought crossed my mind: If I turn around right now... would anyone even know? There's probably no one up top checking. I could just turn around. Keep running. Say I made it. Get my finish.\n\nI indulged it, briefly. But then another voice shot through: Is that who I am? Is that how I want to remember this race? A cheat? A fraud?\n\nThat would be far worse than not finishing.\n\nThat realization made me furious - at myself, for even thinking it. And with that fire, I kept climbing. Fueled by anger now, not fear.\n\nWhen I finally reached the top, my legs were screaming. My back throbbed. My sunburn was flaring to life and stinging badly.\n\nAnd there it was - a roll of stickers, left by the race organizers to prove you'd made it. I peeled one off and stuck it proudly to my bib. Yes. I was here. I made it.\n\nGoing down, I remembered a trick that I had read in some old SAS outdoor survival book which I read 20 years ago: Never look at the whole slope. Just focus on your next two or three steps.\n\nSo that's what I did - picking out solid rocks as anchor points, ignoring the loose gravel ocean around me.\n\nOne careful step after another, eyes low, moving through the fear. Eventually, I reached the bottom. I was back on the trail. The worst was over. Surely, I thought, it's gotta be smooth sailing from here to the finish.\n\n**Miles 20-23: The Grind to Juniper**\n\nThe run to the Juniper aid station was only about 4 miles, but it felt like double that. The trail narrowed into rocky, technical singletrack. It was slow going - picking through stones, taking large, uneven steps up and down, carefully moving around clusters of day hikers.\n\nAt this point, I was longing for the wide-open, gently sloping curves of the foothills. I just wanted space. Predictable terrain. Something soft underfoot.\n\nInstead, I got bees.\n\nOut of nowhere, I stumbled into a hive. A few of them followed me for five minutes as I trotted away - thankfully, they weren't aggressive. But I was rattled.\n\nThe real scare came just after that. The singletrack ended abruptly at a fire road, where the trail made a hard left. In front of me - directly in front - was a sheer drop-off into a canyon. My legs hesitated, slow to respond. I stood there staring down into the void, unable to stop completely, feeling gravity pull me forward. Thankfully, they responded in time. I veered left. Still on my feet.\n\nAnd just like that - I was back on a wide road again. It felt like bliss.\n\nBut the final stretch to Juniper dragged on. The terrain wasn't too hard, but my legs were wrecked. Even on flats, I couldn't push past a 16-minute mile. Everything hurt. Every step was a test of patience.\n\nWhen I finally arrived at the Juniper aid station, at mile 23, I seriously considered calling it. I could call my wife. Get picked up. Be in an air-conditioned car in 20 minutes. End this now. This was my mental low point.\n\nBut instead of quitting, I walked over and refilled my fluids. A volunteer handed me an ice-cold sponge and doused my head and shoulders. The water hit like magic - an electric jolt of relief. For a moment, I felt human again.\n\nJust four more miles to the next aid station. I could do that.\n\n**Miles 23-32: The Long Road Home**\n\nIt was somewhere on Burma Road that I passed the 26-mile mark and realized: I'd just completed  a marathon. Technically, my first.\n\nAbout 10% of my mind took a flicker of pride in that. A marathon, without much - or any - real training, and on hills like these? That's something.\n\nBut the other 90% of me didn't care at all. Because the task at hand was far from over.\n\nI had long since run out of food. My electrolytes were gone. Each sip of water felt like it was diluting whatever salt I had left in my system. My legs were pounded to pulp, and the sunburn made the straps of my hydration vest feel like sandpaper. I could feel the blisters blooming on both big toes - I tried to ignore them.\n\nMy legs cramped up regularly now, seizing without warning. I had two salt tabs left and was saving them like lifeboats for the next serious climb. No matter how much water I drank, I still felt dry. I started to worry - Am I doing damage? Are my kidneys okay? Did I overdo the electrolytes earlier?\n\nThe views were astonishing - majestic green hills, storybook trails weaving into the horizon. At one point, I stumbled upon a small pond in the middle of nowhere, inexplicably full of goldfish. It was beautiful. It was surreal. I wished I could appreciate it more than I did.\n\nAt the final aid station, I picked up a packet of applesauce. It was, hands down, the best thing I had ever eaten in my life.\n\nThe last 4 miles retraced the trail we'd taken earlier in the day. I knew what was coming. I knew I could do it. But I also wondered when - or if - my body might just give out. The same trails I'd climbed easily that morning now looked enormous. Every step down jarred my legs. I clung to trees, to rocks, to the trail itself when I had to take a big step. Cramping flared at the slightest shift in terrain.\n\nBut then... the final two miles. Mostly flat. Rolling. Manageable. I started to believe, really believe, that I would finish.\n\nHalf a mile from the line, I walked - just to buy myself enough in the tank to 'run' the last stretch.\n\nAnd then I saw them - my wife, the race organizer, a few strangers cheering from the finish. And in that moment, I snapped back. I actually did this. I'm not injured. I'm here. I finished.\n\nIt didn't feel triumphant. It felt peaceful. Real. Grounded in the kind of pride that no medal can give you - the kind you earn one broken step at a time.\n\nAnd none of it would've been possible without my wife - for encouraging me to sign up, for believing I could do it when I wasn't sure myself, for being there at the end. I never would've finished without her love and support.\n\nMy final time was a little over 9 hours, a number that means everything and nothing all at once. It wasn't about speed, it was about getting through it. And I did.",
      "author": "barn-whiskey",
      "created_utc": 1744086031.0,
      "score": 39,
      "num_comments": 6,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "tiktok",
    "instagram"
  ]
}