{
  "id": "twin_Plane_Box122",
  "username": "Plane_Box122",
  "activity_count": 3,
  "interests": [
    "running",
    "runs",
    "with",
    "your",
    "love"
  ],
  "post_times": [
    1757314835.0,
    1753406823.0,
    1752045034.0
  ],
  "history_sample": [
    {
      "id": "1nbgun0",
      "title": "Do late-night runs mess with your recovery?",
      "selftext": "Because of my work schedule, I sometimes don’t get out for a run until 9 or 10pm. I actually love the quiet streets and cooler weather, but I’ve noticed I have a harder time falling asleep afterward. It makes me wonder if those late runs are helping or hurting in the long run. Do any of you run late at night, and if so, how do you manage recovery and sleep?",
      "author": "Plane_Box122",
      "created_utc": 1757314835.0,
      "score": 173,
      "num_comments": 78,
      "subreddit": "running"
    },
    {
      "id": "1m8m8i9",
      "title": "Do you ever feel like your why for running shifts over time?",
      "selftext": "Been running consistently for 6+ years now , everything from 5Ks to marathons and lately I’ve noticed my relationship with running changing.  Just curious for those of you who’ve been running a while:  \nHas your *why* evolved too? What keeps you lacing up these days? Would love to hear different perspectives from newer and long-time runners alike.",
      "author": "Plane_Box122",
      "created_utc": 1753406823.0,
      "score": 180,
      "num_comments": 159,
      "subreddit": "running"
    },
    {
      "id": "1lvccl4",
      "title": "How Do You Fall in Love with Running Again?",
      "selftext": "Hey everyone,  \nAfter running consistently for the past few years, I hit a wall earlier this year. I was mentally and physically drained, and what used to bring me joy started feeling like a chore. I decided to take a break, thinking it’d be just a couple of weeksbut that turned into months. Now I’m finally ready to lace up again, but I feel a bit lost. My pace is slower, endurance is down, and honestly, I’m a little nervous to jump back in. I don’t want to fall into the same trap again.\n\nFor those of you who’ve experienced burnout I wanna know how did you reset your mindset? Any routines or fun running goals that helped you reignite the spark? Would you recommend starting with group runs, trail runs, or just solo easy miles? Thanks in advance!",
      "author": "Plane_Box122",
      "created_utc": 1752045034.0,
      "score": 371,
      "num_comments": 219,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.97,
  "channels": [
    "youtube"
  ]
}