{
  "id": "twin_mrschmax74",
  "username": "mrschmax74",
  "activity_count": 1,
  "interests": [
    "race",
    "with",
    "half",
    "training",
    "that"
  ],
  "post_times": [
    1744031299.0
  ],
  "history_sample": [
    {
      "id": "1jtku0x",
      "title": "Berlin Half Marathon Race Report",
      "selftext": "# Race Information\n\n* **Name:** Berlin Half Marathon\n* **Date:** April 6, 2025\n* **Distance:** 13.1 miles\n* **Location:** Berlin, Germany\n* **Time:** 1:43:21\n\n# Goals\n\n\n\n|Goal|Description|Completed?|\n|:-|:-|:-|\n||\n|A|Sub 1:40|*No*|\n|B|Sub 1:42|*No*|\n|C|PB (old PB 1:44:16)|*Yes*|\n\n# \n\nSplits\n\n|KM|Time|\n|:-|:-|\n||\n|5|00:24:53|\n|10|00:49:14|\n|15|01:13:34|\n|21.1|01:43:21|\n\n\n\n# Training\n\nI started training for this race in the middle of December last year after finishing a 5k race plan. I've been using Runna for all my training plans for the past few years.\n\nI signed up for the Berlin Half marathon around 11 months ago, setting my sights on a SuperHalfs medal after finishing London Marathon last year. Runna predicted I'd be able to complete the Berlin Half between 01:37 and 01:41 with a goal km split of 4:40.\n\nI hit the required splits pretty much consistently across all my training runs, barring two key long runs at race pace where I wasn't able to hit 4:40 pace (both runs had two 6k blocks with easy miles in between). One of those was on a particularly windy day on vacation where my selected route was also hillier that I anticipated, the other I attributed to old running shoes but I could also be distracting myself from the fact that maybe I wasn't fit enough.\n\nI'm pretty familiar with Runna and the programs it offers so there was nothing out of the ordinary/nothing I wasn't used to. I did four runs a week and had their strength training built into my running plan as well. Mileage peaked at around 60km across several of the weeks in the plan.\n\nI generally slept pretty well over the course of the training block, with the exception of a couple days before race day due to travel to Berlin.\n\n# Pre-race\n\nI started getting a bit nervous about race day on the day I went to the expo (Friday), but I was able to keep the nerves at bay somewhat over the course of Friday by doing some sightseeing and seeing some friends who lived in Berlin. We went to an improv show in the evening, which basically quelled my nerves for the next couple of days. Saturday was also a pretty nerve-free day, again doing some sightseeing to pass the time and take my mind off things. \n\nI started to get nervous on race morning, which I know is normal, but the nerves were caused by my Garmin morning report (something I've heard many people say to avoid but it can be quite hard to ignore). I felt pretty fresh, despite not sleeping well the night before. The reason for the poorer sleep was more due to eating a bit too much for dinner rather than nerves. I was mindful of ensuring I was eating enough,  but wasn't as dialled in with carb loading as I was when I did the marathon. \n\nI had a hard time eating breakfast at the hotel, sticking to things like bread and eggs. Again, not something I had planned, was just basing my food choices off of things I know go down well as well as seeing what other people were eating (there were a lot of half marathon runners at the hotel I was staying in).\n\n# Race\n\nI have been guilty of being far too fixated on an A goal in the past and spent a lot of time before the race hashing out B and C goals. I really wanted a sub-1:40 but I needed to understand that it's not the end of the world as sometimes race day conditions don't always go in your favour and neither does training. \n\nWith that being said, it was a very cold morning (about 4 degrees, with a RealFeel of 0 degrees). I didn't pack a warmer back up outfit and I think I could've done with a longer and more thorough warm up as well. Because it was so cold, I had a hard time trying to control my breathing for the first 2-3km and get comfortable with the task at hand. \n\nI got quite frustrated for the first 10km as there were quite a few people who started before me who were running considerably slower than me. This was the one thing about the race I didn't like, but I did make up about a 1000 places over the course of the race. Participants were asked about their personal bests (I inputted mine as my previous PB), rather than expected finishing times, before the race so I'm wondering if people were inputting times they didn't achieve recently. This combined with the very cold start did throw me off a bit during this portion of the race. \n\nAs the race went on and struggling to hit the splits provided by Garmin PacePro (I set a pretty conservative negative split), I reminded myself how important it is to be able to race as well as get to the start line. I think my fuelling strategy worked (SIS Beta at 30 and 1:30 mark, with a SIS Beta Nootropics at the hour mark) as that helped me tick over and did get a nice little boost for a bit when I took the nootropics gel. It was also around this point that I spotted my friends around Potsdamer Platz and got a nice boost of energy. \n\nEven if I couldn't keep up with the PacePro splits, I was able to maintain a strong pace and didn't fall off in the second half and finished with negative splits. I also felt more comfortable in the second half of the course as the roads were much wider and open compared to the first half. \n\n# Post-race and Reflections\n\nAfter crossing the finish line, I collected my medal and looked forward to a shower and a free Erdinger afterwards. I've never been to a race that had showers in the finishers' area, which was very welcome even if the hot water wasn't working. \n\nI achieved my C goal and I'm still really happy with how the race went despite the conditions as I ran a negative split and finished the race strong. The result I achieved meant that I finished outside the predicted finishing time given to me by Runna, but I do wonder how much would've changed had the weather been more favourable. Looking at runs from last year and 2023, it looks as though the weather can alter between quite cold and quite warm year to year. I did also mention having a pretty big dinner the night before the race, but I and my legs did not in any way feel sluggish because of this. On the other hand, the splits I hit in key long runs in training plans for a half or full marathon before race day are usually a strong indicator of how I finish on race day (even if a training run is a month or more away from race day). \n\nIt's a really great course with loads of long straights to help hit your stride and the finish at the Brandenburg Gate is pretty special (must feel even better during the marathon!), even if the first half can feel congested due to the narrower roads.\n\nIn hindsight, I think I need to prepare myself better for conditions that aren't in my favour as trying to power through rather than adapt could've also hampered me slightly.\n\nI've got a couple of halves in October, but wondering if I can have another crack at the sub 1:40 before then. ",
      "author": "mrschmax74",
      "created_utc": 1744031299.0,
      "score": 38,
      "num_comments": 10,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "twitter",
    "reddit"
  ]
}