{
  "id": "twin_AtomicRambo47",
  "username": "AtomicRambo47",
  "activity_count": 1,
  "interests": [
    "this",
    "have",
    "i’ve",
    "issue",
    "help"
  ],
  "post_times": [
    1751019479.0
  ],
  "history_sample": [
    {
      "id": "1llqb4m",
      "title": "Unique case of runners toe.. help!",
      "selftext": "Hello, I’m relatively new to running, but my big toe nails, specifically ONLY on the INNER side of the big toe nail (next to 2nd toe) are getting purple and very painful. I’d estimate about 1/3 of the nail is turning purple, area closest to 2nd toe. It happens on both feet.\n\nI’ve been trying to solve this issue for months and can’t find any discussions of someone having this specific issue. I’ve tried 3 different sizes of shoes, tons of socks, but it’ll still happen even after a 5-6 mile run. I have other foot issues too like blisters but recently found some relief from Balega Blister resist. Thicker sock seems to help way better than the thin feetures. I’ve also tried different shoe brands and Hokas have been the best, although I’m open to trying something new again if needed.\n\nI tried the heel lock method but that made my heel hurt because it was so tight. I am almost 100% confident this issue is not caused by my toes hitting the front of the shoe because otherwise it would be the whole nail, or at least the front. Anybody have a clue what’s going on? I keep my toe nails very trim, and I don’t have this issue on any other toes whatsoever.\n\nI’ve been contemplating trying the silicon toe caps. Would this have something to do with insoles? Why is this happening only after a few miles? It’s stopping me from progressing in distance. I’d upload a photo but it doesn’t let me… Any help of feedback is appreciated, thank you!",
      "author": "AtomicRambo47",
      "created_utc": 1751019479.0,
      "score": 4,
      "num_comments": 48,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "tiktok",
    "instagram"
  ]
}