{
  "id": "twin_PlayerNumber21",
  "username": "PlayerNumber21",
  "activity_count": 1,
  "interests": [
    "this",
    "that",
    "marathon",
    "with",
    "race"
  ],
  "post_times": [
    1747220764.0
  ],
  "history_sample": [
    {
      "id": "1kmcddz",
      "title": "Race Report - Rob Burrow Leeds Marathon 2025 (Sub-3 Attempt)",
      "selftext": "# Race Information\n\n* **Name:** Rob Burrow Leeds Marathon\n* **Date:** May 11, 2025\n* **Distance:** 26.2 miles\n* **Location:** Leeds, United Kingdom\n* **Website:** [https://www.runforall.com/events/marathon/leeds-marathon/](https://www.runforall.com/events/marathon/leeds-marathon/)\n* **Time:** 2:57:48\n\n# Goals\n\n|Goal|Description|Completed?|\n|:-|:-|:-|\n|A|Sub 3hrs|*Yes*|\n|B|Beat Previous PB 3:04|*Yes*|\n\n# Splits\n\n|Mile|Time|\n|:-|:-|\n|1|6:49 (6:41)|\n|2|6:39 (6:36)|\n|3|6:39 (6:34)|\n|4|6:32 (6:29)|\n|5|6:57 (6:32)|\n|6|7:05 (6:45)|\n|7|6:25 (6:32)|\n|8|6:57 (6:36)|\n|9|6:59 (6:42)|\n|10|6:24 (6:30)|\n|11|5:55 (6:20)|\n|12|6:15 (6:29)|\n|13|6:40 (6:33)|\n|14|6:29 (6:31)|\n|15|6:36 (6:35)|\n|16|6:46 (6:45)|\n|17|6:44 (6:36)|\n|18|7:18 (6:48)|\n|19|7:37 (7:00)|\n|20|7:09 (6:48)|\n|21|6:31 (6:39)|\n|22|6:26 (6:38)|\n|23|6:50 (6:42)|\n|24|6:52 (6:50)|\n|25|6:31 (6:55)|\n|26|6:50 (6:56)|\n|27|Final .45 miles: 6:14 (6:21)|\n\n# Background\n\nI've been a runner since I was 17, now 34 this was to be my third marathon. Following running 3:04 at the Amsterdam Marathon 2024 I wanted to target going sub-3 in 2025. I'm also doing Valencia in December, and while I felt that was more a realistic target to crack the sub-3 my aim was to see how the training went and maybe give it a shot at the Leeds marathon.\n\nThis would a challenge of not only taking over four minutes off my PB in 6 months, but also difficult considering the Leeds marathon is much hillier that the famously flat Amsterdam race - (I've listed the grade-adjusted-miles in brackets on my splits)\n\n# Training\n\nFor Amsterdam I had followed Pfitz's 18/55 plan, and really enjoyed it, this time I felt I was capable of running a higher mileage for this block, and more than 5 times a week. I thought I would give 18/70 a shot, with the plan of knocking a few miles off a week and listening to my body when it was proving too much.\n\nBecause I'm a data nerd I wrote the sessions out on excel and graded how I did in each session. This wasn't by no means completely scientific (I know missing a 4M recovery run isn't as bad as missing a 18M long run) however it was more for me just to get an idea of how many of the sessions I was nailing. My final score was 76% which although far from perfect I felt very happy with considering how heavy work had been, and I also that I'd moved house at the most critical point of the training.\n\nUnlike Amsterdam and London, I also hadn't been ill during the block. On both those occasions I lost nearly 2 weeks of training so that was a massive boost.  However I was weary of the hills that Yorkshire had in store for me, coming from London this was not something I was used to and it wasn't until the final few weeks when I moved that I tried to add some hill miles to my training, how much I struggled on these knocked my confidence quite a bit.\n\nHowever, come the end of training the more important stats for me were that in the 16 weeks before tapering I average 41.6 miles (up from 27.7 miles prior to Amsterdam), had peak week mileage of 62 (up from 56), and achieved 50M+ weeks nine times, compared to four prior to Amsterdam.\n\n# Pre-race\n\nThe week before the race I made the decision, considering the gains I'd made in training, I was going to take a big swing and go for the Sub-3. I was confident I could do it on a flat course, but on this course, much less sure. However, having worked so hard for 18 weeks I was just of the mindset of what have I got to lose.\n\nI always write the splits and accumulative-split-time on physio tape and attach this to my arms when I do big races. If I was to crack the sub-3 I'd need to run 6:50 min miles on the flats (taking into account the extra .3/4 you run in a marathon).\n\nMy strategy would be to concede time on the uphills and then make it back on the downhills. I didn't want a situation where I was losing a minute on the uphill and began to panic, and think I was more tired than actually was, or cruise on the downhills and not maximise the help that the decline could give.\n\nThe course essentially consists of two massive hills, one at 6miles and another around 18miles, there are very few flat sections. I wanted to know exactly what each split needed to be, and where the hills were, so to do this I looked at the 2024 years results, found someone with a unique name and then searched them on Strava. I found someone with the Leeds Marathon race their profile which included all the mile gradients. I then used this site (https://apps.runningwritings.com/gap-calculator/) to work out what the pace I needed to hit to be on for 6:50 per mile. Interestingly this site was much more generous than Strava's GAP.\n\nI was actually quite calm about running the uphills, they were nearly a minute slower. What scared me more was a massive downhill of -240 feet which meant I had to run a 5:35 split. I don't think I've ever ran a 5:35 minute mile in my life! But this was my strategy and I was going to try and stick to it best I could\n\nI arrived an hour before the race at Headingley stadium where the start would be in honour of the late great Rob Burrow. I'm glad I got there early as there was a big queue down this narrow alleyway to enter the stadium complex where bag-drop/toilets were and entry to the start line.\n\nThe queues for the toilets were very long, not a surprise for these big races, but I do feel 30 minutes seems excessive but maybe I've been lucky previously? Another issue I had was that once inside the stadium area there didn't seem to be anywhere really to warm up. I managed to jog a KM while trying to work out which toilets were the least queued despite the packed setting.\n\nI also don't think the start area was marked up very well. There also seemed a bit of confusion over if the marathon and the half-marathon, which was happening simultaneously was commencing at the same place. As 7000 of the runners were doing the half marathon which started at 10am, and 3000 were starting the marathon at 9am, everyone was walking in different directions meaning it wasn't at obvious as normal. I'd be interested to know if others felt the same way, or if I was just being a dunce and panicked in the situation.\n\nAnyway, a very helpful marshal pointed me in the direction of the start line and I got to the right place with around 5 minutes to spare to do some dynamic stretching with all my pre-race needs met so no harm done.\n\n# Race\n\nAnd like that, it began. As always, despite going to the toilet I felt I needed to pee again, but I told myself to get through the first 4 miles and see if it went away like it has always done previously when I've race, and it did.\n\nIt was going to be a very hot day, that was obvious at 9am when we the start klaxon sounded, in these situations I always consider myself grateful that I can be normally be finished before the peak temperatures hit.\n\nIt wasn't too congested at the start and I managed to settle into a nice pace and sneak a little bit of time under my target before tackling the first big hill\n\nI got a big lift seeing my amazing wife a few miles in. We had joked that if I got a sub-3 that I would buy a PS5, and having enjoyed playing AstroBot in a store demo, she had bought the game for me and was waving it frantically as I passed, a great moment.\n\nThe crowds were very good at the start, but it was also nice to have quieter moments of the course, particularly in the beautiful scenery that was on display for the first hill climb. As I got to the top of the first big climb I was gaining confidence due to consistently hitting my splits and even snatching a few extra seconds while feeling great. At the top of the hill I was over 2mins under my required time.\n\nThe feared steep decline came next. Painfully the heel of my VaporFlys dug into my achillis as I ran down the steep decline but I managed to only lose 20\" (5:55 instead of 5:35) which I was really happy with. I managed to pass a big sub-3hr pace group for the starting pack in front of me, so that was nice knowing they would have to pass as well as the sub-3 pace group from my starting pen if I wasn't to get the sub-3. With the first hill over, this was the first time I thought to myself 'this is on here today.'\n\nI again saw my amazing wife at the Otley cheer point. I'd feared I'd missed her as she was standing after the main crowds, but it was fantastic positioning from her as we could see each other for around 150m as I ran towards her. This was a great time for a lift as the temperature rising was and I was about to hit the second massive hill.\n\nThe second hill was a gradual climb, not crazy steep but it last for 2 miles. I just kept telling myself to concentrate on the target split and run the mile that I was in. This the part where knowing my splits helped me most, I was happy to run in the mid 7's while I climbed. The fact was, with each mile I was getting more confident in achieving the sub-3 and was still over 2 minutes under my required time at around 18M. Getting to the top of the hill was another big tick in the process but now I had to face the dreaded final 6 miles of the marathon.\n\nAt this point the temperature was really beginning to ramp up, some kind residents were spraying the crowd down which helped. I'm glad to say though I really I don't think the heat effected my performance as much as I would have thought it would have though.\n\nAround 21Ms the full marathon joined up with the half marathon. I'd seen people write about this being a difficult part of the race on previous reviews, but I wasn't expecting it to be quite as congested as this. I'd estimate the half marathon runners were running at around a minute a mile slower so it was tough trying to weave around to pass them. If they want to have the half on the same day, I'm not sure what the solution is here to avoid hampering the marathon runners so much. I'm not sure it cost me more that 10-20\" but it's difficult to know, and I feel that it must have been worse for the marathon runners behind me if they were coming up against half-runners going at an even slower pace.\n\nThe crowds though were phenomenal at this part of the race, I hadn't experienced continuous wall-to-wall noise like that since running London. I guess that's the advantage of it being a beautiful and hot day.\n\nI have to say despite the congestion it felt like the last 4M went by really quickly. Despite having a sizeable amount of time in the bank I was still weary that the wheels can come off at any time in the last part of the marathon, and I lost a lot of time in London 2022 when I hit the wall. It probably wasn't until the last mile, still with over 2 minutes in hand I really thought for certain I'd cracked the sub-3. I took a moment to really enjoy the crowds and what I was about to achieve in this final mile, running a sub-3 seemed a long way off even a year ago, so to do it on this course, in this weather was something I was unbelievably proud of.\n\nI crossed the finish line to record a time of 2:57:48, a seven minute PB from Amsterdam 6 months ago.\n\n# Post-race\n\nThe finish was inside Headingley stadium, a really nice touch, with the stadium packed out. I would say the flow could have been managed a bit better, it took 5-10 minutes to get out and into the shade and this was actually where I was really feeling the heat the most. A Great medal and a nice t-shirt too.\n\nRidiculously, I realised I hadn't planned where to meet my wife after the race, and had left me phone with her, so I'd like to thank a kind stranger let me borrow her phone to ring her and I found her near where I'd left her at the entrance of the stadium.\n\nToday I sit writing this with DOMS hammering my legs, but over the moon with what I've done on Sunday, and while I'm looking forward to a break, playing my new PS5 and enjoying the summer. I am also looking forward to Valencia in December and attempting to grab a BQ at that one.\n\nThanks for reading, any questions about the race please let me know :)\n\nTL;DR Overall I'd say this was a really enjoyable race on a challenging course. The scenery is amazing, the crowds in the final 6M's are unbelievable. Though it is my opinion that the the full marathon joining up with the half is definitely something that should be managed better and would have cost the marathon runners time.",
      "author": "PlayerNumber21",
      "created_utc": 1747220764.0,
      "score": 37,
      "num_comments": 13,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "youtube"
  ]
}