{
  "id": "twin_aerwrek",
  "username": "aerwrek",
  "activity_count": 1,
  "interests": [
    "this",
    "that",
    "would",
    "race",
    "pace"
  ],
  "post_times": [
    1745858618.0
  ],
  "history_sample": [
    {
      "id": "1ka06uk",
      "title": "Electrolit Half Marathon Race Report - Breaking 1:25",
      "selftext": "# Race Information\n\n\n\n* **Name:** Electrolit Half Marathon\n* **Date:** April 27, 2025\n* **Distance:** 21.0975 kilometres / 13.1 miles\n* **Location:** Mississauga, Ontario, Canada\n* **Website:** [https://www.mississaugamarathon.com/](https://www.mississaugamarathon.com/)\n* **Strava:** [https://www.strava.com/activities/14301925926/](https://www.strava.com/activities/14301925926/)\n* **Time:** 1:25:28 (Official) | 1:24:56 (Chip Time)\n* **Nutrition:** 1 x Precision Fuel & Hydration 30g carb 100mg caffeinated gel, 1 x Precision Fuel & Hydration non-caff. 30g carb gel\n* **Shoes:** Nike Vaporfly 3\n\n\n\n# Goals\n\n\n\n|Goal|Description|Completed?|\n|:-|:-|:-|\n|A|Sub 1:30|*Yes*|\n|B|Sub 1:25|**YES**|\n|C|Don’t throw up|*Yep*|\n|D|Don’t get injured|*Kind of*|\n\n# Splits\n\n\n\n|Kilometre|Time|AVG HR|\n|:-|:-|:-|\n|1|4:02|172 BPM|\n|2|4:06|179 BPM|\n|3|3:55|179 BPM|\n|4|4:01|179 BPM|\n|5|4:01|177 BPM|\n|6|3:58|171 BPM|\n|7|4:00|174 BPM|\n|8|3:57|177 BPM|\n|9|3:55|176 BPM|\n|10|3:59|181 BPM|\n|11|3:53|176 BPM|\n|12|4:03|177 BPM|\n|13|4:03|184 BPM|\n|14|3:58|176 BPM|\n|15|4:18|183 BPM|\n|16|4:07|187 BPM|\n|17|3:58|184 BPM|\n|18|3:59|182 BPM|\n|19|3:59|189 BPM|\n|20|4:02|187 BPM|\n|21|4:00|187 BPM|\n|0.17|0:39|188 BPM|\n\n\n\nHR Data from Polar Verity Sense\n\nAVG Cadence: 196 SPM\n\n\n\n# About Me\n\n\n\nI'm 30M 170 cm tall and weigh about 58.4 kg (or 5'7\" and 128 lbs.) I've been running for about 5 years now. My 5K PB going in is 18:30, 10K was 40:33, and full marathon 3:38:43. The 10k time wasn’t exactly an all-in effort and set during a tempo run. The full marathon was run in some pretty tough conditions and paced a little too conservatively.\n\n\n\nThe goal for this year is to get me closer to that elusive sub 3-hour marathon time, and eventually get a shot at Boston. This half marathon was a check up of sorts to see how much progress I could make, explore what training works for me, and to run a race where I felt like I ran to my full potential.\n\n\n\n# Training\n\n\n\nI signed up on New Year's Day. I was reticent of getting ahead of myself, as I had just gotten back to consistent training in December and the back half of last year was marred by a litany of issues. After dealing with an overuse injury from my full marathon last April, I was largely sidelined for May and had to see a PT. Thankfully, this was a very good learning experience, and I found out I had fantastically weak hip flexors. It makes sense, I am seated for most of my day. After getting some exercises prescribed, I was right as rain and even PB’d a 10K a couple months later. However, travel and illness would hound me from October right up to the start of December.\n\n&nbsp;\n\nIn terms of deciding a goal pace, I threw my 5K PB into the VDOT calculator. It spat out a pace of 4:01 / km ( 6:28 / mi.) A mixture of bemusement and shock took over. I knew what that pace felt like and thought “ain’t no way.” But I figured if the goal pace was too hard, I could always just dial it back in training. 4:10 / km (6:42 / mi) or even 4:15 / km (6:50 / mi) were still more than respectable paces.\n\n&nbsp;\n\nFor this training block, I decided that my 85 km / week just was not going to cut it for my goals. Not having the consistent mileage to backup my pace would likely see the floor being kicked out from under me about 15-ish km in or so. So, I went down the rabbit hole and tried to see what it’d take to get there. What I arrived at was getting my consistent mileage up and adding in tempo segments to my long runs. I’d go from 85 km (52 mi) to over 100 km (62 mi.) I would ramp this up to 125 km (77 mi) as a peak week over the course of 12 weeks. For the exact structure, you can find my set-up in this [comment right here](https://www.reddit.com/r/running/comments/1jfgg51/official_qa_for_thursday_march_20_2025/misu3nu/).\n\n&nbsp;\n\nThere was one semi-serious hiccup with training. I started to feel a bit tight in my left IT band about three weeks in. I immediately pulled back and took an impromptu de-load week. I made a mistake with my plan. I had scaled up the mileage, but not the strength work needed. So, I threw in an additional hip flexor routine (about 8 mins of work) 2-3 times a week, and that took care of it.\n\n&nbsp;\n\nAside from this, the other obstacle was the weather. I knew if I wanted to go the distance, I’d need to get outside as much as I could. Race conditions would be relatively cold (5 - 10C / 41F - 50F,) and getting used to breathing in cold air would be a necessity. Only, this would be one of the snowiest winters in recent memory. Shoveling really took it out of me on some days, since it was a full body cardio and strength workout to clear the driveway. The snow eventually accumulated to some 2 metres (6 feet) in my yard. I’m definitely investing in a snowblower next year.\n\n&nbsp;\n\nRunning through the snow was a nice change of pace, as it felt more like a trail run than anything, but it also meant I wasn’t hitting my target paces easily until March. When I was stuck inside, my treadmill was limited to 8.4 mph / 13.52 kph or 7:09/mi / 4:26 /km. As a compromise I would hike the incline up to about 5-6% to compensate for those speed days.\n\n&nbsp;\n\nOne key thing I had to learn how to do was to take my gels on at a faster running pace. My marathon pace was a positively leisurely 5:08 / km (8:16 / mi ) pace. Which was incredibly easy to take on gels at. So much so that I could basically shotgun a GU in seconds. At 4:01 / km (6:42 / mi) though, that’d be more difficult. I figured out my strategy eventually. I’d open the pack, sip some, swallow and then catch my breath. Repeating until I downed the whole thing. My gel of choice, Precision Fuel & Hydration not only had a lovely peach flavour, but I found it went down really easy even without water. Only thing… the caffeinated version doesn’t taste like this,  and instead tastes like jet fuel.\n\n&nbsp;\n\nIn terms of key workouts, there was one I really wanted to nail about a month out from the race. A 3 x 5 km at race pace with 1 km floats in between. [You can see the detailed breakdown here](https://www.reddit.com/r/running/comments/1jh00zm/achievements_for_saturday_march_22_2025/mj60npl/), but in short, I smashed it, averaging 3:57 / km on those 5 km segments and against some awful wind at times. I felt pretty confident about being able to pull out 4:01 / km pace, assuming the winds weren’t totally brutal.\n\n&nbsp;\n\nWhich brings me into the wind. Holy smokes, I don’t think I’ve ever been so beaten up during a block. Towards the last few weeks of training and during the taper, 45 kph winds would be a consistent theme. Dealing with them was an exercise in frustration, even on a track, where it’d be a tailwind half the time. I knew I couldn’t take the easy way out and just run on the treadmill. What would happen if the race was windy?\n\n&nbsp;\n\n# Pre-race\nI decided on a 14 day taper for this race. The mileage reductions for week 1 would be about 85% of peak, and the following week would be down to 60% of peak. The key for this process was to maintain muscle tension. I had made this mistake for my full marathon by removing most if not all speedwork, and my legs definitely didn’t feel poppy on race day. For this taper, I was religious about keeping strides in, even for the final week of the taper. In addition to that, my final session would feature 3 x 1600 m just a little past race pace to remind my legs how to run fast for a sustained period.\n\n&nbsp;\n\n4 days out I decided to book a massage. This RMT was referred to me by my PT. As it so happened, he used to be a marathon runner as well, and qualified for Boston multiple times. I rarely have anyone to talk to about running, but to be able to speak to a veteran runner, that was an absolute treat. We discussed what I was going to be attempting and he decided that he wouldn't brutalize my legs too much. The main area of concern though was my lower back. That will definitely need fixing in the days and weeks to come.\n\n&nbsp;\n\n2 days out from the race, I started to carbload. I had tried one using 10g of carb per kilo of bodyweight in training and I learned some really good lessons from that. First… don’t take on carbs that have a lot of fat or protein. It takes a while for your gut to break them down and that’s not going to be a good time when you have to pile on more in a few hours time. Second, get most of these early in the day. Bigger breakfast, big lunch, reasonable dinner. Third, that 10g per kg of body weight load did not feel great for me, so I went down to 8.5g / kilo instead.\n\n&nbsp;\n\nMy shakeout run the day before had some very nasty 30 kph (18mph) winds with 60 kph (37mph) gusts. The race itself would be similar to this, but milder so I decided to do some last minute mental training. I accelerated past race pace against this wind. It was tough, but mentally it was important for me to do this. I needed to know what “too hard” felt like.\n\n&nbsp;\n\nThe night before, I never sleep well, that’s what the sleep 2 nights out is for. I couldn’t help but look at the weather. 19 kph (11 mph) with 40 kph (24 mph) gusts wasn’t bad, but I couldn’t help but feel like this would be a tough race. And boy, was it.\n\n\n\n# Race\n\n\n\nI woke up at 4:00 AM and had my usual breakfast, 2 PB&J bagels and about 380 mL of black coffee. No GI issues, so I was feeling good about running. I arrived about 40 minutes before start time. My warm up was an uneventful 2.9 km in the parking lot, with some 100 m strides sprinkled in to get the nervous energy out, and to prime my legs for what was to come. With about 15 minutes to go, I downed a non-caffeinated gel and made my way to my corral. Unlike last year, this time I was in the right place and not too far back. I had packed a space blanket in case it’d be cold, but with the sun out and so many people around, it wasn’t a concern at all. I guess I have a piece of a Chuck McGill cosplay now? The tongue of my right shoe was bothering me so I adjusted it. Remember this for later.\n\n&nbsp;\n\nMy strategy going in was pretty simple. Do the pace and stick to it. Don’t try to bank time. Don’t sprint down any hills, coast, keep your strides reasonable, and save that energy for the uphills. Also, keep an eye on the pace. I know I have a bad habit of accidentally accelerating when excited or annoyed (looking at you lane 1 walkers at my local track.) There were 4 main hills in the back half of the race that I planned around. I had taken to giving them nicknames to make them easy to remember.\n\n&nbsp;\n\nConditions for the day were Sunny, 5C (41f) slowly rising to about 12C (53f,) winds coming in from the northwest at 17 kph (10.5mph,) humidity at 60 %.\n\n&nbsp;\n\nMy kit for the day was relatively standard: hat, sunglasses, sweatband, Shokz, singlet, arm sleeves, fleece gloves, 5” shorts, heart rate band, and Nike Vaporfly 3s.\n\n&nbsp;\n\nA couple of special additions made its way into my kit. The first, a small Canadian flag temporary tattoo on my left arm. The one closest to the heart. I won’t get too much into the reasons why this was applied, but to keep it short, I’ve been feeling a bit more patriotic as of late. The second, my socks. I had initially decided on no-show socks, but after reading about what happened in Vancouver, I decided to go for crew length blue and green, Vancouver’s colours.\n\n&nbsp;\n\n# 0 – 3 km “Go For Broke”\nAt 07:30 sharp, we were off. Going off my experience last year, I was determined to not get caught in the crowd. It was difficult once again, since it was a mixed start with marathoners and half marathoners mingled. This wasn’t the worst, since it kept me going out too fast for too long. I had Jack Daniels’ words burning in my mind, and I wasn’t keen on missing out on my goals due to some nerves in the first mile. The adrenaline was incredible, knowing that this was what the past 12 weeks was for was really something else.\n\nThe first three kilometres was a loop around Mississauga’s downtown. We’d be somewhat shielded from the windy conditions, but there were still sections where we got battered. I would just need to keep pace and from there on, Burnhamthrope road would be much more open and I could run my own race.\n\n\n\n# 3 – 7 km Run ~~With~~ Against the Wind\nOnce I turned out onto Burnhamthrope Road, I knew this was going to be the actual start of the race. The wind was coming from the northwest as I was running southwest, so it was a bit of a headwind, but this section would be entirely downhill offsetting that disadvantage. Still, it was tough going. Being as short as I am, I started using some groups that were going about the same pace as me to block some of the wind. At times I found I needed to slow down. I was going well above my target pace and clawing at what would be a 10K race pace. Right after the 4 km mark I would pop my second and last gel. This time with 100mg of caffeine. This packet would save me so much more grief than I could ever describe. The little perk up kept me laser focused and the carbs would play a key role in the later stages.\n\n\n\n# 7 – 11 km Art Class is in Session\nThe downhill section of the course was effectively over. Elevation changes would be the order of the day as we proceeded through the University of Toronto’s Mississauga campus. We got a mild series of mild inclines and declines, a tease of what was to come. I saw an aid station coming up just after the 9k mark and decided that this would be my only stop. I grabbed a cup, sipped some, and promptly spilled some on myself, streaking my bib with the lovely red fruit punch flavour sponsored electrolyte beverage. What a happy accident.\n\n\n\n# 11 km – 14km That Hill Ain’t Right\nFrom here on, the hills continued into the forested suburbs of Mississauga road. Just before the 12 km marker, the first hill hit me. It was earlier than I anticipated, at least according to the course elevation chart. To keep things fun, I gave these hills names in training. The first one I called Bobby. Bobby hill was meant to be a 2.7% grade for 700m. NOPE. Turns out he was 4.6% grade for about 600m. Dismayed, I willed my legs to keep going.\n\n13 km was the turn-around for this race. The Mississauga half is a “there and back again” type of course. I’m used to doing hairpin turns in my neighbourhood, so that wasn’t too bad. But this is when the race got absolutely hellish. We were now facing northwest, running directly against wind gusts of 40 kph (24 mph) and with more hills to come.\n\nThe second hill was Peggy at 14 km. Peggy hill was meant to be 2.6% for 1.270 km. Well, kind of, but not really. She averaged out to be 1.5% over 2.5 km. Less grade, but more distance. It was here I had my slowest split. 4:15 / km. Going uphill that long really tested me like I’ve never been tested before. Especially in the wind I had to hang in there and just know that I would have one more “big” one then a much more mild grade coming up. Only, there’d be another spanner in the works.\n\n\n# 14 km – Murphy’s Law\n\n\nJust after passing the 14 km mark, Murphy’s law kicked in. My right shoe lace had come undone. I swore viciously, this had never happened during a race or time trial before. If anyone around me during that is reading this, I’m so sorry you had to hear that. I had no choice but to pull over and re-tie it. My mind flashed back to the corral. Like an anime moment it became immediately clear what happened. It wasn't just the tongue. It was the knot being slightly too tight. My flow was broken up, and for the first time feel my muscle fatigue. I went down to a knee faster than I thought I would and skinned my pinky and ring finger knuckles a bit, drawing some blood on the sidewalk. With that mishap taken care of, and some more red on my singlet, I soldiered on.\n\n\n\n# 15km – 21.0975 km – The Gloves Are Off\n\nIt was here I had to make a decision. I had taken my gloves off to tie my shoes and stowed them in my pocket for later use, but if I wanted to make it, I couldn’t have extra fabric on me. The areas near my pockets were warming up. So, at the 15 km mark aid station, I threw out my gloves. I would’ve liked to avoid this, but I was really in the trenches at this point. In hindsight, I really didn’t need them in the first place. The sun made things plenty warm.\n\n&nbsp;\n\nI can’t remember if it was here or earlier, but I was breathing pretty hard by now. In an effort to catch back up, the hills of 15-16km really were getting the better of me. The better of everyone really. Especially since we were running straight into the head winds now. A fellow runner noticed how hard I was breathing and shouted out some encouragement. I returned the favour best I could. We were all in this hilly, windy hell called the Electrolit Half Marathon, and we were going to finish it.\n\n&nbsp;\n\nJust after the 17 km marker was the steepest hill of the lot. Cotton. A short distance to be sure, but Cotton hill would be pretty nasty. According to the elevation chart, it was 12.67% for 100 m. Nope. Turns out it was about 6.7% for 400m. To be honest, I'm not sure which would've been worse. But I didn’t have time to think about it, because the final hill was up. Hank hill. Right after Cotton. An absolutely mild 1.8% for 1.4 km. This one was more or less accurate to the elevation chart, so I was relieved that some of the intel was correct. By now I was heading northeast. The wind I was running against was now more of a crosswind. Not exactly having the wind at my back, but given the circumstances, I welcomed it.\n\n&nbsp;\n\nAfter passing the 18 km marker, this is where things started to really hurt. A side stitch started to wreak havoc on me. My tired legs were still good, likely on account of the adequate carb intake, but the stitch was demanding attention. I haven’t had a side stitch in years. Whether it was being thrown off my rhythm by the shoelace, or me pushing so hard to get back on pace against hills and wind, it didn’t matter. I had to fix this and fast. I could feel my pace slowing. I desperately tried to get control of my breath again, but to no avail. Reluctantly, I shut my mouth and started inhaling through my nose, and out through my mouth. I knew this would fix it, but at the cost of some pace. The stitch wasn’t gone entirely, but it was enough to get me through. I got myself back up to pace. I knew I just had to hold on a little longer. I was back in the shade of Mississauga’s condo towers now, and felt immensely better.\n\n&nbsp;\n\nI passed the 19km marker and felt the terrain even out. Sweet relief. I rounded the final corner and saw the 21 km marker. This was it. I glanced at the clock and it read 1:25. I knew that my chip time must be in the 1:24 range, so I put everything I had left into the final kick, hitting my 5K PB pace. Little did I know, that was the difference maker.\n\n\n\n# Post-race\n\n\n\nUpon finishing, I exchanged pleasantries with a few fellow runners. We were pace buddies at one point or another out there. We all congratulated one another, but more importantly we cursed the wind and the hills for pushing us to our limits.\n\nIt wasn’t until I got back to the car that I managed to pull up the chip time results and the actual elevation data. 1:24:56 was the final time. Given the wind, the hills, and the shoelace thing, I’m absolutely delighted with this time. I have no regrets about the race that I ran, I left everything out there on the roads, and that's all I really wanted for today.\n\nI had my fair share of doubts going into this race. I knew the VDOT calculator was relatively accurate, but only if the training was dialed in correctly. I would worry throughout training I wasn’t doing enough speed work, or that my taper was too light, but I kept reminding myself “do you really think you know better than the dude who ran a 2:16 marathon, or the gal who did 2:25?” Trusting the process was something I had to learn to do and it’s paid off here. Now the question looming large in my mind is… can I extend this speed out and hit sub 3?\n\n&nbsp;\n\n&nbsp;\n\nMade with a new [race report generator](http://sfdavis.com/racereports/) created by u/herumph.",
      "author": "aerwrek",
      "created_utc": 1745858618.0,
      "score": 36,
      "num_comments": 11,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "tiktok",
    "instagram"
  ]
}