{
  "id": "twin_thecaringdocsw",
  "username": "thecaringdocsw",
  "activity_count": 1,
  "interests": [
    "that",
    "pocket",
    "jacket",
    "phone",
    "this"
  ],
  "post_times": [
    1750627636.0
  ],
  "history_sample": [
    {
      "id": "1lhz5er",
      "title": "I want to stop using so much sunscreen. Any recommendations for a lightweight/breathable/UV-protective jacket or sun shirt with a pocket for phone?",
      "selftext": "**tl;dr: any suggestions for a lightweight breathable sun shirt or jacket that has a pocket for an iPhone 14 Pro, that I can wear while running in hot/sunny conditions (\\~25-35C/80s-90sF)?**\n\nHello,\n\nI'm looking for a jacket or sun shirt that I can wear while running when it's really hot and sunny. I'm trying to decrease my sunscreen usage. I would like to wear only a sports bra under the jacket or shirt on these hot days.\n\n**Desired features:**\n\n\\- weight: 110g or less  \n\\- hood  \n\\- sleeves I can pull over my hands (thumb loop is nice but not required - I'll just pull the sleeves all the way down)  \n\\- pocket that fits iPhone 14 Pro or something similarly sized, and which won't wildly bounce around (my usual running pants don't have pockets)  \n\\- high albedo, I want protection from UV exposure  \n\\- breathable  \n\\- I figure I'm going to be a sweaty mess if the temp is high, so it's okay if sweat builds up inside and stays on me (the fabric contributes to humidity)\n\n**I've tried on:**\n\n\\- [Dooy Sun Protection Jacket](https://www.amazon.com/Dooy-Cycling-Protection-Windbreaker-Windproof/dp/B07ZM8NWCH) in white and gray colors - I looked like I was wearing a trash bag.  \n\\- [Patagonia Airshed Pro Pullover](https://www.patagonia.com/product/womens-airshed-pro-running-windbreaker-pullover/24197.html) in Wispy Green color - It worked well enough, and I like that it can zip over my mouth (more sun protection coverage). However, the one annoyance is that the chest pocket is so roomy that when I zip the bottom chest zipper up (to allow for airflow), my phone flops around wildly (it still flops around a lot when I have the chest zipped fully shut). Also, not sure the fabric actually protects me from the sun?  \n\\- [Arcteryx Incendo Airshell Hoody](https://arcteryx.com/us/en/shop/womens/incendo-airshell-hoody) in Arctic Silk color - This had more airflow than the Patagonia Airshed because it was looser in the torso. Hand pockets held my phone pretty well. Not sure if it actually protects me from the sun? Anyway, no huge complaints with this jacket, but it's $240. If I can't find anything else that checks off all the above boxes, then I guess I have to wear a $240 jacket. I'd be so worried that I'd rip a hole in a $240 jacket (the fabric is \"lightweight nylon ripstop with DWR finish provides light weather resistance / Double weave textile for all day comfort and durability / Clean finished seams\"). On the other hand, what is skin protection worth to me? A lot.\n\n**I haven't ordered/tried on but have looked at:**\n\n[Black Diamond Distance Wind Shell](https://blackdiamondequipment.com/products/w-distance-wind-shell) \\- This seems sort of similar to the Arcteryx. I confirmed that the pocket fits my phone. The Glacier color (teal) probably has higher albedo than the Blue Ash color (gray).  \n[Nathan Stealth Jacket 2.0](https://nathansports.com/products/womens-stealth-jacket-2-0?variant=40623032270936) \\- I confirmed this pocket does not fit my phone.  \n[Salomon Sense Aero Wind](https://www.salomon.com/en-us/shop/product/sense-aero-wind-lc12979.html) \\- I confirmed this pocket does not fit my phone.  \n[Janji Sunchaser 50 Hooded Long Sleeve](https://janji.com/products/ws-sunchaser-50-hooded-long-sleeve) \\- This lacks a pocket and it weighs 150g. But reviews say it's great for running in the sun. But I really would like a pocket so I don't have to carry my phone in my hand the whole time.\n\nThank you so much for any insight you can share.",
      "author": "thecaringdocsw",
      "created_utc": 1750627636.0,
      "score": 33,
      "num_comments": 80,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "instagram",
    "youtube"
  ]
}