{
  "id": "twin_No-Nefariousness8508",
  "username": "No-Nefariousness8508",
  "activity_count": 1,
  "interests": [
    "this",
    "that",
    "were",
    "there",
    "have"
  ],
  "post_times": [
    1744121288.0
  ],
  "history_sample": [
    {
      "id": "1juefxv",
      "title": "USA Women's Half Marathon-Nashville (2025) Review",
      "selftext": "Hello all. I just ran the USA Women's Half Marathon in Nashville on April 5, 2025 and wanted to leave an honest review since the leadership is deleting comments on their social media posts. It seems like this organization is known for their poor logistics and courses but I'm going to lay out what happened this past weekend and why it's not ok for it to cost almost $200. It's also a USATF Certified course- that distinction needs to be rescinded.\n\n1. **Poor/no communication:** Some people received updates via text, some via email, some not at all. I personally received emails that were about the hotel accommodations and very few about the race updates.\n2. **Updates that were not shared via email, only on social media (if at all): Advertised VS. Actual**\n   * Course time limit: 6 hours VS. 3.5 hours\n   * Premiums: Lululemon Shirt and Kendra Scott necklace VS. unknown/generic brand shirt and necklace (in place of the Lululemon shirt, racers received a tee shirt and a long sleeve). The women's shirt was a boat neck that quite a few people seemed to dislike.\n   * Leadership changes\n   * Start time: 7am VS. 6:30am\n3. **The Expo:** this was a very underwhelming and disappointing expo. There were only a couple vendors and one tent that had merch. If this was such a big race as advertised, why would you not have more vendors or tables with nutrition that runners could purchase?\n4. **Start Line was unorganized and lack luster:** Upon arrival, cones and barriers were still not set up. There was no MC or music, just a start line inflatable. There were no announcements or lead-up, just the national anthem a few minutes before start and then we started the race. Ordinarily, this wouldn't be a big deal, but it was advertised as this big event to celebrate women. You'd think that they would have mentioned at least the mission statement of the organization or called attention to the \"women's\" aspect of the race. The volunteers guiding people were a little cranky, too. It seemed thrown together and last minute.\n5. **Poor safety for runners:** Upon arrival, barriers were lying on the ground and crews came out after the race started to set up cones. This posed a safety threat to runners. Cars were confused about where the runners should be and the course had limited volunteers to help guide. There also need to be more cones. Volunteers were stopping runners to let cars go which should NEVER happen during a race unless there is an emergency.\n6. **The course:** This was the worst half marathon course I have personally ever run. The section on the trail was fine, but the rest was in parking lots. The parking lots at the end didn't even have cones set out and we were just expected to \"run the perimeter\"- how is that going to get close to a 13.1 mile distance? That being said, the course was under 13.1 miles. This is a national marathon and USATF-certified, did no one bike the course to make sure it was the correct distance? At one point, runners were expected to share a 4-foot wide sidewalk, going in two directions, that had trees encroaching on it. There weren't even any crowds.\n7. **The course (again):** I wanted to break this out because it has to do with the directions and lack of signage. There were so many turn-arounds in the course and at one point, you have to turn left at a location where the is a sign pointing to go right. Only because a volunteer eventually made it out to the cross over point, did runners know to go left but there was an instance of two runners who cut the course (on accident), only ran 12 miles, and made podium. That's unfair and not to USATF regulations. Plus, who crosses runners over each other so many times?\n8. **The finish line:** The finish line was lack luster. I won't comment on this too much since it was pouring rain.\n\nI'm sure there are other things that I'm missing, but I wanted to highlight things to make clear that this race is a scam. I have run over a dozen half marathons and have not had such a bad experience for so much money. If this race had cost $50, I would not have minded as much but it's a scam. It's advertised as luxury and pampering and none of that happened. My local half marathons are more \"Luxurious\" than this one. There was not much transparency in the changes and who knows what happened with the leadership but there were a lot of missteps.\n\nThis should have been a celebration of women running together and uplifting one another.\n\nIf you ran this half and had a good time, I'm so happy for you! But please believe me when I say there are so many other good half marathons you can run that cost less, are more fun, and are on better courses. Please do not run any other USA Women's Half Marathons- save your money!\n\nEdited for spelling errors.",
      "author": "No-Nefariousness8508",
      "created_utc": 1744121288.0,
      "score": 261,
      "num_comments": 99,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "twitter",
    "reddit"
  ]
}