{
  "id": "twin_thenetherrealm",
  "username": "thenetherrealm",
  "activity_count": 1,
  "interests": [
    "just",
    "with",
    "feel",
    "running",
    "disappointed"
  ],
  "post_times": [
    1750285010.0
  ],
  "history_sample": [
    {
      "id": "1leubbj",
      "title": "Do you ever feel content with your running, or are you also perpetually disappointed?",
      "selftext": "So, for context, 32M. Started running 2 years ago, stopped after 3 months. 1 year ago, stopped again after 4 months. Around February/March this year I restarted for the third time, and I’m starting to enjoy it for once! Plan is to do a 5k race every 4-6 weeks to keep me motivated. However, what I’m starting to realise is I’m just feeling perpetually… underwhelmed? Disappointed? I don’t know the right term. \n\nRegardless of how much I improve, I just can’t feel happy about it. When I started back running in February, I was doing a 28 minute 5k. By my first race in May, I was down to 24:56. My PB from 2024 was 24:32, so I wasn’t happy with that. I started training properly (intervals, etc. which I had never done) with the goal of going sub 24 by my next race in late June. I got 23:18, well under my target… and I was just disappointed I didn’t get sub-23. Everyone was celebrating, people delighted going sub 30, sub 28 etc. and I was just there being like “right, not good enough. Sub 22:30 by July race”.\n\nSet a goal, beat it, be disappointed, set new goal.\n\nIt’s a cycle, and I just want to know is it typical? Do you ever feel content with your running? Or is it always “must do better”? I don’t mind it, I just thought I’d feel happy with each milestone and I don’t. ",
      "author": "thenetherrealm",
      "created_utc": 1750285010.0,
      "score": 147,
      "num_comments": 120,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "tiktok",
    "instagram"
  ]
}