{
  "id": "twin_dontstopsoperfect",
  "username": "dontstopsoperfect",
  "activity_count": 2,
  "interests": [
    "beach",
    "races",
    "race",
    "done",
    "before"
  ],
  "post_times": [
    1759710948.0,
    1758150761.0
  ],
  "history_sample": [
    {
      "id": "1nz4xfo",
      "title": "What are your tips for doing races on the beach/on sand?",
      "selftext": "I'm doing a half marathon on the beach (in Gold Coast, Aus) in November. I've done lots of road races but haven't done any beach races before (and haven't really run on the beach much in general) so I'm keen for some tips from people who've done them before. It's an out and back course, starting at 7am in late spring (i.e. temperatures at race time will likely be 20C, humid, and warming up throughout the race, with sunrise happening before 5am). Reading about it, it looks like it's on hard sand / done near the water.\n\nSpecifically wondering about:\n\n* Road shoes versus trail shoes?\n* Any other gear recommendations from people who've done beach races before? (e.g. certain type of socks to deal with the sand and potential water from waves?) And in that level of heat/humidity as well, given it's along the beach - any thoughts on split shorts vs half-tights, and tank top vs shirtless?\n* Pacing - my HM PB is 1:31 so not sure how I should adjust my pace. Not looking to PB but keen to give it a decent crack.\n* And open to any other tips\n\nMy city isn't really built for beach running, so the earliest I can realistically do a test beach run is the day before the race when I fly up.",
      "author": "dontstopsoperfect",
      "created_utc": 1759710948.0,
      "score": 41,
      "num_comments": 36,
      "subreddit": "running"
    },
    {
      "id": "1njscr2",
      "title": "Favourite/most unique races in Australia?",
      "selftext": "Runners of Australia - what are your favourite/most unique races across the country?\n\nI'm in Melbourne but keen to do an interstate race next year - probably HM distance, comfortable with either road or trail. And ideally not a cold weather race (I don't want to do a race in Tassie in winter for example!).\n\nKeen for people's thoughts :)",
      "author": "dontstopsoperfect",
      "created_utc": 1758150761.0,
      "score": 20,
      "num_comments": 31,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.98,
  "channels": [
    "instagram",
    "youtube"
  ]
}