{
  "id": "twin_Ok_Cauliflower_8119",
  "username": "Ok_Cauliflower_8119",
  "activity_count": 1,
  "interests": [
    "race",
    "that",
    "with",
    "mile",
    "training"
  ],
  "post_times": [
    1745968787.0
  ],
  "history_sample": [
    {
      "id": "1kb20yn",
      "title": "Big Sur Marathon: Sometimes life gets in the way, over, and over, and over",
      "selftext": "# Race Information\n\n* **Name:** Big Sur Marathon\n* **Date:** 4/27/25\n* **Distance:** 26.2 miles\n* **Location:** Big Sur, CA\n* **Time:** 3:36:10\n\n# Goals\n\n|Goal|Description|Completed?|\n|:-|:-|:-|\n|A|Sub 3:30|*No*|\n|B|Finish the race|*Yes*|\n|C|Make it to the start line|*Yes*|\n\n# Splits\n\n|Mile|Time|\n|:-|:-|\n|1|7:30|\n|2|7:06|\n|3|7:05|\n|4|7:25|\n|5|7:27|\n|6|8:15|\n|7|7:36|\n|8|7:46|\n|9|7:44|\n|10|7:38|\n|11|8:29|\n|12|8:03|\n|13|7:13|\n|14|7:27|\n|15|7:30|\n|16|7:42|\n|17|7:31|\n|18|8:01|\n|19|8:12|\n|20|9:22|\n|21|9:24|\n|22|10:10|\n|23|9:11|\n|24|9:02|\n|25|9:44|\n|26|9:58|\n|27|8:59 pace|\n\n# Background\n\n31M. I ran high school cross country and track, and since then have run somewhat consistently, mostly for mental health. I have a distance runner's build but haven't really attempted to properly train or race until now. Running a marathon has always been bucket list item for me. I started training for a marathon in 2019, which was cancelled due to the pandemic. Before training I was running a base of about 20-30mi/week and averaged 8:15 pace for long runs. I ran my first half marathon in November, finishing in 1:40:23 at 7:37 pace. The lesson from that race was to go out slower. I blew up at mile 10 and dropped to 8:15 pace through the finish. Did I learn my lesson? See the race section.\n\nMy wife and I are thru-hiking the Pacific Crest Trail in June, and a challenge I anticipated during training was simultaneously training for the hike. Long distance running and thru-hiking do have some cross over, but we intended to do a few backpacking trips during the marathon training cycle that I would have to fit into my training plan. How'd that pan out? See the training section.\n\n# Training\n\nI started on a Pfitzinger 18/55 plan in the beginning of the year. I live in LA and a week into training the Eaton Fire turned the sky black and prevented me from running for a week. The third week I only ran a couple short runs because the air quality was still terrible. I was lucky enough to escape to SF for the weekend to visit friends and got a long run in around Golden Gate Park. The fourth week we were blessed with rain in LA, which cleared the air and allowed me to continue the training plan as scheduled. I ran my first 15 mile run in tears looking at the newly snow-covered San Gabriel mountains, thankful that my city was still here.\n\nThe fifth week I travelled to Mexico City for a wedding, where I woefully failed at upholding my training schedule despite packing every pair of running shorts I own. The company I worked for went out of business the day before I left, which, in combination with the Mexico City altitude, sent me into a sort of out of body experience for a couple days. It was a very physically demanding job with late nights that was bringing about a lot of stress, so I actually felt a huge amount of relief when it was over. I used this trip as an opportunity to start anew. I got one good run in at Chapultepec Park with a running buddy of mine. The altitude and smog in Mexico City is no joke, but the city shuts down the main thoroughfare to car traffic on Sundays to allow for a stunning run through the city center. My partner and I extended our Mexico trip for another week, where I once again planned to run and failed. Six weeks into an 18-week plan, I had already experienced several hiccups. I decided to switch over to the 12/55 plan going forward.\n\nOnce back home I was able to dedicate more time to training. My newly unemployed status allowed me to really focus on running like I never had before. It also allowed me to properly train for my upcoming thru-hike. Figuring out how to do weekend backpacking trips hiking 15mi/day and fitting in long runs, threshold runs, etc. wasn't easy. Ultimately I sacrificed some potential backpacking trips to my marathon training (to my wife's annoyance). I was worried about getting injured from backpacking and was probably too locked in to my training plan, so I only ended up backpacking a couple of weekends and cutting back my runs for those weeks but tried to maintain at least my long runs.\n\nI ran my longest run 5 weeks out from the race. 20 miles at 7:56 pace. I felt good the whole time. It was my first time really practicing with gels, which I hated, especially without water available to wash them down. It boosted my confidence to run at 3:30 marathon pace with relative ease. The following day I had shooting pain behind my right knee running up my hamstring that lasted throughout the week. It was enough to put me out for a week and a half. It wasn't until 3 weeks out that I really attempted to pick up training again.\n\nI had two solid weeks of training, including a 16-mile run that felt easy peasy at 7:42 pace. I felt like I had a 3:30 marathon in the bag. On the Friday a week and two days out from the race, for some idiotic reason, I decided to send it on a 5 mile run. That night, I felt a pain on the top of my left foot every time I put pressure on the ball of my foot. I hoped it was nothing, but the next morning it was more of the same. I talked to my OT friend, who was concerned I had a stress fracture and encouraged me to stay off of my feet until the race and possibly skip the race altogether if the pain continued. I was devastated. The thought of having made it to the week before the race, going through the fires, losing my job, and previous injury, all to get hurt a week out and miss the race? So I dutifully laid on the couch with my foot up for the last week. Each day I attempt to walk normally, and it continued to hurt. On the Friday two days before the race, I walked about 10 feet and felt no pain. I didn't dare attempt to walk any further for fear of risking making it worse. I was in a real conundrum. I desperately wanted to attempt to run the race, but I feared making the injury significantly worse and jeopardizing the thru-hike with my wife that has been years in the making.\n\n# Pre-race\n\nI drove to Carmel that Friday with my wife and my dog, using a trekking pole as a cane as I picked up my race bib at the expo. I was thinking: who in their right mind is picking up a bib while using a cane and expects to run a marathon in two days? All I could think about was my foot. I planned to attempt a two mile shake out run on Saturday, and if I felt any pain I would call it. I rented an Airbnb near Santa Cruz with a few friends for the weekend. We were simultaneously celebrating a friend's birthday, so I was a bit worried about getting enough sleep for the race, but most of that worry was superseded by not knowing if I could even run the race. I started taking in more carbs on Thursday, with Friday being the biggest carb day, but it did feel a bit silly given that I still didn't know if I would run. Nevertheless, I stuffed myself with carbs. I made everyone pasta, I put down bagels, I drank my electrolyte drinks.\n\nSaturday morning. In a way this was like the race before the race. The two miles that would determine if I would race on Sunday. I strapped on my running shoes for the first time since I was injured and started running. I focused on running normally and not adjusting my stride to accommodate my foot. Half a mile with no pain. One mile with no pain. I was nearly in tears. I finished two miles and felt nothing. I busted in the door of the Airbnb and told my friends it was on. I was going to run the Big Sur Marathon.\n\nI had no expectations at this point of finishing the race. I had a slightly delusional mindset that I would forget about my foot and just run, and whenever my foot gave out I would stop. I had no intention of making my injury worse, but I was riding the high of making the decision to run. I laid out all of my clothes, my gear bag, set my alarm three times, and attempted to sleep before my 3AM wake up call. I maybe got 3 hours of bad sleep. At 3:05AM I was up and out the door with my wife and my dog. I forced down half a bagel with peanut butter and a banana. I arrived at the bus pick up at 3:50 and started heading toward Big Sur at 4:15.\n\nWe arrived at the start line at 5:30. It was 45F with a constant drizzle. By the time I got to the porta potties they were pretty much destroyed. I managed to squeeze myself under an awning to stay dry, but most people just endured the wet cold. 5 minutes before the start I forced down a honey stinger waffle and threw my gear check bag in the back of a truck. I lined up near the 4hr pacers, having no idea what pace I'd go. I had a well thought out pacing strategy that factored in the hills with a slightly negative split before the injury. But that went out the window with the injury. In the back of my mind, I still thought: what if my foot doesn't give out? What if I can still run a 3:30 marathon?\n\n# Race\n\nAt the start of the race the sun had just come up. The beginning of the course I was surrounded by fog rising from the redwoods. I felt no pain in my foot. I hit my first mile at 7:30 but I felt like I was trotting. Second mile: 7:06, still felt nothing. I knew I shouldn't be running a 7:06 at mile 2, but I couldn't help it. The first five miles I ran with nearly no effort under 7:30 pace. I found dirt on the side of the road to run on, thinking that could prolong the inevitable with my foot. I was already soaking wet from rain. For some reason I decided to bring sunglasses, which immediately went on top of my hat and didn't move.\n\nMile 6 I hit 8:15 pace, but I was manually lapping and I think it was .15 long. I took my first gel at this point. I had planned for a gel every 30 min. but the thought of choking one down that early made me change my mind. I caught up to the 3:30 pacers and decided to stick with them for a while. They were hitting closer to 3:25 pace, but it felt fine to me. I started to get annoyed with the constant pep talk and bigger group, so I decided to ditch them around mile 10 and go ahead. I began to think my foot was healed. I was in the clear and was hitting a 3:17 pace without much effort.\n\nMiles 10 & 11 are one long hill that reach the highest point of the course. I had trained for this and planned it in my pacing. So I just put my head down and focused on my breathing. Halfway through the hill, taiko drummers gave me a boost to keep going. I was surprised at how well I was handling the hill. First mile done at 8:29, second mile 8:03. My confidence=sky high...\n\nMile 12 was straight downhill leading to Bixby Bridge. I took my second gel at this point. My hands were so cold from the constant rain and chill that I used my teeth to get it open. Lots of people stopped at Bixby for photos. A grand piano playing Elton John. What the hell - here I was. I wanted to cry, but I also wanted to finish. I knew I had it in me to finish, so I bottled it up and kept on trucking.\n\nAfter the big downhill of mile 13 I started to feel pain in my left hamstring, then my right hamstring. I chose to ignore the pain. I wasn't going to let my hamstrings stop me from finishing this thing. By mile 16 my shoes and socks were soaked through and my heel started slipping out. I had to pull over to tighten my laces. Stopping did not feel good.\n\nAt mile 18 I began feeling a sharp pain in my right IT band running down my leg. My hamstrings were still singing, which I could ignore, but the IT band made my right leg feel like it was going to give out from under me. I prayed the pain would go away but it persisted. I attempted and failed to eat an energy chew from the course. I simply couldn't keep it down, and I spent like a full minute trying to get the package open. By mile 20 I could barely bend my right leg past about 30 degrees without immense pain. I remember thinking back to people tell me \"The real race begins at mile 20.\" Well, here we go.\n\nThe pain in my right leg was so bad I thought I couldn't finish. I made it this far, twenty miles into this damn race, and after all of this my IT band gives out? I was angry. But I just kept on hobbling. I focused on keeping my leg straight. If I bent it I thought it would go out from under me. What was so frustrating was that I had a ton of energy left in the tank. As I trotted along I was barely breathing. My heart rate was super low. If it wasn't for my leg I would be sending it home right now. Each mile felt like the longest mile of my life. I just didn't want to stop. I considered stopped to stretch but worried that if I stopped it would be all over. So I hobbled, and hobbled, and hobbled. At mile 23 I ate a fresh strawberry that tasted like the best thing I had ever eaten. Like nearly brought me to tears. I thought: thank god, not a gel, not a bagel. A f\\*cking strawberry.\n\nBy the time I made it to mile 25 and was still upright, I had the delusion I could still break 3:30. I had 15 minutes to go and would have to run back-to-back 7:30s after not bending my knee for 5 miles. So I attempted to send it, and immediately got put back in my hobbling place. I accepted my fate. Now all that was left was to cross the finish line. Around this point my GPS watch malfunctioned and added another 25 miles to my distance, which added a level of ridiculous comedy to the race as I looked down and saw I was now going at 4min/mile pace.\n\nAs soon as I saw the finish line I was in tears. I held everything back until this point, but now I had made it. Crossed the line, 3:36:10, my wife and my dog holding signs, ugly crying, grab a medal. I did it.\n\n# Post-race\n\nI could barely walk. My whole body was sore in a way I didn't know it could be. The insides of my elbows were sore. I tried to stretch but could barely get my limbs into stretching positions. Eventually I hobbled away from the finish line, got a Double-Double and animal style fries well done, and took a bath in a daze.\n\nBy the evening I attempted some more stretching. I crashed and slept for 10 hours. The next morning, I was still incredibly sore. Today I am still incredibly sore.\n\n# Looking forward\n\nI am so thankful I was even able to run this race given my injury. I am proud of myself for sticking with it and finishing. It went nothing like I had planned, but it delivered on being hard. Objectively, the Big Sur Marathon is incredible race. It's well-organized, challenging, and beautiful.\n\nBreaking 3:30 was so tantalizingly close, and I know I can do it when I am not injured. I think there is a path for me to BQ if I am smart about training and have the time.\n\nI can't run another marathon until after I hike the PCT, which couldn't be until March 2026 at the earliest. I certainly have the marathon itch now, if for nothing else but to break 3:30.\n\nFrom this experience I have learned the importance of going slow in training. Next time I will plan for more miles and slower miles. I also think some very simple strength training could have helped me prevent injury.\n\nThank you all for reading my race report. I look forward to leaning on this community when I train for a future marathon.\n\nMade with a new [race report generator](http://sfdavis.com/racereports/) created by u/herumph.",
      "author": "Ok_Cauliflower_8119",
      "created_utc": 1745968787.0,
      "score": 76,
      "num_comments": 13,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "youtube"
  ]
}