{
  "id": "twin_lakefrontlover",
  "username": "lakefrontlover",
  "activity_count": 1,
  "interests": [
    "that",
    "mile",
    "this",
    "with",
    "race"
  ],
  "post_times": [
    1746835364.0
  ],
  "history_sample": [
    {
      "id": "1kix3bt",
      "title": "Mini Race Report - JPMCC 5K (5th a Day to 5K)",
      "selftext": "\\*Mods - Please remove this if it is not detailed enough and I'll wait until Monday to add it to the Mini Race Report weekly thread\\* \n\n**Race Information**\n\n* **Name:** JPMCC 5K\n* **Date:** May 8, 2025\n* **Distance:** 3.1\n* **Location:** Chicago, IL\n* **Website:** [https://www.jpmorganchasecc.com/en/chicago](https://www.jpmorganchasecc.com/en/chicago)\n* **Time:** 21:25\n* 31M | 5’11 | 163 LB\n\n# Goals\n\n|Goal|Description|Completed?|\n|:-|:-|:-|\n||\n|A|Sub 21:47|*Yes*|\n|B|Sub 21:00|*No*|\n|C|Sub 20:00|*No*|\n\n# Splits\n\n|Mile|Time|\n|:-|:-|\n||\n|1|7:06|\n|2|7:37|\n|3|6:02|\n\n**Training**\n\nI took a 5 year hiatus from running and during that time, I developed an addiction to alcohol that culminated with outpatient detox in November of 2024. I was drinking a 5th of Vodka daily as a minimum (it always ends with Vodka...) from 2022 until my detox. Prior to 2022, a 5th would last me around two days.I don't wish withdrawals on anybody and I still take Gabapentin daily to stave off alcohol cravings. During the detox, I decided that this was a second shot at having a productive life outside of just drinking, working and wondering how quickly I could end a work meeting so I could go have a drink.\n\nA few days after the withdrawal shakes went away and I finished my dose of Librium, I bought a Garmin Enduro 3, downloaded Strava, Carb Manager and started the work. I initially went out for runs at a pace of 11:54 min/mi. I utilized the run-walk method and quickly learned that it was going to take a lot to even finish a mile without feeling like I would have a panic attack and pass out.\n\nI started utilizing Garmins Daily Suggested Workouts at the end of November for a duration of 14 weeks. I found that the Daily Suggested workouts of base building were extremely helpful as a (once again) beginner and in November I ran a total of 8.6 miles. December 2024 - 77.2 miles, January 2025 - 84 miles, February 2025 - 115.8 miles, March 2025 - 145.9 miles, April - 144.6 miles. \n\nIn November after a week of sobriety, I had found out that my bloodwork was just trash. My total cholesterol was 211 mg/dL (range is 0-199) and my triglycerides were 261 mg/dL (range is 0-150). These are just two of the metrics amongst others that were not looking good. My blood pressure upon waking was routinely 180/100 during the first few weeks of being sober. My blood pressure while being an alcoholic was even higher than this, pushing 190/120 on multiple occasions with a resting heart rate of 80-90 bpm. There was a long period of time during my addiction where I avoided doctors, hospitals, or really anywhere medical where a professional would put 2 and 2 together and call me out. This avoidance brought on immense anxiety which only made me drink more. There were multiple days at a time during the span of my addiction where I chose alcohol over food, even though I had food readily available. Mind you, this whole time, I held down a corporate 9-5 and lived in Downtown Chicago (shoutout to Streeterville). By the end of December 2024, I was in a 1000 calorie deficit/per day and tracking all of my calories via Carb Manager. My meals were pretty simple, breakfast consisted of eggs and beef sausages, lunches were always 85/15 ground turkey and dinners were a combination of healthy nuts with 90/10 ground beef. I averaged 1800 calories per day during the December 2024 - end of April 2025 timeframe. I went from 215LB on November 175th to 163lb as of this post, today. I most recently had bloodwork taken in February and my total cholesterol dropped down to 170 mg/dL (range is 0-199) and my triglycerides have dropped to 145 mg/dL (range is 0-150). As one could imagine, not only was I dropping weight and having better bloodwork, but I was feeling amazing and could not believe how much damage my body took and how it was actually able to bounce back. Nothing fits anymore.\n\nAs you can tell by my mileages above, I *really* got into running as a healthy addition to my sobriety (along with having a psychiatrist and going to Alcoholics Anonymous twice a week). I had no idea if I’d ever race, but, in February a coworker had suggested that I sign up for the JP Morgan Chase Corporate Challenge 5K and I figured, why not? I had 10 weeks to get in a training block and I have coworkers that are extremely supportive and have run it every year. I started a 10 week training block with Garmin Coaching and I finally got in the speed-work that I had been avoiding during the first four months of returning to running. By the time I had started the 10 week training block, I was able to comfortably run up to 10 miles at a pace of 10:30 min/mi in Zone 2 with a HR range of 130-152 bpm. I was able to knock a few PR’s that I was really happy with at the end of this 10 week block, including a 5:55 min/mile and a 5K time of 27:20. I noticed that runs weren't necessarily easier but they felt easier. My pace would drop alongside my heartrate so I was getting faster and faster.\n\nThis block consisted of the following workouts per week;\n\nSunday (base): 1 mile WU, 5 mile base run, 1 mile CD  \nMonday(threshold) : 1 mile WU, 20-40 min threshold, 1 mile CD  \nTuesday(rest): Active Rest Day (usually golfed a local 9 hole course or went to the driving range)  \nWednesday(V02 max): 1 mile WU, 10x 0.5 mile sprints at 177+ HR), 1 mile CD  \nThursday(base): 1 mile WU, 5 mile base run, 1 mile CD  \nFriday(base): 1 mile WU, 8-10 mile base run, 1 mile CD  \nSaturday(long run): 10-15 mile base run\n\nI averaged around 35-40 miles per week with this training block and peaked at 47 miles. I cut out my calorie deficit in the last three weeks of the training block because I had already hit a weight that I was very happy with (170LB) and lesson learned, I was recovering much quicker due to eating maintenance calories. One week prior to my 5K, I PR’d my mile time and hit 5:55 min/mile. I was ecstatic and had never run this fast before, even during my teen years when I was a skinny 140 LB kiddo. I knew that I wouldn’t be able to keep up this pace in the 5K but I knew that I could probably pull off 7:45-8:00 min/miles as long as I tapered correctly and didn’t let the adrenaline consume me before the race. \n\n**Pre-race**\n\nT-1 day. The anxiety is already setting in and my resting heart rate has gone from an average of 45bpm to 70bpm. During my last taper run, I tried imagining myself running with a crowd and I had a huge adrenaline dump and my HR went from 150bpm to 170bpm without increasing pace or effort. I knew that I had to accept the fact that no matter what happened during the race, I already came so FAR and if I decide to walk during the race, so be it.\n\nDay of race. I drove into work (Downtown Chicago) because I really did not want to spend over an hour in the train going back to the suburbs when I know I could drive back home in about 30 minutes. Felt pretty anxious all day but still managed to keep my routine. Had an easy breakfast with coffee and then had a chicken salad for lunch. Luckily the race was at 6:50PM which is near the time I usually go for runs so I was able to not divert too much away from the usual day. The end of the work day was spent with colleagues stopping by to wish me luck and telling me how happy they were to see me get ready for my first race.\n\nThe race was at 6:50pm so at 5:00pm, I changed into my REI half tights, pinned my bib to the awesome t-shirt provided by my company (I remember thinking this can’t be happening right now), put on my Vaporfly 3’s and headed to my car to drop off my work clothes. Once I dropped everything off, I headed to Grant Park to find my companies tent. “It’s cold” I thought as I walked to Grant Park. “I can’t wait to run so I can just get warm already”. I walked leisurely to Grant Park (about a 15 minute walk from where I work) but my heart rate was already coasting around 130bpm and I knew I needed to just relax once I found the tent. Tent found, dropped off my stuff and chatted with some colleagues who have been lifetime runners. Excited, nervous, cold. I looked down at my green bib on my shirt and started making my way to the “green corral”. I was shocked at how many people there were. \n\n**Race**\n\nRed corral just took off and I’m finding that my heart rate has dropped to around 80bpm right before we start. I tell myself “hey, it’s just another run. Remember to push it”. The horn sounds and we go. It takes about 5 seconds between the sound of the horn and for the people directly in front of me (couple hundred people probably) to start moving. I hit “start” on my watch and the timer begins. Holy shit people are running FAST. I am pushing it and I am being passed as if I were moving 3mph. I don’t know much but I know that I don’t want to cook myself in the first mile and then crash out. It IS a 3.5 mile race but I was really focused on my 5K time because I had a PR that I wanted to break. “it’s so cold” and variations of that thought are what I am thinking about during the first half mile. \n\nOne mile, 7:07 pace. I quickly glance down at my watch and I am surpassing the splits I thought I would have. “Am I going too fast?”. 1.5 miles in and I seriously consider stopping. My lungs are burning, the transition from being cold and shivering to sweating and running feels really weird. A loud crowd of runners suddenly turned into laser sharp focus, nothing but footsteps, heavy breathing and the occasional sound of a crowd cheering us on. About 2 miles in, we go under a bridge and the temp goes from 45F to probably 60F. “Oh wow, that feels amazing”. I think about stopping again but I have too much momentum, quitting is absolutely not an option at this point unless I feel that I am going to be injured. \n\n2 miles, pace 7:37. “Okay, I’ve definitely slowed a bit but still doing good. I turn my music off because the sound of thousands of footsteps is so cool. This is not an every day thing and I don’t get to experience this during my solo training runs. During this mile, we’re passing on a portion of lower wacker drive and I can see the building I used live in during my time in Streeterville. I take a brief second to think about all of the physical falls I had in that apartment - from being absolutely wasted, to the daily dry-heaves before I left the apartment.\n\n3 miles, pace 6:02: Not much thinking going on at this point of the race. Making sure I continue breathing and don’t trip over anyone. I pass up a lot of people and it. feels. good. “Half a mile. Half a mile. Half a mile. Half a mile left” is the only thought I had until I hit 3.1 miles and **PR’d from 21:47 to 21:25**. I’m ecstatic that I hit a PR, followed up with being mad that someone decided this race should be 3.**5** miles. \n\n3.5 miles; Official Time: 28:06.\n\n**Post-race**\n\nI cross the finish line, grab a water and head to the company tent. My faster colleagues were already grabbing a snack as I was walking into the tent. My buddy PR’d his 5K, with a time of 16:28. We celebrate and quickly start shivering due to being sweaty and the temp now having dropped even more as the sun went down. Cold is the keyword of the day. I feel nauseous and at one point I contemplate excusing myself to go see if I’ll throw up. Luckily, I didn’t throw up. As everyone is getting ready to leave and head to a bar that our company had rented out, I start the 15 minute walk back to my car to drive home.\n\nA few lessons learned.\n\n1. Moving forward, I will not be in a calorie deficit while in a training block. Recovery is slowed and injury risk rises. \n2. Racing has me hooked. \n3. I’m proud of myself for not leaving any gas in the tank (especially when it came to that last mile).\n4. I need to pace myself better. I feel like running my 2nd mile at 7:37 and then running my last mile at 6:02 shows that I have improvement to make when it comes to pacing. I spent minimal time looking at my watch and tried my best to run by effort however it’s pretty clear that I cooked a bit too much in my first mile.\n\nI just bought “Daniels Running Formula” and I’m hoping to start another 5K Training block in the next few days. Not 100% sure where I’ll go from here but I know I want to race again, and soon. \n\nHopefully this was an interesting read for some of you. To those that have/are struggling with addiction, you are not alone. Life is so much better without drugs/alcohol. For every 1 “fun” alcohol story, I have 100 stories of struggling and not having a good time. I know that I am a much better person when I am sober, for myself and those around me.\n\nI wake up every morning with the same mantra; I don’t know if I’ll be sober tomorrow, but I’ll do everything I can to stay sober today. \n\nCheers.\n\nMade with a new [race report generator](http://sfdavis.com/racereports/) created by [u/herumph](/user/herumph/).\n",
      "author": "lakefrontlover",
      "created_utc": 1746835364.0,
      "score": 26,
      "num_comments": 6,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "instagram",
    "youtube"
  ]
}