{
  "id": "twin_brwalkernc",
  "username": "brwalkernc",
  "activity_count": 8,
  "interests": [
    "your",
    "that",
    "running",
    "with",
    "thread"
  ],
  "post_times": [
    1759929189.0,
    1752151839.0,
    1750252211.0,
    1750252245.0,
    1750252093.0,
    1750251978.0,
    1747421335.0,
    1747057507.0
  ],
  "history_sample": [
    {
      "id": "1o1a56f",
      "title": "Tis the Season! Time for the Annual cold / cool / winter weather running and gear thread",
      "selftext": "Now that Winter is quickly approaching (in the Northern Hemisphere, at least), it seems we are are getting more winter/cold weather posts which means it is time for the annual Winter Megathread.\n\n[Here's](https://www.reddit.com/r/running/wiki/weather#wiki_winter.2Fcold) the link for the cold weather info in our wiki.  I will add this post to that at a later date.  If you happen to be in the Southern Hemisphere and entering the season of the big fiery death ball in the sky, [here's](https://www.reddit.com/r/running/wiki/weather/) the link to the \"Running in the Heat\" section of the wiki .\n\n**Why should I run in the winter?**\n\n* Winter running makes you strong!\n\n* That person you really want to beat next year is out there training right now\n\n* Spring weather feels so much better when you’ve been training through the winter\n\n\n**Clothing**\n\nYou’re going to want materials that will keep you warm even when damp or wet. Think wool, fleece, and wicking synthetics. You’ll also want things to be breathable so you don’t get super sweaty (and even colder).  Layer up so you can adjust during your run.\n\nTrapped air is what keeps you warm and cozy in the winter. If your shoes are really tight with a couple pairs of socks on, or your gloves/mittens are too tight, you may have less trapped air and impair circulation, which will make you cold.\n\nHere’s an example of what works well for some in calm, dry conditions. Keep in mind wind or precipitation will make things colder, and that it’s always better to have an extra layer than to make do without.  This can also vary widely between people and how comfortable you want to be.  Use the table as a guide to layering suggestions factoring in how fast/slow you are running (for generating body heat) as well as how hot/cool natured you normally are.\n\n**Temp Range**|**Upper**|**Lower**|**Socks**|**Hands**|**Head**\n:--|:--|:--|:--|:--|:--\n30 to 40F (-1 to 5C)|Long-sleeve (LS) shirt|Shorts or light pants|regular socks|Light gloves|headband\n20 to 30F (-6 to -1C)|LS shirt + baselayer|Regular tights|1x midweight wool|Light gloves|headband\n10 to 20F (-12 to -6C)|LS Baselayer + wind vest|Thermal tights + windbriefs|2x midweight wool|Mittens|Hat + light gator\n0 to 10F (-18 to -12C)|LS Baselayer + Fleece jacket + Wind jacket or vest|Thermal tights + windbriefs + leggings|2x heavier wool socks|Heavy mittens|heavy hat, fleece balaclava, eye protection\n<0 F (<-18 C)|LS Baselayer + Fleece jacket + Wind jacket|Thermal tights + windbriefs + leggings|2x heavier wool socks|Heavy mittens w/ gloves underneath|heavy hat x2, fleece balaclava, eye protection (glasses or goggles, if windy)\n\nHere are some useful links to some guides that can help you choose appropriate amount of clothing:\n\n[Fahrenheit Pictorial Guide](https://i.imgur.com/GKwoDUQ.jpg)\n\n[Celsius Pictorial Guide](https://i.imgur.com/KKbJgwl.jpg)\n\n[Dress My Run Website - Quick tool to show what to wear based on where you live and weather](http://dressmyrun.com/)\n\n* Click on \"Settings\" in the bottom right hand corner to adjust your personal temperature preference (warmer or cooler)\n\n**Footwear**\n\nRoad shoes are fine most of the time, unless you're running somewhere that consistently has snow or ice-covered sidewalks. If you have good socks, your feet should stay warm even if damp from melting snow. Think more carefully about your footwear if there’s snow or ice on the ground.\nOn fresh snow or packed, but still soft snow, trail shoes (something with a low to moderate lug) work very well.  [Turning an old pair of road shoes into Screw Shoes](https://www.runnersworld.com/running-tips/running-shoe-screws) is an excellent idea for ice, thawed and refrozen snow, and heavily packed snow conditions – the screws do a great job providing a bit of extra traction.\n\nYou can also look into traction devices (like Yaktrax) when icy.\n\nWhen running, direction changes and stopping are the most likely times to slip and fall on snow or ice. Slow down and be cautious around corners and street crossings. As you run, make sure you’re landing with your feet underneath your center of mass – even if you do have a slippery step, keep your feet moving, and you can usually recover and avoid a fall.\n\n**Safety**\n\nIf you work during the day, chances are your morning or evening run will be dark. Get yourself a good headlamp (to see and be seen), and wear a reflective vest over your other clothing. Know that motorists may be less likely to expect you to be out running when it’s 15 degrees and snowing.\n\nIf it's really cold, make adjustments or plans to ensure you can stay safe during your run even if you turn an ankle or something else happens where you can't keep running to stay warm. Plan your route along safe warm zones (friend's house, grocery stores, etc.), and/or carry your cell phone (close to your body, so your battery doesn't die). If you for some reason can't run, you will quickly get very chilled.  [Here's](https://www.weather.gov/bou/windchill) a Windchill Safety chart from the National Weather Service to help determine when things might be too dangerous to run or if you do, to take extra safety precautions.\n\nStart your runs into the wind - this will be the coldest part - so that your finish your runs with a warmer tailwind. This can make a big difference - if you get sweaty during your run, and turn into a stiff breeze to finish, you're likely to get chilled as you're heading home.\n\nHere's a good post on [Running in snow tips..?](https://www.reddit.com/r/running/comments/zj8zhw/running_in_snow_tips/)\n\n\n\n**Nutrition**\n\nEven when it’s cold out, you’ll want to be sure you’re hydrated before and during long runs. You’re probably sweating more than you might think, it will evaporate quickly in cold dry air. Have a method to keep fluids from freezing when it’s cold out, either by keeping fluids under a layer of clothing (vest or hydration pack), planning a route around accessible water, or figuring out a way to keep your handheld from freezing up.\n\nGels and other foods can freeze too – tuck these items into a glove or mitten a few minutes before you want to eat, to thaw them out and warm them up.\n\n###**The comments below will be divided into some broad categories to try and keep things organized.  Please post replies into those bolded comment chain headings.  So let's hear it, Runnitors!  Best gear, tips/tricks, experiences, etc. about running in the cold?**\n\n______\n\n**LINKS TO MAJOR TOPICS THREADS BELOW**\n\n* [GENERAL THOUGHTS](https://www.reddit.com/r/running/comments/1o1a56f/tis_the_season_time_for_the_annual_cold_cool/nif19ly/)\n\n* [TIPS AND TRICKS](https://www.reddit.com/r/running/comments/1o1a56f/tis_the_season_time_for_the_annual_cold_cool/nif1arw/)\n\n* [QUESTIONS](https://www.reddit.com/r/running/comments/1o1a56f/tis_the_season_time_for_the_annual_cold_cool/nif1bm0/)\n\n* [MUST HAVES](https://www.reddit.com/r/running/comments/1o1a56f/tis_the_season_time_for_the_annual_cold_cool/nif1ckh/)\n\n* [HOW COLD IS TOO COLD](https://www.reddit.com/r/running/comments/1o1a56f/tis_the_season_time_for_the_annual_cold_cool/nif1dit/)\n\n* [BEST / WORST EXPERIENCES](https://www.reddit.com/r/running/comments/1o1a56f/tis_the_season_time_for_the_annual_cold_cool/nif1ed0/)\n\n* [FAVORITE HATS](https://www.reddit.com/r/running/comments/1o1a56f/tis_the_season_time_for_the_annual_cold_cool/nif1f3m/)\n\n* [FAVORITE JACKETS](https://www.reddit.com/r/running/comments/1o1a56f/tis_the_season_time_for_the_annual_cold_cool/nif1fuv/)\n\n* [FAVORITE TIGHTS / PANTS](https://www.reddit.com/r/running/comments/1o1a56f/tis_the_season_time_for_the_annual_cold_cool/nif1gj8/)\n\n* [FAVORITE SOCKS](https://www.reddit.com/r/running/comments/1o1a56f/tis_the_season_time_for_the_annual_cold_cool/nif1hdw/)\n\n* [SHOE SUGGESTIONS](https://www.reddit.com/r/running/comments/1o1a56f/tis_the_season_time_for_the_annual_cold_cool/nif1i3h/)\n\n* [FAVORITE GLOVES](https://www.reddit.com/r/running/comments/1o1a56f/tis_the_season_time_for_the_annual_cold_cool/nif1iu3/)\n\n* [FAVORITE BASE LAYERS](https://www.reddit.com/r/running/comments/1o1a56f/tis_the_season_time_for_the_annual_cold_cool/nif1jnu/)\n\n* [FAVORITE MID-LAYER](https://www.reddit.com/r/running/comments/1o1a56f/tis_the_season_time_for_the_annual_cold_cool/nif1kb2/)\n\n* [BEST SAFETY DEVICES (Lights / vests / etc)](https://www.reddit.com/r/running/comments/1o1a56f/tis_the_season_time_for_the_annual_cold_cool/nif1l16/)",
      "author": "brwalkernc",
      "created_utc": 1759929189.0,
      "score": 104,
      "num_comments": 90,
      "subreddit": "running"
    },
    {
      "id": "1lwbww5",
      "title": "New to running or the sub? Click here first! Looking for links to the most recent weekly threads or other mega-threads, this is the spot!",
      "selftext": "###For you new runners, please check out the info that is in the Wiki.\n\nFor the beginners finding the sub, please check out [the section in the FAQ for beginners](https://www.reddit.com/r/running/wiki/faq/#wiki_for_beginners)  (which can also apply to returning runners) as well as the [Common Questions section](https://www.reddit.com/r/running/wiki/faq/#wiki_common_questions).  \n\nThere is a lot of info in the [Wiki](https://www.reddit.com/r/running/wiki/faq).  Yes, some of it is from old posts.  Yes, the layout is not the greatest.  It is always a work in progress.  If you come across info that needs to be updated (or broken links), let us know.  If you see a post that should be in there, let us know.  If you see a lack of a helpful topic, let us know.\n\n[This](https://www.reddit.com/r/running/wiki/index/common_questions/#wiki_i.2019ve_never_run_before.2C_what_do_i_do.3F) also has some good tips.  [This resource](https://drive.google.com/file/d/0B3TYR3d9S1s1dFpwa3E4NmZfOW8/view) is linked in the sidebar/top menu and may have some info you can use as you get started (or back into) running.  Finally, if you are looking for shoes and don't know where to start, check out [this section of the wiki](https://www.reddit.com/r/running/wiki/index/common_questions/#wiki_what_shoes_do_i_buy.3F). \n\nTake some time to the search the sub and browse the daily [Official Q&A thread](https://www.reddit.com/r/running/search?q=Q%26A+author%3Aautomoderator&restrict_sr=on&sort=new&t=all) and you will find plenty of tips for getting started/back.\n\n*Please note that some of the direct links above will not work on mobile and link only to the main Wiki, requiring a bit of scrolling to find the relevant section.*\n\n____________________\n\n###Posts to Take Note Of\n\n* Link for usual [As much as I want to delay the season, it's time for the Annual Summer, Heat, and Humidity Megathread](https://www.reddit.com/r/running/comments/1kkswaa/as_much_as_i_want_to_delay_the_season_its_time/). Or if you are in the southern hemisphere, the [\"Running in the WINTER/COLD\" section of the wiki ](https://www.reddit.com/r/running/wiki/weather/#wiki_winter.2Fcold).\n\n* [The Race to the Start Line: Returning to Running After Having Covid-19 (NY Times article)](https://www.reddit.com/r/running/comments/wa65zp/the_race_to_the_start_line_returning_to_running/)\n\n* [Infographic: Graduated return to play guidance following COVID-19 infection](https://www.reddit.com/r/AdvancedRunning/comments/wif7ys/infographic_graduated_return_to_play_guidance/)\n\n* [Best books about running 📖🏃🏻‍♀️](https://www.reddit.com/r/running/comments/1i04q4y/best_books_about_running/)\n\n* [PSA: How your heart rate zone 2 might be lying to you.](https://www.reddit.com/r/running/comments/1e4a6lr/psa_how_your_heart_rate_zone_2_might_be_lying_to/)\n\n* [How Do You Fall in Love with Running Again?](https://www.reddit.com/r/running/comments/1lvccl4/how_do_you_fall_in_love_with_running_again/)\n\n* [How did you get over the initial struggle of starting to run regularly ?](https://www.reddit.com/r/running/comments/1lngesj/how_did_you_get_over_the_initial_struggle_of/)\n\n* [What helped you rebuild confidence after a long break from running?](https://www.reddit.com/r/running/comments/1lg58vz/what_helped_you_rebuild_confidence_after_a_long/)\n\n* [Running in hot/humid weather](https://www.reddit.com/r/running/comments/1m4pjwv/running_in_hothumid_weather/)\n\n* [New study shows accumulated distance (10% rule) less important than single run impact](https://www.reddit.com/r/running/comments/1lzipim/new_study_shows_accumulated_distance_10_rule_less/)\n\n* [What’s with all the new hype around zone 2 running?](https://www.reddit.com/r/running/comments/1lxb73q/whats_with_all_the_new_hype_around_zone_2_running/)\n\n* [Have We Been Tricked by Running Shoe Companies? Do Super Cushioned Shoes Actually Reduce Injuries?](https://www.reddit.com/r/running/comments/1lzigd1/have_we_been_tricked_by_running_shoe_companies_do/)\n\n\n\n\n\n\n____________________\n\n###**Using r/running**\n\n\n\nThe mods do their best to actively moderate this community. When posting, we expect users to make an effort to familiarize themselves with our rules and practices before submitting posts or comments. We suggest taking note of **Rule 2** *and* **Rule 7**, *since these are the most commonly broken which will result in a thread being removed.*\n\nThe mod team has tried to lay out the rules with some expected guidelines of what is or is not allowed, but there is always some gray area and posts are up to interpretation by the mod team.  We do our best to be consistent, but that isn’t always the case with multiple mods or even the same mod between similar posts.  The mod team wants to make /r/running a resource for new and experienced runners and to build a community between all types of runners.\n\nRegardless of that fact, Moderators have the final say.  We are open to hearing differing opinions, but the mod team will make the final decision.  Visitors and posters in /r/running are expected to understand that the mod team are people too and doing the best they can to manage a very large sub with frequent posts every day.  If you do not agree with how this sub is moderated, we expect you to do so in a civil manner….and also know when it is time to drop it.\n\nWe are very upfront in stating that the sub is heavily moderated, but we do recognize that not every user wants that.  The wonderful thing about reddit is that there are plenty of subs to check out and hopefully find one more to your liking.  If you find the  moderation here too strict, some other related subs with less moderation are /r/runninglifestyle/, /r/BeginnersRunning/, /r/runningquestions/, and /r/Runners/.\n\n_____\n\n\n###**Recurring Threads**\n\nIn order to reduce clutter and nudge you lurkers into posting, we have created a number of daily and weekly threads for you to read, make a comment, or ask a question. Unless you truly believe your new thread will make a new and interesting contribution to Runnit, please wait until the related weekly thread rolls around and post in there instead.  A more complete description of the threads can be [found in the wiki](https://www.reddit.com/r/running/wiki/faq/#wiki_reccuring_threads).\n\nHere are the current recurring threads with links to the most recent (hopefully) weekly thread:  \n\n*Please note that the search links for the daily threads (Q&A and Achievement) will not work on mobile.  If you are using mobile, sort the sub by \"Hot\" and the current Q&A thread will be stickied at the top.  For the Achievement thread, sort by \"New\" and scroll down a bit to find the current Achievement thread.*\n\n* [Daily Achievement Thread (Posted daily)](https://www.reddit.com/r/running/search?q=%22achievements+for%22+author%3Aautomoderator&amp;restrict_sr=on&amp;sort=new&amp;t=all): Any and all accomplishment posts should be posted here. Anything from new PRs, to longest weekly mileage, to running your first ultra – literally any accomplishments you experienced recently!\n\n* [General Q&A Thread (Posted daily)](https://old.reddit.com/r/running/search?q=Official+Q%26A&restrict_sr=on&sort=new&t=all): With such a large sub, there are a lot of running-related questions that come in every day. In an effort to keep the front page of the sub uncluttered and fresh, we ask you post your questions, particularly those one-off questions that are potentially short and don't necessarily provoke significant discussion, in the daily General Q&A thread.\n\n* [Weekly Training Thread (Sundays)](https://www.reddit.com/r/running/comments/1nmj7pd/the_weekly_training_thread/)\n\n* [Miscellaneous Monday General Chit-Chat (Mondays)](https://www.reddit.com/r/running/comments/1nth0mw/miscellaneous_monday_chit_chat/)\n\n* [Li'l Race Reports Thread (Mondays)](https://www.reddit.com/r/running/comments/1nsfsw4/the_weekly_training_thread/)\n\n* [Super Moronic Monday (Tuesdays)](https://www.reddit.com/r/running/comments/1nuc797/super_moronic_monday_your_weekly_tuesday_stupid/)\n\n* [Run Nutrition Tuesday (Tuesdays)](https://www.reddit.com/r/running/comments/1nu4e9l/run_nutrition_tuesday/)\n\n* [Tuesday Shoesday (Tuesdays)](https://www.reddit.com/r/running/comments/1nu4e9d/tuesday_shoesday/)\n\n* [Lurker's Wednesday (Wednesday)](https://www.reddit.com/r/running/comments/1nuzflw/lurkers_wednesday/)\n\n* [What Are You Wearing Wednesday Weekly Gear Thread (Wednesdays)](https://www.reddit.com/r/running/comments/1nuzfm2/what_are_you_wearing_wednesday_weekly_gear_thread/)\n\n* [Weekly Complaints & Confessions Thread (Thursdays)](https://www.reddit.com/r/running/comments/1nq5aic/weekly_complaints_confessions_thread/)\n\n* [The Weekend Thread (Fridays)](https://www.reddit.com/r/running/comments/1nqsm0c/the_weekend_thread_for_friday_september_26_2025/)\n\n* [Race Roll Call (Fridays)](https://www.reddit.com/r/running/comments/1nqris4/race_roll_call/)\n\n* [Social Saturday (Saturdays)](https://www.reddit.com/r/running/comments/1nrmn1x/social_saturday/)\n\n_____\n\n###**Rules**\nWe have further [explanations of the rules in the wiki](https://www.reddit.com/r/running/wiki/faq/#wiki_rules), but as noted in the side bar, please take note of Rule 2 and Rule 7 as they are the ones most cited for post removals.\n\n **(2)** - *Posts need to generate discussion and/or useful information that other searchers can then benefit from. Low-quality posts, recent reposts, chronically repetitive posts, posts not directly related to running, and questions that are easily answered by FAQ, searching r/running, or Google are subject to removal at the moderation team's discretion.*  \n\nThis sub attracts a lot of beginners as well as “drive-by” posting.  A major goal of the sub is to promote quality discussion and develop a community where information and experiences can be shared.  Many of the common questions have been answered, either in previous threads/FAQ, or could easily be answered in the daily Q&A thread.  Yes, circumstances can vary person to person, but it is expected that posters make an attempt to find these answers for themselves before making a stand-alone post.   Visitors should put forth some effort in finding the answer themselves and not expect the Runnit community to do all the work for them.  If the post/question is very specific to your situation (such that other general user won't get much benefit from the information), then it belongs in the daily Q&A thread.\n\nIf you do make a stand-alone post, please include info relevant for the community to help.  It is nearly impossible to offer any advice without sufficient background information.  Items that could be relevant:\n\n* Age\n\n* Sex\n\n* Current MPW + pace\n\n* Previous peak MPW\n\n* Workouts you traditionally or recently have completed\n\n* Goals (including specific races)\n\n* Previous PRs\n\n* Other things you think might be helpful to include\n\nBelow are some of the reason a post would be considered low-quality, thus being removed and directed to the Daily Q&A thread:\n\n* \"Does anyone else...\" type posts?\n\n* \"Is X a good time for...?\" posts\n\n* If your post is a question in the title (including “See title” or “Title says it all” in the body).\n\n* If your question can be asked in one sentence.\n\n* If your question is very specific to you or your situation.\n\n* If your question can be answered either with a yes/no.\n\n* In general, it is helpful to include something that shows you made an effort to find an answer within the community and thus separate it from the numerous low-effort posts that are submitted every day.  \n\n* Additionally, as rule 5 states, make your title descriptive.  If it is not clear what the post is about or asking, then it will not be useful in later searches.\n\nFinally, while mutual encouragement and sharing of information is a very high priority of r/running, numerous motivational-type and PSA posts are not necessary.  A larger goal of the sub is to provide information to runners, beginners and experienced, which can get drowned out by these types of posts.\n\n\n **(7)** - *Do not solicit medical advice. This includes 'Has anyone else experienced this injury?' type posts.*  \n\nWhile there is some leeway on advice for rehabbing some minor, common running injuries, this sub is not the place for a diagnosis, and especially not for advice on major injuries.  If you are hurt or injured, find a medical professional with the proper credentials to help you.  Not the internet.  \n\nThere is a big difference between \"Hey, my IT band is tight. Got any good stretches for it?\" and \"My shins hurt every time I run. If I run through the pain, will it turn into a stress fracture?\" If your question involves sharp pains, unknown/vague pains, or injuries/problems that have stretched on for long periods of time, then it is a question for medical professional.\n\nAlso, your doctor not being familiar with running injuries is no excuse.  Find a Sports Medicine doctor, Physical Therapist, or find another doctor.\n\n_____________________\n\n\nFinally, feel free to use this post to offer any ideas or suggestions of things you'd like to see (or not see) here.  We are open to feedback, but please be civil, constructive, and willing to have a discussion.  This is not the place to rant.\n\n###**Thank you all for being a part of this community!**",
      "author": "brwalkernc",
      "created_utc": 1752151839.0,
      "score": 35,
      "num_comments": 5,
      "subreddit": "running"
    },
    {
      "id": "1legpdw",
      "title": "What Are You Wearing Wednesday - Weekly Gear Thread",
      "selftext": "It's that time of week already...the gear thread! What have you picked up lately? What's working for you now that it's whatever season you believe it to be in your particular location? What have you put through rigorous testing that's proved worthy of use? We want to know!\n\nTo clear up some confusion: We’re not actually asking what you’re wearing today. It’s just a catchy name for the thread. This is the weekly gear discussion thread, so discuss gear!\n\n*NOTE:  For you Runnitors looking to sell/trade any running gear (as well as bib transfers), head over to /r/therunningrack.*",
      "author": "brwalkernc",
      "created_utc": 1750252211.0,
      "score": 13,
      "num_comments": 28,
      "subreddit": "running"
    },
    {
      "id": "1legput",
      "title": "Lurkers' Wednesday",
      "selftext": "#Would you rather not be a lurker?\n\n**Then what are you waiting for? Tell us all about yourself!**\n\nThe LW thread is an invitation to get more involved with the /r/running community.  \n\nNew to the sub in general?  Welcome!  Let us know more about yourself!",
      "author": "brwalkernc",
      "created_utc": 1750252245.0,
      "score": 8,
      "num_comments": 32,
      "subreddit": "running"
    },
    {
      "id": "1legnqh",
      "title": "Achievements for Wednesday, June 18, 2025",
      "selftext": "Hey runners, it's another day and it is time to post your accomplishments you'd like to share - big or small.\n\nNote: No need to preface YOUR accomplishments with something like, \"this may not be an accomplishment to most of you...\". Be proud of your achievement.",
      "author": "brwalkernc",
      "created_utc": 1750252093.0,
      "score": 11,
      "num_comments": 23,
      "subreddit": "running"
    },
    {
      "id": "1legm7q",
      "title": "Official Q&A for Wednesday, June 18, 2025",
      "selftext": "With over 4,125,000 subscribers, there are a lot of posts that come in everyday that are often repeats of questions previously asked or covered in the FAQ.\n\nWith that in mind, this post can be a place for any questions (especially those that may not deserve their own thread). Hopefully this is successful and helps to lower clutter and repeating posts here.\n\nIf you are new to the sub or to running, [this Intro post](https://old.reddit.com/r/running/comments/1fcsdwl/new_to_running_or_the_sub_click_here_first/?) is a good resource.\n\n##As always don't forget to check the [FAQ](http://www.reddit.com/r/running/wiki/faq).  \n\n####And please take advantage of the search bar or Google's [subreddit limited search](https://www.google.com/search?q=url%3Areddit.com%2Fr%2Frunning+SEARCH+TERMS+HERE).",
      "author": "brwalkernc",
      "created_utc": 1750251978.0,
      "score": 5,
      "num_comments": 69,
      "subreddit": "running"
    },
    {
      "id": "1ko8mpn",
      "title": "The Weekend Thread",
      "selftext": "Another week is coming to a close!\n\nWhat’s good this weekend? Who’s running, racing, tapering, recovering, hiking, camping, cheering, volunteering, kayaking, swimming, knitting, baking, reading, sleeping, .. ? Tell us everything.",
      "author": "brwalkernc",
      "created_utc": 1747421335.0,
      "score": 9,
      "num_comments": 19,
      "subreddit": "running"
    },
    {
      "id": "1kkswaa",
      "title": "As much as I want to delay the season, it's time for the Annual Summer, Heat, and Humidity Megathread",
      "selftext": "As we are starting to see more posts about dealing with heat/summer, it's time to have our megathread on summer running.   Here are the links to past posts:\n\n* [It's Getting Hot In Here -- 2019 Heat Thread](https://www.reddit.com/r/running/comments/bwb72s/its_getting_hot_in_here_2019_heat_thread/?utm_source=reddit&utm_medium=usertext&utm_name=running&utm_content=t3_ddnm3v)\n\n* [It's that \"Awesome\" Time of Year for the Summer, Heat, and Humidity Megathread](https://www.reddit.com/r/running/comments/h9kyhs/its_that_awesome_time_of_year_for_the_summer_heat/)\n\n* [Unfortunately, \"That\" Time of Year has Rolled Around Again: Summer, Heat, and Humidity Megathread](https://www.reddit.com/r/running/comments/mmwpip/unfortunately_that_time_of_year_has_rolled_around/)\n\n* [You guessed it! Time for the Annual Summer, Heat, and Humidity Megathread](https://www.reddit.com/r/running/comments/uhlseh/you_guessed_it_time_for_the_annual_summer_heat/?sort=top)\n\n* [As much as I don't want to admit it, it's time for the Summer, Heat, and Humidity Megathread](https://www.reddit.com/r/running/comments/13k9fwh/as_much_as_i_dont_want_to_admit_it_its_time_for/)\n\n**[NOTE: If you happen to be in the Southern Hemisphere and entering the season of the cold, snow, and/or ice, [here's the link](https://www.reddit.com/r/running/wiki/weather#wiki_winter.2Fcold) to the \"Running in the Cold\" section of the wiki which links to the Cold megathread with tips and tricks.]**\n\nIt's a good time to get reacquainted with heat training, tips, tricks and adjustments you use to get through next couple months of misery, whether it's just for the next 2 months or 5 months.  However, the most important think is to recognize the signs of [heat exhaustion](https://www.cdc.gov/niosh/topics/heatstress/heatrelillness.html#exhaustion) and [heat stroke](https://www.cdc.gov/niosh/topics/heatstress/heatrelillness.html#stroke) and not to try to be tough.  If you're running alone and you push into heat exhaustion, you have to stop immediately before you hit heat stroke.\n\nSigns of heat exhaustion:\n\n* Confusion\n* Dizziness (good indictor no matter what, but more so when it's summer)\n* Fatigue (more so than usual)\n* Headache\n* Muscle/abdominal cramps\n* Nausea/vomiting\n* Pale skin\n* Profuse sweating\n* Rapid heartbeat\n\nHeat stroke is what heat exhaustion will turn into if you don't recognize it and stop immediately.  Signs of heat stroke are fairly similar but one notable difference is **that you have stopped sweating**.  Heat stroke is a serious medical condition and requires emergency treatment.  Call 911!\n\nSymptoms of heat stroke include:\n\n* Confusion, altered mental status, slurred speech\n* Loss of consciousness (coma)\n* Hot, dry skin or profuse sweating\n* Seizures\n* Very high body temperature\n* Fatal if treatment delayed\n\nRemember that SLOW DOWN is never the wrong answer in the heat.  You're going to go slower - it's just a fact.  Embrace it and the fitness will still be there when the weather cools off.\n\nSome quick high level tips:\n\n* Run slower (duh)\n* Don't run during the heat of the day\n* Run in shaded areas.   Running in direct sunlight in the summer can add 20+ degrees to your skin temp, and that's what counts, not the air temp.\n* Avoid highly urbanized areas if at all possible during hot days.  The concrete jungle retains and radiates heat back at you, it is almost essentially an oven effect.\n* Focus on humidity as much as the temperature.  Understand how the mechanism of sweat works.  If the humidity is extremely high, sweat will just drip off you and not evaporate.  Evaporation of sweat is the mechanism of how the body cools itself - the phase change from liquid to vapor extracts heat from your skin.\n\nAnother good tip from a helpful Runnitor:\n\n>Dew point is actually a better measure of humidity than humidity percentage points are. That's because air at 100% humidity and 50F holds less water than air at 50% humidity and 90F.\n\n> You can use a dew point calculator to figure out the dew point. Over 65F dew point is sticky, but over 70F is very humid. Make sure to hydrate often and to pay attention to your body to see if it's overheating.\n\n> Here's a good dew point calculator:\n\n> http://dpcalc.org/\n\nFinally, one good table for pace adjustment is here:  http://maximumperformancerunning.blogspot.com/2013/07/temperature-dew-point.html?m=1\n\n**As a way to keep things a bit more organized and easier to find info later, I'm going to make several top level comments.  Please respond to those instead of the main post.  I'll include a stickied comment with direct links to each of the topic headings.  Other top level comments will be removed.**",
      "author": "brwalkernc",
      "created_utc": 1747057507.0,
      "score": 344,
      "num_comments": 203,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.92,
  "channels": [
    "instagram",
    "youtube"
  ]
}