{
  "id": "twin_sergeantbiggles",
  "username": "sergeantbiggles",
  "activity_count": 2,
  "interests": [
    "train",
    "summit",
    "race",
    "from",
    "gray"
  ],
  "post_times": [
    1757711588.0,
    1751368590.0
  ],
  "history_sample": [
    {
      "id": "1nff2aw",
      "title": "Groundbreaking Inova study finds potential link between long-distance running and colon cancer",
      "selftext": "A groundbreaking new study led by Tim Cannon, MD, Sheridan Director, Molecular Tumor Board and Co-Director of the Gastrointestinal Cancer Program at Inova Schar Cancer, has revealed a potential link between extreme endurance exercise and increased risk of advanced colon cancer in younger adults, raising new questions about screening for high-performance athletes.\n\n[The study was presented at the 2025 American Society of Clinical Oncology (ASCO) Annual Meeting in Chicago.](https://www.inovanewsroom.org/press-release/2025/08/groundbreaking-inova-study-finds-potential-link-between-long-distance-running-and-colon-cancer/)",
      "author": "sergeantbiggles",
      "created_utc": 1757711588.0,
      "score": 480,
      "num_comments": 209,
      "subreddit": "running"
    },
    {
      "id": "1loyz6b",
      "title": "Runner beats train to summit of Mount Washington",
      "selftext": "[Below, as reported from WMUR in NH](https://www.wmur.com/article/runner-beats-train-summit-mount-washington-cog-joseph-gray/65243873)\n\n\"A runner from Colorado beat a train to the top of Mount Washington on Saturday [6/28/25].\n\nJoseph Gray, of Colorado, was among about 400 participants in this year's Race the Cog event. He beat the 9 a.m. Cog Railway train to the top of the summit, according to Northeast Delta Dental President and CEO Tom Raffio.\n\nRaffio said Gray was the only runner to beat the train. He completed the race in 39 minutes and 54 seconds. Gray had to run through fog and light rain on steep terrain to complete the run. By beating the train, he got a $1,000 bonus from Northeast Delta Dental, Raffio said.\n\nGray also beat the lead Cog train in 2022. Raffio said beating the lead train to the summit has only happened twice during the event, and both times it was Gray who accomplished the feat.\n\nRunners from across the country take part in the Race the Cog event each year. The course starts at the base station of the Cog Railway in Bretton Woods.\"\n\nMore info:\n\nThe race is as follows: \"Runners will take the path alongside the tracks to the summit of Mount Washington racing the cog [railway] the whole way up! The course begins on dirt/gravel where it gradually becomes steeper as you approach Jacobs Ladder which is about a 37% grade. From Jacobs Ladder the runners will begin to experience the large boulder fields that make up the Presidential Range, one of the most technical areas in the country.  The grueling race then concludes on the lofty summit of Mount Washington, finishing a true test of endurance alongside The Cog. The weather can be extreme and vary significantly. Temperatures can be in the 70’s at the base and then snowing at the Summit. \" Mt. Washington's elevation is 6,288 feet. The race course is about 2.75 miles long and follows the tracks the entire way. The total climbing is 3,500 feet with more than 1,000 feet of climbing per mile.",
      "author": "sergeantbiggles",
      "created_utc": 1751368590.0,
      "score": 366,
      "num_comments": 60,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.98,
  "channels": [
    "instagram",
    "youtube"
  ]
}