{
  "id": "twin_goldentomato32",
  "username": "goldentomato32",
  "activity_count": 1,
  "interests": [
    "loop",
    "running",
    "were",
    "race",
    "have"
  ],
  "post_times": [
    1747092263.0
  ],
  "history_sample": [
    {
      "id": "1kl77ti",
      "title": "Wildflower trail marathon",
      "selftext": "# Race Information\n\n* **Name:** Wildflower Trail Marathon\n* **Date:** May 11th, 2025\n* **Distance:** 26.2 miles\n* **Location:** Bastrop, Tx\n* **Website:** [https://www.trailracingovertexas.com/wildflower](https://www.trailracingovertexas.com/wildflower)\n\n# Goals\n\n|Goal|Description|Completed?|\n|:-|:-|:-|\n|A |Don't fall|❌|\n|B|Have fun|✅|\n\n# Splits\n\nBig loop 1: 1:54:56\n\nBig loop 2 2:05:58\n\nSandstone loop: 1:08:19\n\nElevation gain: 1,575ft\n\n# Training\n\nQuick background info: I am F39 and have run 3 road marathons. I just completed the Houston Marathon in 4:02 and I was looking for something to run just for fun. I had zero pace goals and I had just completed Pfitzinger 55/18 so I wanted to try something different. I used the Hanson's beginner plan and it worked out really well. I enjoyed the strength workouts and I did speedwork over a bridge (almost) every Tuesday for elevation practice. A normal 16 mile run for me in the swamps of Houston has 10ft of elevation so I used a bridge and 4 repetitions would get me about 150ft once a week. When I run this race again I will definitely add another bridge day. \n\n# Race\n\n This race was the most fun I have ever had running a marathon! It was my first time running off the roads and it was incredible! The weather was close to perfect (61F at the start, a cool breeze and 50F dewpoint) and the race was very well organized. There were only about 80 folks on the trails and I was alone for most of the race. The course had 1 big loop of about 10.5 miles that is run twice and a small loop for the last 5. The biggest climb is coming out of the start/finish line. I power hiked this every time. The trails were great for running-they were mostly dirt, flat rocks and a couple of sandy sections. I wore road shoes and was fine. \n\nThe scenery is nothing breathtaking but is constantly pretty. I saw flowering cactus, tons of wild flowers, the piney woods gave lots of shade and I loved the new growth in the forest fire area. The charcoal skeletons are almost completely covered with new growth and are really pretty. The sandy sections really were rough but they never lasted long enough to get angry about them. The back half of the big loop had some awesome rollers to fly down. \n\nI ran with the second place woman for a lot of the second loop and was feeling great until I tripped at mile 21 just before starting the sandstone loop. Miles 22-26 were awful. It was only 5 miles but it was so sandy and completely exposed to the sun. I pouted and complained and walked a bunch. If I had known how close I was to the 3rd place lady I might have run a bit more but I was throwing a pity party for myself. My kiddos and husband sent some sweet texts and I rebounded eventually. I ended up 4th lady overall and 13th of 38 runners. \n\nI brought a normal amount of gels but trail running is harder and takes longer so I should have had one extra. I started micro-dosing goldfish around mile 14 just to have something salty and space out my gels better. Also, I underestimated my ability to guestimate distances. On the road you can see the finish line or intersection from far away but in the woods you could be 15 feet from turn off and have no clue. I stopped about .1m before the sandstone turnoff to check google maps because I was convinced I had missed the very well marked and obvious turn, but at mile 23.5 I wasn't thinking straight. The aid stations were fully stocked with everything you could desire! The Gatorade slushies gave me a brain freeze every time and were my favorite! \n\nI had a great time and trail running is so different from road running! I can't wait to add more trails into my season this fall! Trails over Texas did a phenomenal job running this event and I am probably going to be running the winter Brazos Bend. \n\n  ",
      "author": "goldentomato32",
      "created_utc": 1747092263.0,
      "score": 29,
      "num_comments": 2,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "twitter",
    "reddit"
  ]
}