{
  "id": "twin_Snackpack-SC",
  "username": "Snackpack-SC",
  "activity_count": 1,
  "interests": [
    "that",
    "more",
    "started",
    "recovery",
    "this"
  ],
  "post_times": [
    1754080369.0
  ],
  "history_sample": [
    {
      "id": "1mf7g5h",
      "title": "Learn from my injury recovery mistakes!",
      "selftext": "Skip to the end for TL; DR.\n\nBack in December, while training for my first half marathon, I twisted my ankle in a deep hole in the sidewalk. I went down hard and ended up a little bloody. I could not bear any weight on my ankle and had to sit on the sidewalk for several minutes before hobbling home. Once home, I RICEd it and went on to work. I knew it was sprained; it was obvious by the swelling and pain, but I figured it would go away on its own. I am one of those stubborn men that doesn't like going to the doctor for these sorts of things because they will \"get better on their own.\" After about a week, I tried to run on it again, even though it still hurt and was clearly swollen. This made the pain and swelling worse. Fast forward three weeks, and several more unsuccessful attempts to run on it, and my wife finally convinced me to go to the doctor.\n\nAt first, they thought it might be fractured, which would have sucked, but I told myself I could deal with the downtime. Then we did an MRI just to make sure it wasn't something more serious. Spoiler alert, it was! Turns out I had a grade three ATFL sprain. Yikes! Treatment? One full month non-weight bearing, followed by another month of light weight bearing (in boot), and then PT for a minimum of 6 weeks. Double yikes! Thank the Lord they didn't want to do surgery, but this recovery timeline still sucked. The ortho and my GP made it pretty clear that had I gone in sooner, there may have been a chance my recovery would have been shorter, and there's a good chance it wasn't that bad until I tried to run on it repeatedly.\n\nHonestly, the physical part of the recovery wasn't so bad. I think that is because I followed my PT's advice very carefully when it came to my rehab exercises. However, I struggled mentally. Pretty hard. You see, before I started running and eating a clean diet, I was borderline obese. I started running as a means to lose weight, which I did successfully (down 60+ pounds), but it went from a chore to a hobby very quickly. I ran for the fun of it, not out of necessity. It became a very important outlet for me, like my own therapy in a way. A time for me to unplug, get outside, and just connect with myself. Not to mention how great it felt whenever I achieved a running-related goal that I once thought was impossible. Now, in my mind, a very important part of my routine, and honestly my life, had been forcefully taken away, and I could do nothing but wait until I was recovered.\n\nI started to over-restrict my calories. Started overdoing it in the gym in other ways. Started to eat more ultra-processed foods that I had previously given up. I tried to live a more \"gym-bro\" centered life. I was terrified that if I didn't do SOMETHING, then I would lose all my progress. What I didn't realize was that I was likely making things worse by doing this. The wake-up call again came from my wife, who saw my gloomy mood, saw that I was reverting back to bad habits, and realized that this whole thing was taking its toll on me. One day, she finally said something to me, and it woke me up. I realized how terrible I felt every day, physically and mentally, and thought back to how I felt before when I was less restrictive and just focused on eating for health vs trying desperately not to gain weight that took me more than a decade to gain in the first place. I was overtraining any way I could without injuring my ankle more in an attempt to keep myself busy and find an outlet, even though I likely should have been resting more and allowing my body to heal.\n\nSo, I started to focus more on wellness again, treated my body with grace, and now seven months after my injury, I feel better than ever and I am running again! Everyone focuses on the physical part of recovery, but man does the mental stuff take its toll. I definitely learned a lot through this experience.\n\nTL; DR - learn from my mistakes. If you are injured or think you may be, don't \"wait it out.\" Get it checked, and for the love of all that is holy, follow the physio/PT's guidance and timeline. While recovering, don't be afraid to talk to someone about your mental health if you are struggling.",
      "author": "Snackpack-SC",
      "created_utc": 1754080369.0,
      "score": 174,
      "num_comments": 18,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "youtube"
  ]
}