{
  "id": "twin_stenskott",
  "username": "stenskott",
  "activity_count": 1,
  "interests": [
    "race",
    "that",
    "this",
    "just",
    "half"
  ],
  "post_times": [
    1744122304.0
  ],
  "history_sample": [
    {
      "id": "1juetwr",
      "title": "More than a PB; success at Berlin Half Marathon",
      "selftext": "### Race Information\n* **Name:** Berlin Half Marathon\n* **Date:** April 6, 2025\n* **Strava:** https://www.strava.com/activities/14094966727\n* **Time:** 1:26:35\n\n### Goals\n| Goal | Description | Completed? |\n|------|-------------|------------|\n| A | Negative splits | *Yes* |\n| B | PB | *Yes* |\n\n### Splits (manual by markers)\n| Kilometer | Time |\n|------|------|\n| 1 | 4:04\n| 2 | 4:10\n| 3 | 4:13\n| 4 | 4:12\n| 5 | 4:11\n| 6 | 4:00\n| 7 | 3:58\n| 8 | 4:03\n| 9 | 4:01\n| 10 | 4:05\n| 11 | 4:05\n| 12 | 4:05\n| 13 | 4:05\n| 14 | 4:06\n| 15 | 4:10\n| 16 | 4:10\n| 17 | 4:10\n| 18 | 4:12\n| 19 | 4:08\n| 20 | 3:55\n| 21,1 | 4:25 (3:58)\n\n### Backstory/Training\nTwo years ago my brother’s widow suggested we should run Berlin Half Marathon together. It’s almost quaint, [reading that race report again](https://www.reddit.com/r/running/comments/12dmtve/berlin_half_marathon_the_best_two_hour_therapy/), but the short version is: I had no idea what I was doing, ran a 1:55 without any proper training or a gps watch, but it was quite emotional to run that race and afterwards I got seriously bit by the running bug. This year, like last, my sister in law T brought along her kids and some more family members to run and cheer for us in Berlin. \n\nThroughout last year I had some really lofty goals and I failed miserably at all of them; even though they were PBs I was a bit disappointed with two half marathons at 1:34:XX and Stockholm Marathon at 3:34. All three of those races were quite hot (over 20°C at the start), and I simply wasn’t prepared to run in those conditions, but it still felt a bit shitty to fail in the same way all three races; keep perfect goal pace (4:15 and 4:40, respectively) for the the first half of the races then bonk completely in the second halves. \n\nSo my goal at Berlin this year was simply to run a negative split. Not bonk. People who know I care about running asked me what time I was aiming for, but I didn’t want to say a number. My Garmin race predictor has lied to me before, so I just said I wanted to run a negative split. I’m in the middle of a Pfitz 18/55 marathon plan for Stockholm Marathon in late may, and I’ve felt really good on my long runs, but still; the goal here was just to execute the race well, and do the second half slightly faster than the first half. I just wanted to run a race properly, for once.\n\n### Pre-race\nI combined the trip to Berlin with a visit to some friends who live in Prague. My wife and one year old daughter got to spend four fantastic days walking up and down the hilly cobblestones of Prague: not an ideal lead up to a street race, but what the hell… I don’t know how many more trips like this I’ll be able to do. We took the train to Berlin on Saturday morning, a bit ironic as the Prague HM was that same day. \n\nOn race day I was surprisingly calm. My daughter slept through the night and I got a solid 8 hours. Weather report had really been on my side here; unlike the 23°C of 2024, the the forecast for our race was 4-8°C partly cloudy. I wasn’t sure what to wear and my family seemed shocked when I was getting dressed in my singlet; but in the end I was happy that’s what I chose. It’s also the only pink thing I have to run in, for my brother.\n\nIn the starting corrals I saw people dressed for what looked like arctic expeditions; scarves, long sleeves, long running tights…. Maybe us Swedes are more used to cold running but I always run in shorts if it’s above 0°. My current fitness should probably have me in corral A, but my PBs had me placed in corral B, which I’m actually quite happy about; I got to the corral early and made sure I was at the front of my group. For the first time since I started running, I wasn’t nervous at all at the starting line. This was going to be FUN.\n\n### Race\nBeing at the front of corral B was perfect because it kept me from going out too fast. It seemed like people around me were maybe rushing a bit, some were breathing quite heavily early on but I was super comfortable at around a 4:10 pace. Now… I know I said I didn’t have a time goal, but since I was treating the whole thing as training for the full marathon coming up, I had set up my watch for a 1:27 pace. The idea was to do the first 10k at around 4:10 and the second half around 4:05. This was conservative in relation to my Garmin race predictor (but like I said, it’s always been optimistic for me before). \n\nAfter leaving Tiergarten, the first 5k or so were pretty crowded and on relatively narrow streets. I ticked a couple of Ks above my target pace but kept my cool. I thought to myself, and even said out loud: ”this is fine…. I have 15k left to make up those few seconds, and it will make it even easier to make my negative splits. I had decided before the race to feel out my need for drinks, and at the first station there was a huge rush to grab a cup: I saw it from far ahead and decided it wasn’t worth it to go into that mess and skipped it. I wasn’t thirsty and it wasn’t hot, I would be fine without. \n\nAt around 6K the course deviated a bit from previous years, and we just had a long, amazing stretch of slightly downhill, very wide Kurfurstendamm for about 3 kms before we hit Kaiser Wilhelm Church where I knew my family was set up to cheer for us. This part of the race was such a high point for me. I wasn’t even close to getting tired, my legs were feeling great and I was *holding back* at around 4:00 pace. I got a little energy boost after my family all cheered for me around 9k and then had a bit of a shock when I clocked the 10k split faster than my 10k PB (41:20 from another disappointing race last year). I had a half a cup of water here for the hell of it. I don’t think it was needed but it was there and there was no rush of people around me so I don’t think I lost more than a handful of seconds doing it.\n\nAfter that I got a little bit worried that it was going to happen again, that the first half had felt so amazing and the inevitable bonk was coming. But instead of panicking I just calmed down, took stock of how I felt and came to the conclusion that it was still going according to plan, if slightly fast. Around Potsdamer Platz it got quite windy and some gusts felt like they came head on, but I knew from previous years that it would get better in Mitte, and kept my cool. For the last bit of the race, the course was quite different than last year, when we had done a bunch of zig zag for a bit through central Berlin; this year we had a 4 km out and back on a wide street… some runners I talked to hated this part but I kind of loved it. Yeah, it got quite windy there again and it was a bit confusing because it felt like it just kept going, but I also get really inspired seeing really fast runners (almost elite) in the same race as I’m running. If I had been in corral A I probably would’ve met the front pack here. \n\nAfter that section and a little twist around Alexanderplatz, we got to Unter Den Linden and the finish line was in sight, but with 2 km left to go. I didn’t want to look at my watch, so I just reminded myself of what the last 2 km on my way home on a regular tempo day feels like, how silly short it is, and decided to kick it. It wasn’t a sprint, it wasn’t even *that* much faster than the rest of the race, but it just felt **so good** to have a little speed left in the tank. I did the last 2,1k at about 3:55 pace and those last 100 meters after Brandenburger Tor were just pure joy. I don’t know if I cried but I certainly laughed as I crossed the finish line well under my Garmin pace, and with a slightly negative split. \n\n\n### Post-race and reflections\nI don’t know what to say here. After four really disappointing races last year I finally managed to perform, execute, whatever you want to call it, the way that I had set out to. I know this comes with experience, and I certainly have more now than I did last year. But I also have to remember this feeling going into my A race in seven weeks. \n\nI think that what I’m most proud of in this race was just the way that I kept my cool in the little wrinkles that came my way. I saw some of my splits be a little slow, and decided that was fine. Later on I noticed I was going too fast and still decided that I was feeling strong. I think I also realized that what works for me is to say my thoughts out loud. It made them more concrete somehow, rather than just something I was thinking about. \n\n—\n\nI remember one time when my brother had managed one of his big goals in running; a sub 2:48 marathon (4:00/k pace), after many many attempts. This was way before I started running so I didn't really *get* it, but I just remember how he was just so happy that whole day, and for weeks after. I think this was the first time I felt that way after a run. I really enjoy running but the high of executing a race the way you wanted is new for me. And I haven’t been this happy at a finish line since that first half marathon, two years ago, which was very emotional in a different way. It makes me sad, of course, that I won’t share that feeling with him, but it meant so much to share it with his (and my) family; everyone was super happy with their results, almost everyone had a new PB, and I think most impressive was his daughter, aged 17, who lowered her PB by 15 minutes. \n\nIt seems that Berlin HM will be a lottery race starting next year, so I don’t know if we’ll be able to race it as a family again. But we have our sights set for something else next year…. It seems like Prague is quite likely. I can’t wait. \n\nBut before then…… Stockholm Marathon in 7 weeks. I'll have to temper my hubris.\n\n\nMade with a new [race report generator](http://sfdavis.com/racereports/) created by /u/herumph.",
      "author": "stenskott",
      "created_utc": 1744122304.0,
      "score": 62,
      "num_comments": 5,
      "subreddit": "running"
    }
  ],
  "price_sensitivity": 0.99,
  "channels": [
    "twitter",
    "reddit"
  ]
}